[
    {
        "id": 1,
        "timestamp_start": 2.22,
        "timestamp_end": 55.22,
        "slide_description": "Como Engenheiro de Computação Sênior, analiso o slide da aula de Arquitetura de Computadores. O conteúdo principal exibido é um documento do Microsoft Word, presumivelmente o plano de ensino ou cronograma da disciplina \"OAC\" (Arquitetura de Computadores), intitulado \"OAC_A_Plano_2021-2_v0.docx\". Não há diagramas visíveis de arquitetura (como Datapath, Pipeline ou Hierarquia de Memória em formato gráfico) para descrever a estrutura ou fluxo de dados; em vez disso, os tópicos listados referem-se a esses conceitos.\n\nA transcrição do conteúdo técnico e informativo é a seguinte:\n\n**Documento \"OAC_A_Plano_2021-2_v0.docx\":**\n\nO documento apresenta uma tabela detalhando o progresso da disciplina semana a semana, incluindo laboratórios, provas e tópicos conceituais. As colunas visíveis incluem um número sequencial, duas colunas de datas (possivelmente para aulas teóricas e práticas ou diferentes turmas), e duas colunas de descrição de conteúdo.\n\n**Conteúdo da Tabela:**\n\n*   **Linha 7 (Semana 7/3 - 9/3):**\n    *   `Lab 1B: Software - Compilador C`\n    *   `Lab 2: Hardware - Verilog - ULA (T7)`\n    *   *(Indica introdução ao desenvolvimento de software de baixo nível (compiladores C) e hardware description language (Verilog para Unidade Lógica Aritmética - ULA).)*\n*   **Linha 8 (Semana 14/3 - 16/3):**\n    *   `1ª Prova (P1)`\n    *   `12) Processador Uniciclo: Unidade Operativa (C.4) (T8)`\n    *   *(Aponta para a primeira avaliação e o estudo da Unidade Operativa (Datapath) de um processador uniciclo, com referência ao Capítulo 4 (C.4) e Tarefa 8 (T8).)*\n*   **Linha 9 (Semana 21/3 - 23/3):**\n    *   `13) Processador Uniciclo: Unidade de Controle (C.4) (L1)`\n    *   `Lab 3: Processador Uniciclo(T9) (L2)`\n    *   *(Foca na Unidade de Controle de um processador uniciclo, também no Capítulo 4, com Laboratório 3 (L2) e Tarefa 9 (T9) possivelmente para implementação ou análise do processador uniciclo completo.)*\n*   **Linha 10 (Semana 28/3 - 30/3):**\n    *   `14) Processador Multiciclo: Unidade Operativa (C.4)`\n    *   `15) Processador Multiciclo: Unidade de Controle (C.4) (T10)`\n    *   *(Transição para processadores multiciclo, cobrindo tanto a Unidade Operativa quanto a Unidade de Controle, ambas no Capítulo 4, com a Tarefa 10 (T10).)*\n*   **Linha 11 (Semana 4/4 - 6/4):**\n    *   `Lab 4: Processador Multiciclo`\n    *   `16) Processador Pipeline: Conceitos (C.4) (T11)`\n    *   *(Laboratório dedicado ao processador multiciclo e introdução aos conceitos de Pipeline, no Capítulo 4 e Tarefa 11 (T11).)*\n*   **Linha 12 (Semana 11/4 - 13/4):**\n    *   `17) Pipeline: Unidade Operativa e Controle (C.4)`\n    *   `Lab 5: Processador Pipeline(T12) (L3)`\n    *   *(Aprofundamento no design de processadores pipeline, abordando a Unidade Operativa e de Controle específicas para pipeline, no Capítulo 4, com o Laboratório 5 (L3) e Tarefa 12 (T12).)*\n*   **Linha 13 (Semana 18/4 - 20/4):**\n    *   `18) Exceção e Interrupção (C.4)`\n    *   `19) Memória: Hierarquia (C.5) (T13) (L4)`\n    *   *(Tópicos de Exceção e Interrupção no Capítulo 4, e início da discussão sobre Hierarquia de Memória, no Capítulo 5, com Tarefa 13 (T13) e Laboratório 4 (L4, *possivelmente uma renumeração ou referência a um laboratório anterior se a lista de Labs for contínua, ou um erro de digitação no material original*).)*\n*   **Linha 14 (Semana 25/4 - 27/4):**\n    *   `19.1) Memória: Cache (C.5)`\n    *   `2ª Prova (P2) (T14) (L5)`\n    *   *(Detalhamento da memória Cache, como parte da hierarquia de memória no Capítulo 5, seguido da segunda avaliação (P2), Tarefa 14 (T14) e Laboratório 5 (L5).)*\n*   **Linha 15 (Semana 2/5 - 4/5):**\n    *   `Prova Substitutiva`\n    *   `Apresentação dos Projetos (Pr) (T15)`\n    *   *(Previsão para uma prova substitutiva e a apresentação de projetos finais, associada à Tarefa 15 (T15).)*\n\n**Seção \"Avaliação\" (parcialmente visível abaixo da tabela):**\n\n*   `P1: 1ª Prova: 14/03/2022`\n*   `P2: 2ª Prova: 27/04/2022`\n\n**Elementos Adicionais Visíveis na Tela:**\n\n*   **Título da Janela do Navegador:** \"ConferênciaWeb - Sala de Au...\"\n*   **URL da Sessão:** `live-aws027.mconf.rnp.br/html5client/join?sessionToken=lw7bu6bgnzcxqdgqz`\n*   **Título da Sala de Aula:** \"Sala de Aula de OAC\"\n*   **Cronômetro da Gravação/Transmissão:** `00:36`\n*   **Painel Lateral \"ConferênciaWeb\":**\n    *   Mensagens de boas-vindas e informações sobre a gravação e a plataforma.\n    *   Lista de \"USUÁRIOS (5)\", incluindo \"Marcus Vinicius Lam... (Você)\", \"Luiz Carlos Da Sil...\", \"Eduardo Ferreira ...\", \"Maycon Vinnycus...\", \"Victor Hugo Rodri...\".\n\nEm resumo, o slide documenta o plano de estudos detalhado de uma disciplina de Arquitetura de Computadores, cobrindo tópicos fundamentais como compiladores, linguagens de descrição de hardware (Verilog), projeto de processadores (uniciclo, multiciclo, pipeline), tratamento de exceções/interrupções e hierarquia de memória, incluindo cache. A agenda inclui laboratórios práticos e avaliações regulares, demonstrando uma abordagem teórico-prática na formação em Arquitetura de Computadores.",
        "transcription": "Caraca, hoje é um recorte. Três alunos. Ótimo. Então, vamos lá. Vamos lá pra mais uma aulinha de ISC com três telespectadores. ISC? É OAC isso aqui. Meu Deus do céu. Então, mais uma aulinha de OAC. Hoje é dia 18 de abril, nós estamos aqui. Exceção e interrupção, que nós já começamos a ver na aula passada. Então, essa aula vai ser mais leve. E daí eu posso me aprofundar um pouco mais do que no semestre passado. Então, isso vai ser legal. Depois, nós temos duas aulas de memória cache. E acabou o semestre. Segunda prova, prova substitutiva e apresentação dos projetos. Certo? Então, nós estamos nos últimos cem metros do curso. Então, vamos ver o que nós temos pra hoje.",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 2,
        "timestamp_start": 55.22,
        "timestamp_end": 66.13,
        "slide_description": "Como Engenheiro de Computação Sênior, procedo à análise do slide e conteúdo anotado da aula de Arquitetura de Computadores para extração de informações visuais para um sistema de busca semântica (RAG).\n\n**Conteúdo Visual Principal (Tela de Apresentação):**\nA área central de visualização está completamente vazia e exibe uma tela escura, indicando que nenhum material didático (slides, diagramas, código-fonte ou qualquer outra mídia visual) está sendo exibido no momento.\n\nNo topo desta área, o título da sessão é claramente visível como:\n*   **\"Sala de Aula de OAC\"** (Provavelmente \"Organização e Arquitetura de Computadores\").\n\nHá um indicador de gravação ativo com o tempo decorrido:\n*   **\"01:04\"** (Um minuto e quatro segundos de gravação).\n\nUm rótulo no canto superior esquerdo da tela principal mostra um participante, indicando possível foco ou apresentação:\n*   **\"Marcus Vinicius Lam...\"**\n\n**Conteúdo Textual e Interativo (Barra Lateral Esquerda):**\nA barra lateral esquerda contém informações sobre a plataforma, mensagens e participantes.\n\n1.  **Título da Plataforma:** \"ConferênciaWeb\"\n2.  **Seção \"MENSAGENS\":**\n    *   \"Perguntas\"\n    *   \"Bate-papo público\"\n3.  **Seção \"NOTAS\":**\n    *   \"Notas compartilh...\" (Notas compartilhadas)\n4.  **Seção \"USUÁRIOS (6)\":** (Indica 6 participantes na sala)\n    *   \"Marcus Vini... (Você)\" - (Status: microfone ativo, câmera ativa, compartilhando tela)\n    *   \"Luiz Carlos Da Sil...\"\n    *   \"Eduardo Ferreira ...\"\n    *   \"Maycon Vinnycus...\"\n    *   \"Michel Luis Duwe\"\n    *   \"Victor Hugo Rodri...\"\n\n**Conteúdo do Bate-papo Público:**\nO painel de bate-papo público exibe as seguintes mensagens informativas:\n*   \"Bem vindos à sala de aula de OAC!\"\n*   \"Esta sessão está sendo gravada.\"\n*   \"Para mais informações, clique aqui.\" (O texto \"clique aqui\" é um hiperlink.)\n*   \"Novo na plataforma? Experimente o tour!\" (O texto \"o tour\" é um hiperlink.)\n\n**Ausência de Diagramas ou Código:**\nNão há nenhum diagrama de *Datapath*, *Pipeline*, *Hierarquia de Memória*, ou qualquer trecho de código (Assembly, C, Verilog) visível no conteúdo principal da tela. A apresentação está focada, neste momento, na interação via chat e na participação dos usuários, sem conteúdo visual de aula sendo projetado.\n\n**Sumário para RAG:**\nA aula de Arquitetura de Computadores (OAC) está sendo gravada e tem uma duração atual de 1 minuto e 4 segundos. O palestrante ou apresentador identificado é Marcus Vinicius. Atualmente, a tela de apresentação está em branco, sem exibição de slides, diagramas técnicos (Datapath, Pipeline, Hierarquia de Memória) ou código-fonte (Assembly, C, Verilog). A sessão utiliza a plataforma \"ConferênciaWeb\" e conta com 6 usuários. O bate-papo público exibe mensagens de boas-vindas, um aviso sobre a gravação e links para informações adicionais e um tour da plataforma.",
        "transcription": "Então, exceções e interrupções.",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 3,
        "timestamp_start": 66.13,
        "timestamp_end": 1097.2,
        "slide_description": "Este slide, proveniente de uma aula de Arquitetura de Computadores, especificamente da disciplina CIC0099 – Organização e Arquitetura de Computadores da Universidade de Brasília, ministrada pelo Prof. Marcus Vinicius Lamar, aborda o tema \"Operações de Entrada e Saída\" com foco no método de *polling*.\n\nO slide apresenta dois exemplos de implementação de *polling*: um para a arquitetura x86 e outro para RISC-V.\n\n1.  **Exemplo de Polling no x86**:\n    Este segmento demonstra como um dispositivo de E/S pode ser interrogado continuamente para verificar seu estado antes de ler dados. O código Assembly x86 é apresentado da seguinte forma:\n    ```assembly\n    WAIT:   in AL, 1        # lê estado do dispositivo (porta 1)\n            cmp AL, READY   # compara AL com valor READY\n                            # seta Z=(AL == READY)\n            jnz WAIT        # se Z≠1 repete\n            in AX, 2        # senão lê dado (porta 2) para AX\n    ```\n    A rotina `WAIT` inicia lendo o estado do dispositivo da porta 1 para o registrador `AL` (usando a instrução `in`). Em seguida, compara o valor em `AL` com um valor `READY` predefinido (usando `cmp`). A instrução `cmp` afeta os flags, em particular o flag Zero (Z), que é setado se `AL` for igual a `READY`. A instrução `jnz WAIT` (jump if not zero) cria um loop, fazendo com que o processador repita a leitura e comparação do estado do dispositivo enquanto este não estiver pronto (ou seja, enquanto `Z` for diferente de 1). Uma vez que o dispositivo esteja pronto (`Z=1`), o loop é encerrado, e a instrução `in AX, 2` é executada para ler os dados da porta 2 para o registrador `AX`.\n\n2.  **Exemplo de Polling no RISC-V**:\n    Este segmento ilustra a mesma lógica de *polling*, mas adaptada para a arquitetura RISC-V. O código pseudo-assembly/assembly RISC-V, com definições de constantes e seções de texto, é mostrado como:\n    ```assembly\n    .eqv MASK 0x001\n    .eqv STATUS 0x000\n    .eqv DATA 0x004\n    .text\n    WAIT:   lw t0, STATUS(s0)   # lê estado do dispositivo s0\n            andi t1, t0, MASK   # Isola o bit status por MASK\n            beq t1, zero, WAIT  # se não está pronto repete\n            lw s1, DATA(s0)     # senão lê o dado para s1\n    ```\n    Primeiro, são definidas três constantes simbólicas: `MASK` com valor `0x001`, `STATUS` com `0x000` e `DATA` com `0x004`, provavelmente representando endereços ou offsets de registradores de E/S. A rotina `WAIT` começa com `lw t0, STATUS(s0)`, que carrega o estado do dispositivo (provavelmente de um endereço base em `s0` mais o offset `STATUS`) para o registrador temporário `t0`. Em seguida, `andi t1, t0, MASK` executa uma operação AND bit a bit entre `t0` e `MASK` para isolar o bit de status relevante no registrador `t1`. A instrução `beq t1, zero, WAIT` (branch if equal) cria o loop de *polling*, repetindo a rotina `WAIT` enquanto o bit de status isolado em `t1` for zero (indicando que o dispositivo não está pronto). Uma vez que `t1` não seja zero (dispositivo pronto), o fluxo de execução continua para `lw s1, DATA(s0)`, que carrega os dados do dispositivo (do endereço base em `s0` mais o offset `DATA`) para o registrador `s1`.\n\nO slide não contém diagramas de datapath, pipeline ou hierarquia de memória, focando exclusivamente na apresentação e comparação de exemplos de código Assembly para o mecanismo de *polling* em diferentes arquiteturas.",
        "transcription": "Então, a gente viu o que é uma exceção. Só lembrando, exceções são eventos inesperados internos ao processador. E interrupções são eventos gerados externamente que o processador tem que atender. Pra tratar exceções e interrupções, eu preciso de três coisas. Não, foi no semestre passado, acho, Luís, que me passaram essa imagem aí. Eu li e botei aí. Então, para tratamento dessas exceções e interrupções, eu preciso de três coisas. Conhecer o fato que gerou a exceção e interrupção. Conhecer o endereço da instrução onde ocorreu a exceção e interrupção. E executar uma rotina capaz de acessar os recursos que não podem ser acessíveis ao usuário. Porque ele vai entrar num modo de operação mais privilegiado para poder acessar, tratar as exceções e interrupções. Então, a gente viu como é que acontece o tratamento. Registrador de causa. Interrupção vetorizada. O RISC-V tem três modos, sendo o User Mode não privilegiado, e os outros dois são privilegiados. E cada um deles tem registradores específicos, de utilização específica. Aqui está o banco de registradores CSR. São 4.096 registradores. Então, geralmente, esse banco de registradores não é implementado como flip-flops, como são os registradores originais, mas são implementados como memórias SRAM para criar um acesso mais rápido, tipo aquele L1. Por quê? Porque esse aqui não é continuamente que o processador acessa isso aqui, os registradores de controle de status. Então, aqui estão esses, os principais que nós vamos precisar. E o *status*, o User Status Register, que indica qual é o status que ele está. O Interrupt Enabled (IE), quer dizer, é um bit/campo que tu habilita ou não determinadas interrupções, certo? Então, tu põe 1 e tu habilita. Tu põe 0 e não habilita. O MTVEC, que é o Trap Handler Base Address. Quer dizer, qual é o endereço da rotina de tratamento de exceção. Então, o MTVEC. E o Mscratch, é um registrador a mais para o que a rotina de tratamento de exceção possa usar. Então, ele tem esse aqui, esse registrador aqui, como registrador genérico a mais. O MEPC, que armazena o Exception Program Counter. Quer dizer, qual é o endereço da instrução que aconteceu a exceção, né? E o MCAUSE, que indica qual é a causa da exceção/interrupção, né? E o MTVAL, certo? Que ele retorna um valor que é útil para a rotina de tratamento de exceção. Por exemplo, se for uma exceção de endereço inválido, ele retorna esse endereço inválido. Se for uma instrução inválida, ele retorna essa instrução que foi inválida. Algo que possibilite à rotina de tratamento de exceção mostrar qual foi o erro. Ah, o erro aconteceu em tal endereço. Ah, o erro aconteceu porque eu li essa instrução aqui que eu não conheço. Certo? E o MIP, que é o Interrupt Pending. Porque se várias exceções (isso aqui é para interrupções), se várias interrupções acontecem, pode ser, por exemplo, tem três interrupções no processador. Ele vai ter que ver qual é a mais privilegiada, né? E começar a executar ela. As outras ficam como pendentes. Quando ele acabar de executar o tratamento dessa, aí ele vai para o tratamento dessa, e aí ele vai para o tratamento dessa. Então ele tem que saber quais são as interrupções que estão pendentes. OK? Então esses aqui são os principais, fora os que você já conhece: o mcycle, o mtime e o mhartid. Pronto. Isso aqui são as instruções para ler e escrever nos registradores CSR, né? Foi permitido. As causas de... Ah não! Vocês estão ouvindo isso, né? Não. Não, que bom. Meu gerador de ruído aqui está muito bom. Porque começaram a furar a parede aqui. Como as paredes aqui são de concreto, tem que ser uma brincadeira para furar a parede. Mas vamos lá. Então o registrador de causa. O que que tem que ter? Se for uma interrupção, tem que dizer aqui qual é a interrupção, tá? Se for o registrador de causa, esses aqui são os códigos, né, das exceções que o RISC-V suporta. Então se o primeiro bit da causa for 0, é uma exceção. Se o primeiro bit da causa for 1, é uma interrupção. Certo? Depois vêm esses endereços, quer dizer, esses códigos. Aí isso é o que está armazenado dentro do registrador de causa, tá? Muito bem. Como é feita a definição do endereço do exception handler, da rotina de tratamento de exceção? Meu Deus do céu. Se for a interrupção por registrador de causa, o registrador base, quer dizer, o endereço base, é esse aqui. Quer dizer, o endereço que estiver no MTVEC. Por exemplo, esse X aqui pode ser M-Mode, né? MTVEC. Os 30 bits mais significativos, concatenado com dois zeros. Então vai ser nesse endereço aqui. Então, quem define o endereço onde está localizado o exception handler é o MTVEC, tá? E se for interrupção vetorizada, o MTVEC vai conter, então, essa instrução de trap handler base. Nessa que é o endereço da instrução mesmo. Vai ser dado com esse endereço aqui, tá? Base mais quatro. Então, isso te dá um endereçamento a um vetor. Opções de entrada e saída, vocês já conhecem: por polling e por interrupção, né? Polling: o software fica o tempo todo verificando se aquele dispositivo quer mandar uma mensagem. E por interrupção, né? Nesse caso, o dispositivo notifica o processador. Daí a gente entende que tem também a DMA, né? Que tira da CPU a tarefa de ficar lendo de um dispositivo e escrevendo na memória, lendo do dispositivo e escrevendo na memória. Aí a CPU simplesmente programa o DMA. E o DMA faz, então, essa tarefa de ler do dispositivo e escrever na memória, ler do dispositivo e escrever na memória, e deixando a CPU livre para fazer outras coisas. Eu adoro esse barulho. Agora deu para ouvir. Mas, se vocês conseguem ouvir, imagina o quanto de barulho ele está sendo aqui agora. Mas, vamos... Aqui dá um exemplo de polling em x86. Mas, como a gente viu, a ideia é x86? É só um exemplo aqui. Vocês podem, a partir dessas instruções, inferir o que ele fica fazendo. E aqui dá um exemplo de polling do RISC-V, né? Então seria essa partezinha aqui. Então, lê do endereço `s0` mais o offset `STATUS`. Nesse caso, `STATUS` está definido como 0. Então, o endereço é `s0`. Mascara o valor 1, que é o bit 0. Então, ele vai fazer uma máscara, por exemplo, com esse número aqui, 0, 0, 1. Então, eu estou pegando o primeiro bit, o bit 0. Eu quero somente pegar o valor desse bit, os outros bits vão ser 0, já que eu estou aplicando um AND. Colocou o AND, se tem 1. E aqui eu verifico se esse bit 0 é igual a 0. Se for igual a 0, é porque o dispositivo não quer enviar nada. Então, ele vai para o `WAIT` e fica aqui esperando, até o dispositivo querer mandar alguma coisa. Quando ele quer mandar alguma coisa, esse bit aqui não vai ser 0, vai ser 1. Ele, então, lê do endereço `s0` mais `DATA`, onde `DATA` é esse offset aqui, por exemplo. Então, `s0` mais 4. Lê o valor do dado que o dispositivo quer enviar para `s1`. OK? Então, isso aqui eu só estou mostrando como se usa essa diretiva `.eqv`. Então, `.eqv MASK 0x001` significa que onde tiver `MASK` no programa de vocês, ele vai substituir por `0x001`. Quem faz isso é o montador. OK? Então, OK. Essa é ótima. Então, vamos começar a... Vamos implementar exceções e interrupções nos nossos processadores que a gente desenvolveu aqui em aula. Então, para simplificar a implementação, vamos identificar e tratar três exceções. Uma exceção de instrução inválida. Então, o cause igual a 2. Uma exceção de endereço desalinhado no load. Então, o cause igual a 4. Uma exceção de endereço desalinhado no store. Então, o cause igual a 6. Da onde que saíram esses números? Saíram dessa tabela aqui. Então, o 2, instrução inválida. O 4, load address desalinhado. E o 6, store address desalinhado. OK? Aqui. E, como para fazer o tratamento das exceções, nós vamos precisar do banco de registradores CSR. Então, ao invés de implementar o banco de registradores CSR e implementar aquelas instruções `CSRR`, `CSRW`, `CSRRS`, `CSRRC`, por aí vai. Nós vamos fazer uma coisa mais simples. Só mostrar para vocês qual é a ideia dessa implementação. Então, nós vamos implementar o CSR, mas não todos. Vamos implementar só esses quatro registradores aqui do banco de registradores CSR. O MCAUSE indica a causa da exceção ou interrupção. Você deve armazenar esses valores aqui. O MTVAL, que contém a instrução inválida, nesse caso, ou o endereço desalinhado, nesses dois casos aqui. O MEPC, que indica o endereço da instrução que estava sendo executada quando causou a exceção. O MTVEC, que contém o endereço da rotina de tratamento de exceção. Por exemplo, esse endereço aí. Então, nesse endereço aqui, como ele termina em zero, a exceção é tratada com o registrador de causa. Se fosse um aqui, aí a exceção seria tratada como uma exceção vetorizada. OK? Então, a gente está tratando ela como uma interrupção (ou exceção), usando o registrador de causa. E o endereço dessa rotina de tratamento de exceção é esse aqui. Beleza. Então, vamos lá. Nossa ideia aqui é colocar isso em prática. Então, para isso, está aqui o nosso RISC-V uniciclo. O que nós vamos ter que fazer nesse datapath para permitir, então, a esse processador identificar e tratar aquelas três exceções que a gente viu, certo? Essas três exceções aqui: essa, essa e essa. Então, duas coisas sempre, né? Se eu quero acrescentar uma nova funcionalidade ao processador, eu tenho que garantir que o datapath tenha as funcionalidades necessárias e, depois, configurar o controle, né, para que as funcionalidades sejam, então, identificadas pelo controle, certo? Assim como novas instruções, eu tenho que modificar o datapath e acrescentar a nova instrução no controle. No nosso caso aqui, não vai ser uma nova instrução, vai ser uma exceção. Então, o que nós vamos fazer? O que tem que ser aqui? Nós vamos acrescentar quatro registradores. Estão aqui eles. Esse aqui vai servir para o MTVEC, o MCAUSE, o MEPC e o MTVAL. Então, eu já deixei escrever logo. Eu podia ter logo escrito isso aí, mas... Então, esse aqui vai ser o CAUSE. Ah, claro. Escrever direitinho, pelo menos, né, pessoal? Cadê meu... Ah, não. Sabe, não estou conseguindo escrever aqui, não. Não estou conseguindo apagar. Ah, claro. Então, foi... Bloqueou todo mundo. Eu disse que tu fez. Bloqueei todo mundo? Como assim? Eu não consigo digitar no chat. Mas, daí, eu acho que eu consigo desbloquear. Boa. Como que eu fiz isso? Não sei. Eu estou mexendo na imagem aqui em cima. Ah, meu Deus do céu. Sério, não estou conseguindo. Foi, Eduardo. Dá para fazer agora? Dá, dá. Dá para editar agora. Não, para aí que eu vou ter que ver se está entendido errado. Porque, por isso, tem algo que não está certo. O que é isso? É a furadeira, né? Entender. Não, está errado. Então, eu... A caneta não está apagando. Escrever, ela escreve, mas apagar, ela não. Ah, deixa eu dar uma olhadinha rápida aqui. Só de escutar isso, você escuta a furadeira. Sim, vou... Como é que eu faço para ver se não boto? Não sei. É só você colocar uma furadeira, aí, e aí, você vai... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... Eu vou... É, realmente, eu aperto o botão de apagar e ele para. Puts! Agora isso vai ser tão chato porque eu acho que é problema da minha caneta. Bom, vamos tentar continuar a aula escrevendo tudo sem apagar.",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 4,
        "timestamp_start": 1097.2,
        "timestamp_end": 1103.15,
        "slide_description": "Como Engenheiro de Computação Sênior, analiso o slide e o conteúdo anotado para extrair informações relevantes para um sistema de busca semântica (RAG).\n\nO contexto visual principal é uma interface de conferência ou aula online, identificada como \"ConferênciaWeb\" e especificamente a \"Sala de Aula de OAC\". A sigla \"OAC\" sugere fortemente \"Organização e Arquitetura de Computadores\" ou \"Arquitetura de Computadores\", o que é consistente com o tema da aula. A sessão está sendo gravada, indicado pelo ícone de gravação e o timestamp \"18:26\".\n\n**Conteúdo Textual Transcrito:**\n\n1.  **Título da Sala/Apresentador:** No topo da área principal, é exibido \"Sala de Aula de OAC\" e, abaixo, \"Marcus Vinicius Lam...\" como o principal participante ou apresentador.\n2.  **Barra Lateral de Navegação:**\n    *   **MENSAGENS:**\n        *   Perguntas\n        *   Bate-papo público (selecionado)\n    *   **NOTAS:**\n        *   Notas compartilh... (presumidamente \"Notas compartilhadas\")\n    *   **USUÁRIOS (8):** Lista de participantes, incluindo:\n        *   Marcus Vini... (Você)\n        *   Luiz Carlos Da Sil...\n        *   Eduardo Ferreira ...\n        *   João Alberto Trav...\n        *   Marcello Brandao ...\n        *   Maycon Vinnycus...\n        *   Michel Luis Duwe\n        *   Victor Hugo Rodri...\n3.  **Conteúdo do Bate-papo Público:** A conversa entre os participantes inclui as seguintes mensagens, com timestamps entre 14:01 e 14:16:\n    *   **Eduardo Ferreira Mar... 14:01:** \"100 m que devemos correr sem uma perna\"\n    *   **Luiz Carlos Da Silva N... 14:01:** \"ou eu n lembro dessa imagem no começo mas maei\"\n    *   **Luiz Carlos Da Silva N... 14:01:** \"amei*\"\n    *   **Eduardo Ferreira Mar... 14:01:** \"achei foi tu que fez luisz\"\n    *   **Luiz Carlos Da Silva N... 14:02:** \"infelizmente n\"\n    *   **Luiz Carlos Da Silva N... 14:02:** \"adoraria ter sido o genio\"\n    *   **Eduardo Ferreira Mar... 14:10:** \"oquei\"\n    *   **Marcello Brandao Sca... 14:15:** \"furadeira hacker\"\n    *   **Eduardo Ferreira Mar... 14:16:** \"🏘️ 👷🏽 🚧 Obras na casa do lamar destruindo a aula 😩 🤦🏽 🤦🏻\"\n    *   Abaixo do chat, há um campo de entrada de texto: \"Enviar mensagem para Bat...\" (presumidamente \"Bate-papo público\").\n\n**Conteúdo Visual (Diagramas/Estruturas/Fluxo de Dados):**\n\nO painel principal de exibição, que é a área designada para a apresentação de slides, diagramas ou código da aula, está **completamente vazio e escuro**. Não há diagramas de datapath, pipeline, hierarquia de memória, modelos de arquitetura de processadores, circuitos lógicos, blocos de controle, fluxo de instruções, estruturas de dados, ou quaisquer representações visuais ou textuais (como código Assembly, C, Verilog) relacionadas ao conteúdo de Arquitetura de Computadores. Isso indica que, no momento da captura da imagem, nenhum material didático específico da disciplina estava sendo compartilhado ou exibido na tela principal, ou o slide atual era intencionalmente em branco. O conteúdo visível limita-se à interface da plataforma de conferência e às interações no chat.\n\n**Resumo para RAG:** A imagem representa uma interface de aula online de Arquitetura de Computadores (OAC) em andamento e gravada. O conteúdo principal da aula (slides, diagramas, código) está ausente na tela de apresentação. O conteúdo visível se restringe a interações de chat entre alunos e um apresentador, com mensagens que variam de comentários informais a brincadeiras, e a lista de participantes da sessão. As mensagens do chat não contêm termos técnicos ou conceitos diretamente relacionados à Arquitetura de Computadores, sendo conversas gerais entre os participantes.",
        "transcription": "É eu fazendo a minha própria caneta no ensino médio",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 5,
        "timestamp_start": 1103.15,
        "timestamp_end": 1106.01,
        "slide_description": "Como um Engenheiro de Computação Sênior, analisei o slide apresentado de uma aula de Arquitetura de Computadores. O conteúdo principal é um plano de curso ou cronograma, exibido em um documento do Microsoft Word, com anotações e informações contextuais do curso.\n\n**1. Transcrição Fiel de Texto, Título e Código:**\n\nO documento exibido é intitulado \"OAC_A_Plano_2021-2_v0.docx\".\nNo canto superior direito do documento, são visíveis as seguintes informações institucionais:\n*   Universidade de Brasília\n*   Departamento de Ciência da Computação\n*   Prof. Marcus Vinicius Lamar\n*   CIC0090 - Organização e Arquitetura de Computadores\n\nA parte central do slide apresenta uma tabela cronológica detalhando tópicos, laboratórios e avaliações. Abaixo, há uma seção de \"Avaliação\".\n\n**Conteúdo da Tabela (coluna de datas / coluna de conteúdo):**\n\n*   **Linha ~6:** (coluna da direita) FERIADO\n*   **Linha 7:** 7/3 | 9/3 | Lab 1B: Software – Compilador C\n*   **Linha 8:** 14/3 | 16/3 | 1ª Prova (P1) | Lab 2: Hardware – Verilog – ULA (T7)\n*   **Linha 9:** 21/3 | 23/3 | 13) Processador Uniciclo: Unidade de Controle (C.4) (L1) | Lab 3: Processador Uniciclo (T8) (Nota: O \"T8\" está riscado, e \"L2\" foi escrito à mão ao lado.)\n*   **Linha 10:** 28/3 | 30/3 | 14) Processador Multiciclo: Unidade Operativa (C.4) | 15) Processador Multiciclo: Unidade de Controle (C.4) (T10)\n*   **Linha 11:** 4/4 | 6/4 | Lab 4: Processador Multiciclo | 16) Processador Pipeline: Conceitos (C.4) (T11) (Nota: Uma seta grande e grossa, desenhada à mão, aponta de \"Processador Multiciclo\" para \"Processador Pipeline\").\n*   **Linha 12:** 11/4 | 13/4 | 17) Pipeline: Unidade Operativa e Controle (C.4) | Lab 5: Processador Pipeline (T12) (L3)\n*   **Linha 13:** 18/4 | 20/4 | 18) Exceção e Interrupção (C.4) | 19) Memória: Hierarquia (C.5) (T13) (L4)\n*   **Linha 14:** 25/4 | 27/4 | 19.1) Memória: Cache (C.5) | 2ª Prova (P2) (T14) (L5)\n*   **Linha 15:** 2/5 | 4/5 | Prova Substitutiva | Apresentação dos Projetos (Pr) (T15)\n*   **Linha 16:** (Vazio)\n*   **Linha 17:** (Vazio)\n\n**Seção \"Avaliação\":**\n\n*   P1: 1ª Prova: 14/03/2022\n*   P2: 2ª Prova: 27/04/2022\n\n**2. Descrição de Diagramas:**\n\nNão há diagramas complexos como Datapath, Pipeline ou Hierarquia de Memória visualmente representados no slide. O conteúdo se limita à descrição textual de conceitos de arquitetura de computadores, como processadores uniciclo e multiciclo, pipeline, exceções/interrupções e hierarquia de memória/cache. Existe uma anotação manual em forma de seta apontando do tópico \"Processador Multiciclo\" para \"Processador Pipeline\", sugerindo uma progressão conceitual ou dependência entre os tópicos.\n\n**Informações Contextuais Adicionais (relevantes para um RAG sobre o curso):**\n\nA interface de videoconferência mostra que a aula ocorre na \"Sala de Aula de OAC\". O nome do professor é \"Marcus Vinicius Lamar\". O curso é \"CIC0090 - Organização e Arquitetura de Computadores\". A lista de tópicos detalha uma progressão desde a implementação de software (compilador C), passando por hardware (Verilog para ULA), design de processadores (uniciclo e multiciclo, com unidades de controle e operativa), pipeline, exceções e interrupções, até a hierarquia de memória, incluindo cache. A existência de \"Labs\" (Lab 1B, Lab 2, Lab 3, Lab 4, Lab 5) indica uma forte componente prática no curso. Os códigos \"(C.x)\", \"(Tx)\", \"(Lx)\" provavelmente referem-se a capítulos ou seções de material de estudo (\"C\") ou aulas teóricas/tópicos (\"T\") e laboratórios (\"L\"), respectivamente.",
        "transcription": "É, no módulo",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 6,
        "timestamp_start": 1106.01,
        "timestamp_end": 1170.34,
        "slide_description": "Como um Engenheiro de Computação Sênior, analiso o slide e o contexto fornecido.\n\nO conteúdo visual principal deste \"slide\" de uma aula de Arquitetura de Computadores é notavelmente *ausente* de qualquer material didático diretamente relacionado à disciplina, como diagramas de datapath, pipelines, hierarquias de memória, ou exemplos de código (Assembly, C, Verilog). A área central designada para a apresentação do conteúdo da aula está completamente em branco, exibindo um fundo escuro uniforme.\n\nA informação extraível e transcrevível é composta primariamente por metadados de uma plataforma de conferência web e interações de chat entre os participantes.\n\n**Conteúdo Textual Transcrito:**\n\n1.  **Título da Aplicação/Sessão:**\n    *   No painel lateral esquerdo: \"ConferênciaWeb\"\n    *   Na barra superior central: \"Sala de Aula de OAC\" (OAC provavelmente denota \"Organização e Arquitetura de Computadores\").\n    *   Na barra superior central, um indicador de tempo: \"18:34\" (com um círculo vermelho, indicando gravação ou status ativo).\n\n2.  **Navegação e Menus do Painel Lateral Esquerdo:**\n    *   \"MENSAGENS\"\n        *   \"Perguntas\" (com ícone de mão levantada)\n        *   \"Bate-papo público\" (com ícone de balão de fala)\n    *   \"NOTAS\"\n        *   \"Notas compartilh...\" (com ícone de arquivo/documento)\n    *   \"USUÁRIOS (8)\" (com ícone de engrenagem para configurações)\n\n3.  **Lista de Usuários Ativos (8 no total, visíveis):**\n    *   \"Marcus Vinicius Lam... (Você)\"\n    *   \"Luiz Carlos Da Sil...\"\n    *   \"Eduardo Ferreira ...\"\n    *   \"João Alberto Trav...\"\n    *   \"Marcello Brandao...\"\n    *   \"Maycon Vinnycus...\"\n    *   \"Michel Luis Duwe\"\n    *   \"Victor Hugo Rodri...\"\n    *   Na parte superior da tela principal, há também uma lista abreviada de participantes com câmeras/microfones ativados ou em destaque: \"Marcus Vinicius Lam...\", \"Eduardo Ferreira Ma...\", \"Luiz Carlos Da Silva ...\".\n\n4.  **Conteúdo do Bate-papo Público:**\n    *   **Eduardo Ferreira Mar... (14:01):** \"100 m que devemos correr sem uma perna\"\n    *   **Luiz Carlos Da Silva N... (14:01):** \"ou eu n lembro dessa imagem no começo\"\n    *   **Luiz Carlos Da Silva N... (14:01):** \"mas maei\"\n    *   **Luiz Carlos Da Silva N... (14:01):** \"amei*\"\n    *   **Eduardo Ferreira Mar... (14:01):** \"achei foi tu que fez luissz\"\n    *   **Luiz Carlos Da Silva N... (14:02):** \"infelizmente n\"\n    *   **Luiz Carlos Da Silva N... (14:02):** \"adoraria ter sido o genio\"\n    *   **Eduardo Ferreira Mar... (14:10):** \"oquei\"\n    *   **Marcello Brandao Sca... (14:15):** \"furadeira hacker\"\n    *   **Eduardo Ferreira Mar... (14:16):** \"👷‍♂️🚧 obras na casa do lamar destruindo a aula 👷‍♂️🚧\"\n\n**Descrição de Diagramas/Estrutura/Fluxo de Dados:**\n\nNão há diagramas (Datapath, Pipeline, Hierarquia de Memória) ou qualquer representação gráfica técnica de arquitetura de computadores visível neste \"slide\". O conteúdo é puramente textual, relacionado à interface e interação de uma plataforma de aula online. Não é possível inferir estrutura ou fluxo de dados de componentes arquitetônicos a partir da imagem fornecida.\n\n**Síntese para um Sistema de Busca Semântica (RAG):**\n\nEste documento representa um artefato de uma aula online intitulada \"Sala de Aula de OAC\" (Organização e Arquitetura de Computadores), utilizando a plataforma \"ConferênciaWeb\". Embora o conteúdo da palestra esteja ausente, o registro captura interações do bate-papo público entre alunos como Eduardo Ferreira, Luiz Carlos Da Silva, e Marcello Brandao, com timestamps variando de 14:01 a 14:16. As mensagens discutem tópicos informais, incluindo referências a imagens, comentários sobre autoria (\"achei foi tu que fez luissz\"), e distrações (\"obras na casa do lamar destruindo a aula\"). A lista de usuários presentes inclui Marcus Vinicius Lam, Maycon Vinnycus, Michel Luis Duwe, Victor Hugo Rodri, entre outros. A imagem não contém nenhum material de arquitetura de computadores, focando apenas na infraestrutura de comunicação da aula.",
        "transcription": "Modo permanente, modo arriscado. Então, vamos lá, modo super arriscado. Bom. Então, isso aqui é a **fase**. Esse aqui é o **Decode**. Esse aqui vai ser o **Divide**. Esse aqui é o **Execute**. São esses quatro **estados** aqui. Não é intervalo, só **vale**. Esse aí é o **Execute**.",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 7,
        "timestamp_start": 1170.34,
        "timestamp_end": 2936.91,
        "slide_description": "Como Engenheiro de Computação Sênior, apresento a análise técnica detalhada do slide e conteúdo anotado da aula de Arquitetura de Computadores para um sistema de busca semântica (RAG):\n\nO slide, intitulado **\"RISC-V Uniciclo\"**, apresenta o diagrama do *datapath* (caminho de dados) de um processador RISC-V de ciclo único, típico em estudos de Arquitetura de Computadores. O cabeçalho indica o contexto acadêmico: **\"UnB – CIC0099 – Organização e Arquitetura de Computadores\"**, da **\"Universidade de Brasília, Departamento de Ciência da Computação\"**, ministrado pelo **\"Prof. Marcus Vinicius Lamel\"**.\n\n**Conteúdo Visual Principal: Datapath RISC-V Uniciclo**\n\nO diagrama ilustra o fluxo de dados para execução de instruções em um único ciclo de clock, abrangendo as cinco etapas clássicas de um pipeline (Fetch, Decode, Execute, Memory, Write Back), embora aqui todas ocorram simultaneamente no mesmo ciclo.\n\n1.  **Instruction Fetch (Busca de Instrução):**\n    *   Um registrador **PC** (Program Counter) armazena o endereço da instrução atual.\n    *   O valor do **PC** é enviado para a **Instruction memory** (memória de instrução) para buscar a instrução.\n    *   Paralelamente, o **PC** é somado a 4 (usando uma unidade **Add**) para calcular o endereço da próxima instrução sequencial (**PC+4**).\n    *   Um multiplexador (**MUX**, com entradas 0 e 1) seleciona entre **PC+4** e um endereço de desvio/salto calculado (saída de outra unidade **Add**), determinando o próximo valor do **PC**.\n    *   A saída da **Instruction memory** é a **Instruction [31-0]** (instrução completa de 32 bits).\n\n2.  **Instruction Decode & Register Fetch (Decodificação e Busca de Registradores):**\n    *   A **Instruction [6-0]** (opcode) é enviada para a unidade de **Control** (controle).\n    *   A unidade **Control** gera os sinais de controle para todos os componentes do *datapath*: `Branch`, `MemRead`, `MemtoReg`, `ALUOp`, `MemWrite`, `ALUSrc`, `RegWrite`.\n    *   A instrução também é dividida para acessar os **Registers** (banco de registradores):\n        *   **Instruction [19-15]** especifica o `Read register 1`.\n        *   **Instruction [24-20]** especifica o `Read register 2`.\n        *   **Instruction [11-7]** especifica o `Write register`.\n    *   O banco de registradores fornece `Read data 1` e `Read data 2`.\n    *   O módulo **Imm Gen** (Immediate Generator) utiliza partes da **Instruction [31-0]** e **Instruction [30,14-12]** para gerar o valor imediato, que pode ser um dos operandos da ALU ou parte do cálculo de endereço de branch/jump.\n\n3.  **Execute (Execução):**\n    *   `Read data 1` (do primeiro registrador lido) é um dos operandos da **ALU** (Arithmetic Logic Unit).\n    *   O segundo operando da **ALU** é selecionado por um **MUX** (controlado por `ALUSrc`): pode ser `Read data 2` (do segundo registrador lido) ou o valor imediato (`Imm Gen`).\n    *   A **ALU** executa a operação controlada pela unidade **ALU control**.\n    *   A unidade **ALU control** recebe `ALUOp` (da unidade **Control**) e partes da instrução (`Instruction [30,14-12]`, que correspondem aos campos funct3 e funct7 para instruções R-type).\n    *   A **ALU** produz `ALU result` e um sinal `Zero` (indicando se o resultado é zero, crucial para branches condicionais).\n\n4.  **Memory Access (Acesso à Memória):**\n    *   O `ALU result` é utilizado como `Address` para a **Data memory** (memória de dados).\n    *   `Read data 2` é usado como `Write data` para a **Data memory** em operações de escrita.\n    *   A **Data memory** é controlada pelos sinais `MemRead` e `MemWrite` (da unidade **Control**).\n    *   Em caso de leitura, a **Data memory** produz `Read data`.\n\n5.  **Write Back (Escrita de Resultado):**\n    *   Um **MUX** (controlado por `MemtoReg`) seleciona qual valor será escrito de volta no banco de **Registers**: o `ALU result` (para instruções R-type ou imediatas) ou o `Read data` da **Data memory** (para instruções de load).\n    *   Este valor é o `Write data` para o banco de **Registers**, e a escrita é habilitada pelo sinal `RegWrite`.\n\n**Lógica de Branch/Jump:**\n*   A saída de uma unidade **Shift left 1** (que desloca um valor imediato de branch em 1 bit para esquerda, multiplicando por 2, considerando que endereços são alinhados por palavra) e o **PC+4** são somados por uma unidade **Add** para gerar o endereço alvo de um branch.\n*   A condição de branch é determinada por um sinal **AND** que combina o sinal `Branch` (do **Control**) com o sinal `Zero` (da **ALU**). Este sinal controla o **MUX** que atualiza o **PC**.\n\n**Anotações Manuscritas em Vermelho:**\n*   `0x00400000`: Provavelmente um endereço inicial para o **PC** ou um ponto de interesse na memória.\n*   `TRAC`: Possivelmente relacionado a um mecanismo de *trace* ou depuração.\n*   Setas e linhas vermelhas sublinham fluxos de dados importantes ou pontos de controle.\n*   Na parte superior direita, são visíveis componentes de tratamento de exceções/interrupções (um *common practice* em RISC-V para `CSRs` - Control and Status Registers):\n    *   Três pares de `MUX`es (0/1) para sinais que parecem ser `CAUSE`, `EC` (Exception Code), `EP` (Exception Program Counter), `VAL` (Trap Value), `EV`. Estes provavelmente se referem aos registradores `mcause`, `mepc`, e `mtval` do RISC-V, que armazenam informações sobre a exceção/interrupção.\n    *   Os números `2`, `y`, `0`, `1`, `X` ao lado indicam os estados ou valores desses sinais de controle/multiplexadores.\n    *   `FC` e `TCCL` são outras anotações, cujo contexto específico não é claro apenas pela imagem, mas podem se referir a Function Call ou Trap Cause Code Latch.\n\n**Tabela de Sinais de Controle (Control Signal Table):**\nA tabela abaixo do *datapath* descreve os valores dos sinais de controle para algumas instruções RISC-V, ilustrando como a unidade de **Control** configura o *datapath* para diferentes operações:\n\n| Instrução | ALUSrc | MemtoReg | RegWrite | MemRead | MemWrite | Branch | ALUOp |\n| :-------- | :----- | :------- | :------- | :------ | :------- | :----- | :---- |\n| **Tipo-R** | 0      | 0        | 1        | 0       | 0        | 0      | 10    |\n| **lw**    | 1      | 1        | 1        | 1       | 0        | 0      | 00    |\n| **sw**    | 1      | X        | 0        | 0       | 1        | 0      | 00    |\n| **beq**   | 0      | X        | 0        | 0       | 0        | 1      | 01    |\n\n*   **Tipo-R**: O segundo operando da ALU vem de um registrador (`ALUSrc=0`), o resultado da ALU é escrito no registrador destino (`MemtoReg=0`, `RegWrite=1`), não há acesso à memória (`MemRead=0`, `MemWrite=0`), não é um branch (`Branch=0`), e a ALU executa uma operação genérica de tipo R (`ALUOp=10`).\n*   **lw (Load Word)**: O segundo operando da ALU é um imediato (`ALUSrc=1`), o dado lido da memória é escrito no registrador destino (`MemtoReg=1`, `RegWrite=1`), há leitura da memória (`MemRead=1`, `MemWrite=0`), não é um branch (`Branch=0`), e a ALU realiza uma soma para calcular o endereço (`ALUOp=00`).\n*   **sw (Store Word)**: O segundo operando da ALU é um imediato (`ALUSrc=1`), não há escrita em registrador (`RegWrite=0`, `MemtoReg=X` - irrelevante), há escrita na memória (`MemRead=0`, `MemWrite=1`), não é um branch (`Branch=0`), e a ALU realiza uma soma para calcular o endereço (`ALUOp=00`).\n*   **beq (Branch if Equal)**: O segundo operando da ALU vem de um registrador (`ALUSrc=0`), não há escrita em registrador (`RegWrite=0`, `MemtoReg=X` - irrelevante), não há acesso à memória (`MemRead=0`, `MemWrite=0`), é um branch condicional (`Branch=1`), e a ALU realiza uma subtração para comparar os operandos e gerar o sinal `Zero` (`ALUOp=01`).\n\n**Instruções Anotadas Manuscritamente na Tabela:**\n*   `jm Sin`\n*   `Lw DA`\n*   `Sw DA`\nEssas são provavelmente variações ou instruções específicas discutidas na aula, talvez \"jm Sin\" para Jump Signed, e \"Lw DA\" e \"Sw DA\" para Load/Store Data Aligned ou com modos de endereçamento específicos.\n\nO slide fornece uma visão compreensível do funcionamento de um processador RISC-V de ciclo único, destacando os componentes essenciais e o fluxo de controle para instruções básicas e tratamento de exceções.",
        "transcription": "Não tinha escrito aqui. Tinha, mas acho que a gente tem que fazer todos os passos de novo. É a parte da coisa... Você escreveu? Você botou pra descartar lá quando você... Não, não é quando... Sim, olha! Está gravado. Olha aqui! Não está gravado? Meu Deus do céu. `mcause`, `mepc`, `mtval`. Bom, vamos lá.\n\nEntão, vamos ver aqui. Eu sei que vou precisar incluir esses quatro registradores. Esses quatro registradores não podem ser escritos a qualquer momento, então não é na borda de subida de clock que eles são escritos. Ele tem que ser escritos quando eu mandar ele escrever, certo? Então eu vou ter que botar aqui um `enable` para o `mcause`, um `enable` para o `mepc` e um `enable` para o `mtval`. Então eu só vou escrever nesses registradores quando esses `enables` estiverem ativados, ok?\n\nA mesma coisa aqui, o `MTVEC`. A gente nem precisa escrever porque ele já está escrito com o endereço. A gente vai colocar aqui, ele já está escrito com o endereço `0x800000`, certo? Que é o endereço da rotina de tratamento de exceção. Ok.\n\nEntão, o que que eu vou gravar nele? Eu vou gravar, no registrador `mcause`, eu vou ter que gravar: ou 2, ou 4, ou 6. São as causas, certo? No `mepc`, o que que eu vou gravar no `mepc`? O PC atual, o PC de onde ocorreu a exceção. Onde é que tem o PC atual aí? Ali, ó. Basta eu pegar daqui, que eu tenho o PC atual. Vai dizer que eu perdi tudo? Como assim? 2, 4, 6, entra aqui: enable `mcause`, enable `mepc` e enable `mtval`. Certo? De onde que vem esse PC? Não é aqui que eu tenho que botar? Ah, bom. Esse aqui é do multiciclo. É daqui que tem que botar. Que susto, cara. De onde que vem, então, esse sinal aqui? Vem do PC. O PC tá aqui, certo? Ah, não. O PC atual. Então eu vou pegar esse valor aqui e botar aqui, ok? Ok, tudo bem? Quer dizer, eu vou gravar no `mepc` o valor do PC atual. O que que vai ser o `mtval`? O `mtval`, certo? Então, se a instrução for inválida, o que eu tenho que escrever é a instrução, a própria instrução. Onde que aqui eu tenho a instrução que foi definida e que eu detectei como sendo inválida? Na saída dessa memória de instruções. Então, aqui eu tenho a instrução que eu detectei como sendo inválida e é isso que eu quero salvar aqui. E se por acaso for o endereço do `load` ou do `store` quando eles forem inválidos? Quem é que calcula o endereço do `store`, do `load`? Pessoal, a ULA? Não. A ULA tá aqui. A ULA... O resultado, o endereço, tá? Então é a ULA, o resultado que eu tenho na ULA, que eu tenho que vir pra cá, certo?\n\nEntão, desse modo, nós configuramos o que tem que ser escrito nesses registradores ao vir a borda, se esses sinais aqui estiverem ativados. Então, a causa que nós vamos ter que escolher agora vai ser gravada no `mcause`. O PC vai ser gravado no `mepc`. E um desses dois valores, que é ou a instrução ou o endereço da ULA (quer dizer, o endereço que eu estou acessando a memória), vai ser gravado no `mtval`. E o que mais que eu preciso fazer? Preciso que, quando acontecer a exceção, ao invés dele gravar no PC o valor que vinha originalmente, seja `PC+4` ou endereço do `JALR` ou do `BEQ` (nesse caso aqui não tem `JAL`), ao invés de eu gravar no PC esse endereço, eu vou ter que gravar no PC esse endereço aqui que está no `MTVEC`. Então eu vou precisar colocar... Cadê o meu condicionador? Achei. Então eu vou ter que botar aqui o multiplexador. Se for 0, ele pega o endereço direto. Se for 1, ele vai pegar o endereço do `MTVEC`, e isso vem pro PC. Ok.\n\nVamos ver essa parte aqui. Então, esse multiplexador vai ter que ser controlado também. Deixa eu ver aqui, olha só. Deixa eu ver aqui, tá? Tem que ser controlado por um 'Escreve `MTVEC`', ok? Ou também podemos simplificar isso aí para 'ET Escreve `MTVEC`'. Esses aqui são `enables` que não deve ser um 'Escreve' também, só que aqui eu estou selecionando qual é o endereço. Estou selecionando qual é o endereço que vai ser gravado no PC, se vai ser o endereço original do processador ou o endereço do `MTVEC`, da rotina de tratamento de exceção. Ok? Até aí tudo bem? Tranquilo, pessoal? Beleza. Agora nós vamos ter que ver quem que detecta que é uma instrução inválida. Quem que descobre que isso é uma instrução inválida? Quem que sabe que a instrução que eu li aqui é inválida? Claro que nosso sistema está usando só o `opcode` pra ele ver que a instrução é inválida. Se fosse verificar mesmo, teria que verificar o `opcode`, o `funct3` e o `funct7`. Mas no nosso caso aqui, eu só vou verificar o `opcode`. Se o `opcode` não for nem desses que eu conheço, que são esses aqui, vou dizer que é uma instrução inválida. Ok? Então, quem que sabe se a instrução é inválida? O controle. Então, ele pode me dar um sinal aqui. Vamos lá, vamos lá, de instrução inválida, `II`. Ok? Então, quando o controle detectar uma instrução inválida, ele vai acionar esse `II` aqui. Entendido? Eu coloquei um novo sinal aqui de saída, `II`. Que mais? Como é que eu sei que o endereço aqui está desalinhado? Como é que eu descubro que esse endereço está desalinhado? O que é um endereço desalinhado, pessoal? Quando que eu sei que o endereço está desalinhado? Não, não. Eu quero saber o que que eu sei que o endereço está desalinhado, eu olhando o endereço. Como é que eu sei que esse endereço está desalinhado? Não. O endereço desalinhado, ele pode estar em qualquer posição da memória. Não necessariamente tem que estar no `.text`. Como é que eu sei que o endereço qualquer está alinhado ou desalinhado? Ah, não sei, professor. Desculpa. Vamos ver se o Michael diz aí. É divisível por 4. Isso. Tudo bem, entendi. Significa que o endereço é múltiplo de 4. Se o endereço é múltiplo de 4, ele está alinhado, certo? Então, 0, 4, 8, 12, 16, 20 por aí vai. Logo, se o endereço terminar... Cadê? Cadê? Cadê? Cadê? Cadê? Eu, eu, eu, eu, eu aqui... verde aqui e falso aqui, que eu quero saber o endereço desalinhado, certo? Eu só preciso verificar os dois últimos bits do endereço. Cadê o endereço? Cadê o meu cursor? Isso, isso. Uma porta OR aqui. Então, uma porta OR dos bits 0 e do bit 1 do endereço é o suficiente para saber se ele está desalinhado, certo? Onde é que eu tenho esses dois bits? Então, daqui, ao invés de eu colocar daquele jeito lá, eu vou escrever de um modo mais simplificado. Quer dizer, eu tenho o bit 0 e o bit 1, o bit do endereço, quer dizer, o bit menos significativo do endereço e o segundo bit menos significativo do endereço. Isso aqui vai me dizer se ele está alinhado, se ele está desalinhado. Quando for 1 ali, é porque ele está desalinhado, ok? Entendido? Então, eu vou chamar isso aqui de sinal `desalinhado`. Beleza! Pra onde que vai esse sinal `desalinhado`? Quem que tem que saber se o sinal está desalinhado? Quer dizer, se o endereço está desalinhado para tomar alguma atitude? O controle. Então, eu vou colocar isso aqui como uma nova entrada do controle, certo? Nosso `DA` (sinal desalinhado), ele entra no controle. E assim, o controle fica sabendo se aquilo que ele quer fazer gerou um endereço desalinhado, certo? Para `load` e `store`. Beleza? Eu acho que é só isso que precisa. Está faltando mais alguma coisa? Acho que não. Então, vamos lá.\n\nEntão, se eu coloquei mais um dado de entrada aqui, eu vou ter que colocar em que situações eu preciso que o controle tome alguma atitude. Então, a primeira situação, quando for uma instrução inválida. Então, vou colocar aqui na tabela de verdade: se for uma instrução inválida, instrução inválida, eu vou ter que tomar alguma atitude. No outro caso, se for um `load` e o desalinhado for um, eu tenho que tomar outra atitude. Se for um `store` e o desalinhado for um, eu tenho que tomar outra atitude. Certo? Aqui eu vou precisar colocar se for um `load` e o desalinhado... Não, não interessa o desalinhado. Não, se for um `load` e o desalinhado não interessa o desalinhado. Não, deixa assim. Deixa sem o... Porque o controle vai mudar. Ah, eu não posso apagar. Esqueci. Eita. Então, eu tiro esse negócio daqui. Pronto, apaguei. Então, são essas três situações que eu preciso identificar agora: se é uma instrução inválida (é o controle que decide isso, ele sabe se é uma instrução...), se for um `load`, o controle sabe se é um `load`, e se ele estiver desalinhado (quer dizer, esse bit for um), aí eu vou ter que tomar uma atitude. Se for um `store` e estiver desalinhado, eu vou ter que tomar outra atitude, tá? Isso aqui eu queria fazer um AND aqui com ele `desalinhado`, com ele `alinhado`. Mas já vim de volta. Se eu colocar aqui: AND `desalinhado` barra, AND `desalinhado` barra, AND `desalinhado` barra, AND `desalinhado` barra... Deixa eu tentar ser escravo. Meu Deus do céu. Cadê meu cursor? AND `desalinhado` barra. Certo? Assim eu fico com... Essa aqui também, AND `desalinhado` barra. Assim eu fico com essas duas condições. Se o `DA` é negativo, é positivo, quer dizer, é positivo... É ruim. O pior é que eu acho que não funciona, Marcelo. Porque ele vai pintar de branco, não de transparente. Não vai virar aquilo que eu pintei. Ele vai pintar de brancozinho. Isso aqui não é branco, é azul. Pinta de azul. É eu achar esse azul aqui pra pintar. Não esquece. Tem como selecionar a cor, tipo... Sim, tem que ficar fazendo isso. Não é importante. Não, o importante é ele funcionar. Essa caneta aqui. Eu estou impressionado que caiu no chão e estragou alguma coisa. Mas vamos lá.\n\nBeleza, então tem a lista das instruções: esse, esse, esse, esse. Instrução inválida. Quer dizer, se o `opcode` não for nenhum desses, eu tenho que acionar essa instrução inválida. É porque é uma instrução inválida, certo? O `opcode` não é nem esse, nem esse, nem esse, nem esse. É uma instrução inválida, certo? Entendido, pessoal? Quer dizer, na tabela-verdade, o `opcode` vai escrever tudo para o tipo R, para o `load`, para o `BEQ`, e para as outras condições vai ser isso aqui. Não, a instrução inválida, ele sabe aqui no momento que ele deu a instrução. Aí ele sabe que é inválido, certo? O endereço desalinhado, sim, ele só vai saber como calcular. Mas a instrução ou vai ser um `load` ou vai ser um `store`. Então ele sabe qual é a instrução, certo? Certo. Beleza. E agora o meu controle vai ter que gerar todos esses sinais aqui: o `ET`, o `EC` (enable cause), o `EP` (enable mepc) e o `EV` (enable mtval). Aí, mais ainda aqui, vamos colocar esse aqui como sendo `SC` (seleciona a causa) e esse aqui `SV` (seleciona o valor). São esses dois seletores aqui. Então a gente tem mais um, 1, 2, 3, 4, 5, 6 sinais de controle, certo? Quem vai gerar esses sinais de controle? O controle, obviamente. Então, o controle vai ter que gerar todos esses sinais de controle. Depois vocês vão ver que esses aqui são todos iguais, tá? Esse vai ser igual a eles, mas vamos fazer do modo clássico. Eu estou controlando para cada registrador, eu controlo com um sinal. Controlar tudo com um sinal só vai funcionar? Pode ter efeitos colaterais não previstos, tá? Então, eu vou ter o 'escreve `MTVEC`', o `SC` (que é o 'seleciona causa'), o `EC` (que é o 'escreve causa'), o `SV` (que é o 'seleciona valor'), o `EV` (que é o 'escreve valor'), e o `EEP` (que é o 'escreve `mepc`'). Na realidade, escreve `mepc`, mas vamos colocar como `mepc`. Ok? Eu preciso de... Ah, professor. Oi. Ela ia gerar efeitos numéricos. Você falou que isso aí precisa de outros efeitos de checagem. Mas os efeitos de checagem vão gerar outros efeitos de checagem, checa e checa, porque não tem efeitos colaterais. Não pode ter, tá? Nesse caso aqui, não vai ter. Em um sistema maior, a gente não faz esse tipo de coisa, tá? Em um sistema mais complexo: colocar todos os registradores controlados por um único sistema, por um único sinal. Tá? Isso é fora das boas recomendações de hardware. A gente faz o controle de cada um deles separadamente. Não, não, não. Não tem clock. O clock é um só para todo o circuito. Vem a borda de subida de clock. O que que acontece? Vindo a borda de subida de clock, isso aqui vai ler do PC (o que tiver no PC, né?). Vai ler a instrução. Aí o controle vai decidir se a instrução é válida ou não. Se a instrução for inválida, o que que ele tem que fazer? A instrução é inválida. Então, o `ALUSrc` tem que ser o quê? Não, bloquear tudo, não. O que a gente quer, se a instrução for inválida, é que ele passe a executar a rotina de tratamento de exceção, tá? A gente não quer que pare a máquina, não. A gente quer que ele vá para esse endereço aqui. É isso que a gente quer: detectar a instrução inválida. Logo, `ALUSrc`? A ULA vai ser usada para alguma coisa? Eu só quero botar esse valor aqui e escrever nesses registradores. Não. Então, a ULA pode fazer qualquer coisa, não vai modificar em nada no resultado. Nem `RegWrite`. Eu vou querer escrever no banco de registradores? Não. Eu vou escrever no banco de registradores? Não. Eu quero ler da memória? Não. Eu quero escrever na memória? Não. É um `branch`? Não. O `ALUOp`? Tanto faz, certo? Então, notem que a única coisa que eu coloquei como 'tanto faz' são essa seleção dos multiplexadores aqui. E esse controle aqui, tanto faz o que ela vai fazer aqui. Os controles de escrita no banco de registradores, tem que colocar zero. Não quero que escreva. Porque não adianta eu colocar 'tanto faz' e de repente é um aqui. Ele vai escrever o lixo do banco de registradores. Tem que ser zero. `MemRead` e `MemWrite` também: zero e zero. Controla a leitura e escrita na memória. Não quero ler e nem quero gravar, certo? Se é um `branch`, esse aqui até poderia ser 'tanto faz'. Por quê? Tanto faz qual vai ser o endereço, qual vai ser o endereço que vai sair daqui. Porque eu vou querer escolher é esse endereço aqui, e não o endereço original. Então, aqui esse `branch` também poderia ser 'tanto faz', ok? Por quê? Esse `branch` vai acionar essa porta AND e vai selecionar ou esse endereço ou esse endereço. Por que 'tanto faz'? Porque, na realidade, esse endereço não vai ser utilizado, ok? Então, vamos lá. Agora os outros: 'escreve `MTVEC`'? Sim. Escreve `MTVEC`? Então, para onde que vai vir o endereço? Tem que vir do `MTVEC`. Então, aqui vai ser 1. Opa, peguei 1. Seleciona a causa. Qual é a causa de instrução inválida? 2, 4 ou 6? Seria o terceiro, né? É 2. Isso. Então, seleciona a causa: 0, 0. Porque eu quero escolher esse número 2 aqui para ser colocado para escrever a causa. Eu vou querer escrever a causa? Sim. Então, escreve causa igual a 1. Seleciona o valor. Qual é o valor que eu quero que eu escreva? Que eu escreva no registrador `mtval`? A instrução ou o endereço do `load` ou do `store`? A instrução. Então, seleciona o valor: 0. Ele vai escrever esse endereço no PC e não vai fazer mais nada. Esses aqui vão estar sendo escritos também lá na borda de subida do clock, certo? Então, na instrução seguinte, ele vai pegar o endereço que tiver armazenado no PC, que vai ser o endereço, esse aqui do `MTVEC`, para executar as instruções que tiverem lá. Entendido, pessoal? Ok?\n\nEntão, vamos lá. Outro: se for um `load` desalinhado. `Load` desalinhado. O que que eu preciso fazer? Então, vamos lá. Se for um `load`, quanto é que vale o `ALUSrc`? `ALUSrc = 1`. Tá aqui. Se for um `load`, eu preciso que a ULA calcule o endereço do `load`. Ai meu Deus do céu. Eu quero que isso aqui seja 1. Nem `RegWrite`. Eu quero escrever no banco de registradores? Eu quero escrever no banco de registradores? Nem `RegWrite`. Vou querer escrever no banco de registradores? Não, então é X. Se o `load`, o `load` for detectado como alinhado, eu quero escrever? Quer dizer, o que que eu vou escrever no banco de registradores? E aqui, se eu quero escrever no banco de registradores, eu quero escrever se o `load` tiver desalinhado? Não. Então, por isso que eu posso usar X no `MemtoReg`. Que saco. Então, esse aqui é... não... é melhor logo não mandar escrever. Quer escrever na memória? Bem, não é o caso. É melhor logo não mandar escrever. Quero ler da memória? Se o endereço estiver desalinhado? Não. Porque se tiver desalinhado e tentar ler da memória, provavelmente a memória vai te retornar um valor dizendo \"olha, eu quero escrever na memória...\". Seja o que tiver no banco de registradores. Também tem algum erro? Conseguiu alcançar? Vai receber... É melhor logo não mandar escrever na memória. Quando a memória também não importa... Para você conseguir no banco de registradores... `ALUOp` também. Qual é o `ALUOp` que eu quero? `ALUOp` não é X. Ah, não posso apagar. Qual é o `ALUOp` que eu quero? Eu quero que a ULA calcule a soma. Então, isso aqui é `00`. `00`. Imaginem qualquer coisa. `00`. Porque eu preciso que a ULA mantenha o cálculo aqui. Será que, mesmo que ele detecte que esse negócio é desalinhado, eu preciso que o endereço desalinhado permaneça aqui até o final da instrução? Porque eu vou querer que esse endereço desalinhado seja gravado aqui. Ele tem que permanecer até o final, certo? Não é óbvio. Então, vamos lá. Escreve 'escreve `MTVEC`'? Sim, porque gerou uma exceção. E a próxima instrução tem que ser buscada lá na rotina de tratamento de exceção. Seleciona a causa. Qual é a causa que eu vou colocar? 2, 4 ou 6? A causa agora é 4. Então, entrada do meu multiplexador 0, 1. Sabe que eu tenho partição, então fica difícil. 0, 1. Escreve causa. Eu quero escrever na causa? Quero. Seleciona valor. Qual é o valor que eu quero que eu escreva? Que eu escreva no registrador `mtval`? Agora eu quero que o endereço calculado que está desalinhado seja escrito no `mtval`. Então, seleciona `mtval`. Eu quero escrever no `mtval`? Sim, quero. E quero gravar o endereço do `load` que causou isso? Sim, quero. Entendido isso? E agora, se for um `store` desalinhado. Então, o `store` vai ser mais ou menos igual a essa linha aqui, tá? Para o `store`, eu preciso calcular o endereço. Então, eu preciso que o `ALUSrc` seja 1. Afinal.",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 8,
        "timestamp_start": 2937.65,
        "timestamp_end": 2947.66,
        "slide_description": "Como Engenheiro de Computação Sênior, analisei o slide de uma aula de Arquitetura de Computadores, focando na extração de conteúdo técnico para um sistema de busca semântica (RAG).\n\n**Conteúdo do Slide:**\n\nO slide apresenta o título principal \"RISC-V Uniciclo\", indicando um diagrama de caminho de dados (datapath) para uma implementação de processador RISC-V de ciclo único. O cabeçalho da apresentação detalha o contexto acadêmico: \"UnB - CIC0099 - Organização e Arquitetura de Computadores\", da \"Universidade de Brasília\", \"Departamento de Ciência da Computação\", com o nome do professor \"Prof. Marcus Vinicius Camar\".\n\n**Diagrama de Caminho de Dados (Datapath) RISC-V Uniciclo:**\n\nO diagrama ilustra os principais componentes e o fluxo de dados e controle de um processador RISC-V de ciclo único, estendido com elementos de tratamento de exceções.\n\n1.  **Estágio de Busca de Instrução (IF - Instruction Fetch):**\n    *   O `PC` (Program Counter) armazena o endereço da instrução atual.\n    *   Um somador (`Add`) calcula `PC + 4`, que é o endereço da próxima instrução sequencial.\n    *   O `Instruction memory` recebe o endereço do `PC` e produz a instrução de 32 bits (`Instruction [31-0]`).\n    *   Múltiplas anotações em vermelho indicam caminhos alternativos para o `PC`, como um `0x00000000` para reset ou vetor de interrupção, e uma anotação \"TRAP\" sugerindo a entrada em rotina de tratamento de exceção.\n\n2.  **Estágio de Decodificação e Busca de Registradores (ID - Instruction Decode/Register Fetch):**\n    *   A `Control` unit decodifica o `opcode` (bits `Instruction [6-0]`) para gerar todos os sinais de controle necessários para os demais estágios.\n    *   O banco de `Registers` (registrador de propósito geral) recebe os endereços dos registradores-fonte (`Read register 1` de `Instruction [19-15]` e `Read register 2` de `Instruction [24-20]`) e produz os dados correspondentes (`Read data 1` e `Read data 2`).\n    *   O `Imm Gen` (Immediate Generator) utiliza partes da instrução (`Instruction [30,14-12]`) para gerar o valor imediato de 32 bits, que é utilizado por instruções tipo I, S, B, U, J. Anotações \"RA\" e \"RB\" estão presentes, provavelmente referindo-se aos dados lidos dos registradores.\n\n3.  **Estágio de Execução (EX - Execute):**\n    *   A `ALU` (Arithmetic Logic Unit) executa operações aritméticas e lógicas.\n    *   O primeiro operando da ALU é `Read data 1`.\n    *   O segundo operando da ALU é selecionado por um multiplexador (`MUX`), que escolhe entre `Read data 2` ou a saída do `Imm Gen`, controlado pelo sinal `ALUSrc`.\n    *   A `ALU` produz o `ALU result` e um sinal `Zero` (para testes de condição em branches).\n    *   Para operações de branch, um `Shift left 1` é aplicado ao valor imediato (offset), que é então somado ao `PC` por outro `Add` unit para calcular o endereço do alvo do branch.\n\n4.  **Estágio de Acesso à Memória (MEM - Memory Access):**\n    *   A `Data memory` realiza operações de leitura ou escrita.\n    *   O `ALU result` é usado como `Address` para a memória de dados.\n    *   Para escritas, `Read data 2` dos registradores é o `Write data`.\n    *   A `Data memory` produz `Read data` em caso de leituras.\n    *   Os sinais `MemRead` e `MemWrite` da `Control` unit habilitam as operações de leitura e escrita, respectivamente.\n\n5.  **Estágio de Escrita de Volta (WB - Write Back):**\n    *   Um multiplexador (`MUX`) seleciona os dados a serem escritos de volta no banco de `Registers`. As opções são o `ALU result` ou o `Read data` da `Data memory`, controlado pelo sinal `MemtoReg`.\n    *   O endereço do registrador de destino (`Write register`) pode vir de `Instruction [11-7]` (para tipo R) ou `Instruction [24-20]` (para tipo J, U, I, S, B).\n    *   O sinal `RegWrite` da `Control` unit habilita a escrita no registrador.\n\n**Extensão de Tratamento de Exceções:**\n\nO diagrama inclui anotações em vermelho que indicam um sistema rudimentar de tratamento de exceções:\n*   Sinais como `SC` (System Call), `CAUSE` (código da causa da exceção), `EC` (Exception Code), `EPC` (Exception Program Counter, para salvar o PC da instrução que causou a exceção), `VAL` e `EV` (Exception Vector) são visíveis.\n*   Há multiplexadores para `SC` (selecionando entre entradas `0` e `1`) e `EPC` (selecionando entre `0` e `M_1`).\n*   Uma parte da lógica do lado direito mostra `EC` conectada a uma porta AND (`C1`) e um sinal `POST`, sugerindo a ativação do tratamento de exceção. Essas anotações indicam que o datapath básico foi estendido para lidar com interrupções ou exceções, desviando o fluxo de controle e salvando o estado do programa.\n\n**Tabela de Sinais de Controle:**\n\nUma tabela detalha os valores dos sinais de controle gerados pela `Control` unit para diferentes tipos de instruções:\n\n| Instrução  | ALUSrc | Mem2Reg | RegWrite | MemRead | MemWrite | (Coluna não rotulada, presumível `Branch` ou `PCSrc`) |\n| :--------- | :----- | :------ | :------- | :------ | :------- | :---------------------------------------------------- |\n| Tipo-R     | 0      | 0       | 1        | 0       | 0        | 10                                                    |\n| lw         | 1      | 1       | 1        | 1       | 0        | 00                                                    |\n| sw         | 1      | X       | 0        | 0       | 1        | 00                                                    |\n| beq        | 0      | X       | 0        | 0       | 0        | 01                                                    |\n| *JALR*     | X      | X       | 1        | 0       | 0        | 1001 / 011 (valores incompletos ou multiplos)         |\n| *Lwda*     | 1      | X       | 0        | 1       | 1        | 1011 / 111 (valores incompletos ou multiplos)         |\n| *Swda*     | X      | X       | 0        | 0       | 1        | XXXX (valores incompletos)                            |\n\nAs entradas `X` indicam \"don't care\" (não importa o valor). As últimas três linhas (`JALR`, `Lwda`, `Swda`) são anotações feitas à mão e podem representar extensões ou exemplos específicos discutidos na aula, sendo que `Lwda` e `Swda` parecem ser abreviações ou instruções hipotéticas. A entrada `RegWrite=0` para `Lwda` é notável e poderia indicar uma operação de load que não escreve em registradores de propósito geral, ou um erro de transcrição.\n\n**Anotações e Comentários Adicionais:**\n\nNa parte inferior do slide, há a frase \"Quica, taca.\", uma expressão informal do instrutor. No canto superior direito, há uma área com anotações adicionais do professor, incluindo números e uma representação da lógica para `EC` com uma porta AND, complementando a explicação do tratamento de exceções.\n\nEm resumo, o slide fornece uma visão detalhada do datapath de um processador RISC-V de ciclo único, com particular atenção aos sinais de controle e uma introdução aos mecanismos de exceção, complementado por uma tabela de sinais de controle para instruções-chave.",
        "transcription": "Que caca. Que caca.",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 9,
        "timestamp_start": 2947.66,
        "timestamp_end": 2952.02,
        "slide_description": "A imagem exibe uma tela de videoconferência de uma aula de Arquitetura de Computadores, apresentando um documento que detalha o plano de ensino da disciplina. O documento, identificado pelo nome de arquivo \"OAC_A_Plano_2021_2_v0.docx\", é da Universidade de Brasília, Departamento de Ciência da Computação, e ministrado pelo Prof. Marcus Vinicius Lamar, cuja imagem aparece no canto inferior direito da tela.\n\nO conteúdo central é uma tabela com o cronograma e tópicos abordados no curso, divididos por datas e atividades de teoria ou laboratório, com algumas anotações à mão.\n\n**Transcrição detalhada do conteúdo da tabela:**\n\n*   **Linha 7 (7/3, 9/3):**\n    *   Esquerda: Lab 1B: Software – Compilador C\n    *   Direita: Lab 1A: Software – Kais (16)\n*   **Linha 8 (14/3, 16/3):**\n    *   Esquerda: 1ª Prova (P1)\n    *   Direita: Lab 2: Hardware – Verilog – ULA (T7)\n*   **Linha 9 (21/3, 23/3):**\n    *   Esquerda: 13) Processador Uniciclo: Unidade de Controle (C.4) (L1)\n    *   Direita: 12) Processador Uniciclo: Unidade Operativa (C.4) (T8)\n*   **Linha 10 (28/3, 30/3):**\n    *   Esquerda: 14) Processador Multiciclo: Unidade Operativa (C.4)\n    *   Direita: Lab 3: Processador Uniciclo (T9) (L2)\n*   **Linha 11 (4/4, 6/4):**\n    *   Esquerda: Lab 4: Processador Multiciclo\n    *   Direita: 15) Processador Multiciclo: Unidade de Controle (C.4) (T10)\n*   **Linha 12 (11/4, 13/4):**\n    *   Esquerda: 17) Pipeline: Unidade Operativa e Controle (C.4)\n    *   Direita: 16) Processador Pipeline: Conceitos (C.4) (T11)\n*   **Linha 13 (18/4, 20/4):**\n    *   Esquerda: 18) Exceção e Interrupção (C.4)\n    *   Direita: Lab 5: Processador Pipeline (T12) (L3)\n*   **Linha 14 (25/4, 27/4):**\n    *   Esquerda: 19.1) Memória: Cache (C.5)\n    *   Direita: 19) Memória: Hierarquia (C.5) (T13) (L4)\n*   **Linha 15 (2/5, 4/5):**\n    *   Esquerda: Prova Substitutiva\n    *   Direita: 2ª Prova (P2) (T14) (L5)\n*   **Linha 16 (parcialmente visível, apenas coluna da direita):**\n    *   Direita: Apresentação dos Projetos (Pr) (T15)\n\n**Seção \"Avaliação\" (visível abaixo da tabela):**\n\n*   P1: 1ª Prova: 14/03/2022\n*   P2: 2ª Prova: 27/04/2022\n\n**Análise Visual de Diagramas e Anotações:**\n\nNão há diagramas explícitos de Datapath, Pipeline ou Hierarquia de Memória apresentados na forma visual de blocos ou fluxos de dados. O slide é predominantemente textual, listando esses conceitos como tópicos de estudo.\n\nEntretanto, há uma anotação gráfica manuscrita no documento, superposta ao conteúdo. Uma seta desenhada manualmente aponta do tópico \"15) Processador Multiciclo: Unidade de Controle (C.4) (T10)\" (coluna direita, linha 11) para \"Lab 4: Processador Multiciclo\" (coluna esquerda, linha 11). Adicionalmente, um símbolo estilizado que se assemelha a um \"T\" ou um visto de confirmação está desenhado ao lado de \"Lab 4: Processador Multiciclo\". Essas anotações indicam uma relação direta e possivelmente uma ênfase na implementação prática ou laboratorial do conceito de Processador Multiciclo, conectando a teoria da unidade de controle com a atividade de laboratório designada.\n\nO conteúdo aborda temas fundamentais de Arquitetura de Computadores, como a implementação de processadores Uniciclo e Multiciclo, conceitos de Pipeline, tratamento de Exceções e Interrupções, e a Hierarquia de Memória, incluindo Cache. Os laboratórios indicam práticas com compiladores C, descrição de hardware usando Verilog para Unidade Lógica Aritmética (ULA) e construção de processadores Uniciclo, Multiciclo e Pipeline.",
        "transcription": "Meu Deus do céu! O que aconteceu aqui?",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 10,
        "timestamp_start": 2954.88,
        "timestamp_end": 2987.76,
        "slide_description": "Como Engenheiro de Computação Sênior, analisei o slide e o contexto da aula de Arquitetura de Computadores conforme a imagem fornecida.\n\nO conteúdo visual principal, que deveria ser a apresentação ou slide da aula, está completamente vazio, exibindo apenas um plano de fundo sólido e escuro. Não há diagramas, texto, código (Assembly, C, Verilog), imagens ou qualquer outro material didático técnico visível na área destinada ao conteúdo da apresentação.\n\nNo entanto, há informações contextuais importantes visíveis na interface do sistema de conferência:\n\n1.  **Título da Aula:** Na barra superior do sistema de conferência, está claramente exibido o título \"Sala de Aula de OAC\". \"OAC\" é uma sigla comum para \"Organização e Arquitetura de Computadores\", indicando o domínio da aula.\n2.  **Duração da Sessão:** Um contador de tempo \"49:20\" está visível na barra superior, possivelmente indicando o tempo decorrido ou restante da sessão.\n3.  **Participantes:** No painel lateral esquerdo, sob a seção \"USUÁRIOS (8)\", são listados os participantes:\n    *   Marcus Vinicius Lam... (identificado como \"Você\", sugerindo que esta é a visualização do próprio apresentador ou anfitrião da sala, e também aparece na barra superior como o foco da câmera/microfone).\n    *   Luiz Carlos Da Sil...\n    *   Eduardo Ferreira ...\n    *   João Alberto Trav...\n    *   Marcello Brandao ...\n    *   Maycon Vinnycus...\n    *   Michel Luis Duwe\n    *   Victor Hugo Rodri...\n4.  **Chat (Bate-papo público):** O painel lateral esquerdo também contém um histórico de mensagens de chat não técnicas, caracterizando uma interação informal entre os participantes. As mensagens transcritas são:\n    *   \"certo\"\n    *   \"4\" (por Marcello Brandao Sca... e Eduardo Ferreira Mar...)\n    *   \"serio/\" (por Eduardo Ferreira Mar...)\n    *   \"1\" (por Marcello Brandao Sca... e Eduardo Ferreira Mar...)\n    *   \"o da ula\" (provavelmente \"o da aula\", por Marcello Brandao Sca...)\n    *   \"sí\" (provavelmente \"sim\", por Eduardo Ferreira Mar...)\n    *   \"quica taca\" (por Marcello Brandao Sca...)\n    *   \"kkk\" (por Eduardo Ferreira Mar...)\n    *   \"é um funk\" (por Marcello Brandao Sca...)\n    Há também um campo para \"Enviar mensagem para Bat...\".\n5.  **Outras Seções da Interface:** As seções \"MENSAGENS\" com \"Perguntas\" e \"Bate-papo público\", e \"NOTAS\" com \"Notas compartilh...\", indicam funcionalidades da plataforma de conferência, mas não contêm conteúdo técnico visível.\n\nEm resumo, a análise revela que a aula de \"Organização e Arquitetura de Computadores\" está em andamento, com a presença de um apresentador (Marcus Vinicius) e outros 7 participantes. No entanto, a tela de apresentação está vazia, sem qualquer conteúdo de slide. A informação extraída é primariamente contextual, baseada nos elementos da interface da plataforma de conferência.",
        "transcription": "Ai, meu Deus, vamos lá. Voltemos. Esse é o problema de botar as coisas muito embaixo no slide. Então, eu quero que o ALUsrc seja 1 para a ULA. Eu vou querer escrever no banco de registradores? Não. Então, pode ser qualquer. Eu quero escrever no banco de registradores? Não. Eu quero ler da memória? Não. Eu quero escrever na memória? Eu quero escrever na memória do endereço errado?",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 11,
        "timestamp_start": 2992.87,
        "timestamp_end": 6273.6,
        "slide_description": "Como um Engenheiro de Computação Sênior, apresento a análise e descrição do slide fornecido para um sistema de busca semântica (RAG), focando nos detalhes técnicos da arquitetura de computadores.\n\n---\n\n**Título Principal do Slide:**\n\"RISC-V Pipeline\"\n\n**Informações do Curso/Instituição:**\n\"UnB - CIC0099 - Organização e Arquitetura de Computadores\"\n\"Universidade de Brasília\"\n\"Departamento de Ciência da Computação\"\n\"CIC0099 - Organização e Arquitetura de Computadores\"\n\"Prof. Marcus Vinicius Lamar\"\n\n**Diagrama Principal: Pipeline de Processamento RISC-V**\nO slide exibe um diagrama detalhado de um *datapath* de pipeline para um processador RISC-V, com foco na detecção e tratamento de *hazards* (interdependências/perigos). O pipeline é um design clássico de 5 estágios (Instruction Fetch - IF, Instruction Decode - ID, Execute - EX, Memory Access - MEM, Write Back - WB), interligados por registradores de pipeline.\n\n**Estrutura e Fluxo de Dados por Estágio:**\n\n1.  **Estágio IF (Instruction Fetch - Busca de Instrução):**\n    *   Contém o **PC (Program Counter)**, um registrador que armazena o endereço da instrução atual.\n    *   Um somador calcula `PC + 4` (para a próxima instrução sequencial).\n    *   Um multiplexador (Mux) seleciona o próximo endereço do PC entre `PC + 4`, o endereço de um *trap vector* (`UTVEC`) ou um endereço calculado para *branch* ou *jump*.\n    *   A **Instruction Memory (Memória de Instruções)**, que recebe o endereço do PC e fornece a instrução para o próximo estágio.\n    *   Há um Mux adicional antes do PC, que permite a seleção do `PC+4` ou do `UTVEC` ou do endereço de *branch/jump*.\n    *   O registrador de pipeline **IF/ID** armazena o `PC+4` e a instrução buscada.\n\n2.  **Estágio ID (Instruction Decode - Decodificação de Instrução):**\n    *   O registrador de pipeline **IF/ID** passa a instrução e `PC+4`.\n    *   A **Control Unit (Unidade de Controle)** recebe o *opcode* da instrução e gera sinais de controle para todos os estágios do pipeline.\n    *   O **Registers (Arquivo de Registradores)**, que recebe os endereços dos registradores de origem (Rs1, Rs2) da instrução e fornece seus valores. Também recebe o endereço do registrador de destino (Rd), o dado de escrita e um sinal de *write enable* do estágio WB.\n    *   O **Imm Gen (Gerador de Imediato)**, que estende e gera os valores imediatos da instrução.\n    *   Um módulo **Shift left 1** é visível, frequentemente usado para calcular offsets de *branch* (multiplicando por 2, pois endereços de instrução RISC-V são alinhados a 4 bytes, e o offset é dado em meias-palavras).\n    *   A **Hazard Detection Unit (Unidade de Detecção de Hazards)** recebe informações de registradores de pipeline (e.g., campos de registradores de leitura e escrita de instruções em voo) e gera sinais de controle para estagnar (stall) ou flushar o pipeline quando *data hazards* ou *control hazards* são detectados.\n    *   Um Mux no caminho do `PC+4` seleciona entre `PC+4` e o valor `4` (provavelmente para estagnar o PC em caso de *hazard*), controlado pela unidade de detecção de *hazards*.\n    *   O registrador de pipeline **ID/EX** armazena os valores lidos dos registradores, o valor imediato, o `PC+4`, e os sinais de controle gerados.\n\n3.  **Estágio EX (Execute - Execução):**\n    *   O registrador de pipeline **ID/EX** passa os dados necessários.\n    *   A **ALU (Arithmetic Logic Unit - Unidade Lógica Aritmética)** realiza operações aritméticas e lógicas nos operandos. Seus operandos são selecionados por multiplexadores, que podem receber dados do estágio ID ou valores *forwarded* de estágios posteriores (EX, MEM, WB) para resolver *data hazards*.\n    *   A **ALU Ctrl (Controle da ALU)** gera o sinal de função para a ALU com base nos bits de função da instrução e nos sinais da Unidade de Controle.\n    *   A **Forwarding Unit (Unidade de Encaminhamento)** detecta *data hazards* entre as instruções em EX, MEM e WB e os operandos da instrução atual no estágio EX, gerando sinais para os Muxes de entrada da ALU para \"encaminhar\" (forward) os dados corretos dos estágios posteriores.\n    *   Muxes adicionais selecionam o segundo operando da ALU (registrador Rs2 ou imediato).\n    *   Um Mux para o `EX.Flush` está presente antes do registrador de pipeline `EX/MEM`, indicando a capacidade de invalidar instruções neste estágio.\n    *   Um Mux para endereços de *branch/jump* é visível, utilizando o `PC+4` e o valor calculado pelo somador da ALU (que pode ser um endereço de *branch*).\n    *   O registrador de pipeline **EX/MEM** armazena o resultado da ALU, o valor do segundo operando do registrador (para *store*), o endereço de destino do registrador, e os sinais de controle relevantes para os estágios MEM e WB.\n\n4.  **Estágio MEM (Memory Access - Acesso à Memória):**\n    *   O registrador de pipeline **EX/MEM** passa os dados.\n    *   A **Data Memory (Memória de Dados)**, que realiza operações de leitura ou escrita. O endereço vem da ALU, o dado a ser escrito vem do registrador Rs2 (via EX/MEM), e o dado lido é fornecido para o próximo estágio.\n    *   O registrador de pipeline **MEM/WB** armazena o dado lido da memória, o resultado da ALU (para instruções que não acessam a memória), o endereço de destino do registrador, e os sinais de controle relevantes para o estágio WB.\n\n5.  **Estágio WB (Write Back - Escrita de Volta):**\n    *   O registrador de pipeline **MEM/WB** passa os dados.\n    *   Um Mux final seleciona o dado a ser escrito de volta no arquivo de registradores: ou o dado lido da Data Memory, ou o resultado da ALU.\n    *   O dado selecionado e o endereço do registrador de destino são enviados de volta para o **Registers (Arquivo de Registradores)** no estágio ID, juntamente com o sinal de *write enable*.\n\n**Sinais de Controle e Tratamento de Hazards:**\n*   **Sinais de Flush:** `IF.Flush`, `ID.Flush` (acionado pela Hazard Detection Unit) e `EX.Flush` (vindo da Hazard Detection Unit via unidade de controle principal, ou de algum outro controle de exceção) indicam a capacidade de invalidar (zerar) instruções nos respectivos estágios do pipeline, tipicamente para resolver *control hazards* (branches/jumps mal-preditos) ou exceções.\n*   **Hazard Detection Unit:** Recebe entradas de vários registradores de pipeline (IF/ID, ID/EX, EX/MEM) para identificar dependências de dados e controla a estagnação (via Mux no PC) e/ou o *flush* (via `ID.Flush` para o registrador ID/EX) do pipeline.\n*   **Forwarding Unit:** Recebe informações dos registradores ID/EX, EX/MEM, MEM/WB (como o endereço do registrador de destino e o sinal de escrita) para detectar *data hazards* e direcionar os dados corretos (já calculados mas ainda não escritos no registrador) para os operandos da ALU.\n\n**Diagramas Auxiliares:**\nNo canto superior direito, há dois diagramas simplificados de multiplexadores:\n1.  **Mux de 3 entradas:** Apresenta 3 entradas (rotuladas 0, 1, 2) e uma única saída. Ao lado, há um texto manuscrito \"CAUX\" (provavelmente 'Controle Auxiliar' ou 'Auxiliar de Chaveamento').\n2.  **Mux de 2 entradas:** Apresenta 2 entradas (rotuladas 0, 1) e uma única saída.\nA presença desses diagramas sugere uma discussão sobre a lógica de multiplexação e possivelmente os sinais de controle associados. Há também dois retângulos vazios abaixo do texto manuscrito, que poderiam ser para anotações adicionais.\n\n---\nEste conteúdo é denso em termos de arquitetura de computadores e processadores RISC-V, abordando aspectos cruciais de design de pipeline, otimização de desempenho e tratamento de exceções/hazards.",
        "transcription": "Não, né? Então, aqui é zero também. Não quero nem ler, nem escrever na memória. É um *branch*? Tanto faz. O *AWOP*, sim, tem que manter. Eu preciso que a ULA continue calculando a soma para dar o endereço. Então, vamos lá. Escreve o *UTVEC*? Quer dizer, seleciona lá o multiplexador para selecionar o *UTVEC*? Sim. Seleciona a causa. Qual é a causa? Que é o *store* desalinhado? É o 6. Então, 1 e 0 no multiplexador. Escreve causa? Sim. Seleciona qual é o valor que eu quero que escreva no registrador de valor? O endereço desalinhado também. Então, é 1. Escreve *EPC*? Sim. E eu preciso também escrever o *EPC* que é o endereço do *store* desalinhado. Entendido, pessoal? Como é que a gente gerou todos esses sinais de controle? Quer dizer, ele vai executar tudo como se fosse um *load* ou se fosse um *store*, até que ele detecte isso aqui. Quando ele detecta isso aqui, ao invés de ele usar essa linha aqui da tabela verdade, ele passa a usar essa linha da tabela verdade. Certo? Até o final do ciclo. É, isso é desse, desse, desse. É, esse aqui, esse aqui, esse aqui são iguais. Então, seriam de 4 controles, 1, 2, 3, 4. Ok. E se, por acaso, não causar exceção? Então, estou usando um tipo R. Tipo R, ele deu o tipo R direitinho, executou o tipo R e não causou exceção nenhuma. Então, a escolha do *UTVEC* tem que ser quanto? 0 ou 1? Quer dizer, qual vai ser o próximo endereço se não aconteceu exceção nenhuma, no caso do tipo R? Quanto vai ser a escolha? Olha, eu passei o endereço, tem que vir de onde? Do *UTVEC* ou do caminho normal? Isso, do caminho normal. Então, 0. Eu vou querer escrever causa? Eu vou querer selecionar causa? Não, tanto faz, porque eu não vou querer escrever nela. Eu vou selecionar o valor? Não, tanto faz, porque eu não vou querer escrever esse valor. E vou querer escrever o *EPC*? Também não. 0x, 0x. Se for um *load*, quer dizer, todas as outras instruções, se não acontecer nenhuma exceção, vão ter que gerar esses sinais de saída aqui. Certo? O tratamento de exceções fica desligado. Quer dizer, eu nunca vou selecionar o endereço da exceção para ele passar a executar lá. Então, se está tudo certinho, fica no zero. Quando acontece a exceção, aí sim, eu tenho que gravar esse, opa! Gravar o endereço do *UTVEC* no PC ao final do ciclo. E quando tem exceção, é que eu preciso selecionar a causa, escrever a causa, selecionar o valor, escrever o valor e escrever o PC. Quer dizer, escrever o *EPC* esse aqui. Entendido, pessoal? Não é complicado. Dúvidas? Isso é difícil, mas vocês entenderam? Eu não iria pedir antes para vocês fazerem o negócio. Dúvidas? Antes eu vou mostrar como é que se faz. Mas agora, por exemplo, se eu quiser acrescentar uma nova exceção, vocês já sabem como é. Então, você nunca repete o endereço, né? Se não acha exceção, ele não vai repetir a leitura, ele vai para o próximo endereço para fazer a próxima instrução. Sim, porque todas as instruções acontecem em um período de *clock*. Certo? Você lê a instrução, começa a executar a instrução nesse período de *clock*. De repente, ele viu que é uma exceção. Daí o sinal de quando ele muda no meio do ciclo de *clock*. Certo? Durante o ciclo de *clock* ele muda de modo que no final do ciclo de *clock* aconteça o que eu quero que aconteça. Ele escrever aqui o endereço do PC, escrever nos registradores. Entendeu? Então, ele começa a executar a instrução como se fosse uma instrução normal. A instrução inválida. Ele detecta o endereço do PC, ele detecta logo de cara. Certo? Então, ele já logo nesse inícionho do ciclo ele já detecta uma instrução inválida e faz acertar o controle desse jeito que no final do *clock* é que ele vai atrasar tudo de acordo com isso aqui. Se for um *load*, ele começa a executar o *load* até que ele calcula o endereço e vê que o endereço é desalinhado. Então, ele passa desse controle que está aqui para esse controle que está aqui. Por isso que eu digo, é um *load* e o *load* está desalinhado, ou aqui é um *load* e o *load* não está desalinhado. É um *store*, ele não está desalinhado, ele faz isso. É um *store*, ele está desalinhado, ele faz isso. Então, ele começa a executar tipo isso aqui. Ok? Ok. Então, o *single-cycle* tranquilinho, né? Próximo, *multi-cycle*. Então, está aqui o caminho de dados do *multi-cycle* e vamos ver o que a gente precisa modificar. Então, basicamente as modificações vão ser as mesmas, até que eu já tinha começado a encher aqui, vão ser as mesmas do *single-cycle*. Então, nesse caso, vamos lá. Nesse caso, a causa. Então, vamos colocar aqui o sinalzinho, esse aqui que eu seleciono a causa. Esse aqui é o sinalzinho, seleciona o valor. O valor, ele pode vir de dois lugares. Uma, se a instrução for inválida, eu tenho que gravar aqui a instrução inválida. Onde que eu tenho a instrução inválida? Onde que eu vou conectar isso aqui? No PC? Não. É a instrução inválida. Qual é a instrução que eu invalido? A memória que foi inválida, que eu preciso armazenar nesse registrador? Isso, no *IR*. Aqui no registrador de instruções. Então, eu posso pegar daqui, aqui, que é toda a instrução e puxar pra cá. Eita! Olha o *fan-out* aí. Ok. Se for um, um *load* e ele descobriu que o *load* ou o *store* está desalinhado, eu preciso salvar aqui o endereço. Aonde que eu vou buscar esse endereço que está desalinhado? Aonde que eu vou buscar esse endereço que está desalinhado? Notem, aqui, o endereço que eu quero, que está desalinhado, é esse aqui. Certo? É esse endereço aqui que eu quero detectar se está desalinhado. Certo? Logo, se eu espero que no PC tenha o valor correto, logo, então, tem que desalinhado aqui. Então, onde que eu tenho o endereço desalinhado? Aqui. Não, não é na ULA. Pode ser na ULA, que você já vai detectar os dois. É, pode ser. Se eu pegar na ULA aqui, eu já detecto logo o *load* e o *store*. Isso. Pode ser, tá? Então, aqui na saída da ULA, o que eu vou fazer? Eu vou fazer aquele nosso OR, tá? Então, isso aqui é um OR com os dois *BIT* BIT0 e o BIT1 do endereço. Ok? Exatamente o que a gente fez antes. Um OR BIT0 e BIT1. E onde é que vai, então, esse nosso desalinhamento? O *DA* vai lá pro controle. Vai no controle, que vai ter que ser mais uma entrada aqui. Certo? Então, além do *opcode*, a gente tem que entrar se o endereço está desalinhado ou não. Ok? Aqui, aqui eu calculei o endereço. Então, aqui eu verifico se o endereço está desalinhado ou não. Tranquilo? E se o endereço estiver desalinhado, é esse endereço que eu coloco aqui. Esse endereço que na subida do *clock*, quando eu estou com o endereço aqui, que na subida do *clock* eu quero gravar ele aqui. Aqui, a mesma coisa do outro. Eu vou botar aqui o multiplexador, aqui 0, aqui 1 e o endereço vai vir pra cá e aqui eu tenho o escreve *UTVEC*, tá? O nosso *ET*. Entendido, pessoal? Ok. Então, isso aqui faz as modificações que eu precisei fazer no caminho de dados. Ainda, o *EPC*. O *EPC*. Qual é o endereço do PC que causou a instrução inválida? Onde que está o PC que causou, no caso, a instrução inválida ou o *load* inválido? Onde que eu tenho esse endereço aqui? Onde que está esse endereço PC? Tá, quando ou a instrução foi detectada como inválida, certo? Quem é que detecta a instrução inválida? É o controle, certo? Ou quando eu descubro que o endereço do *load* do *store* desalinhado, tá desalinhado. Onde que eu tenho isso, pessoal? Só vou achar em um desses dois lugares. Ou aqui, ou onde? No ponto A do lado de cá, ou no *operand* B do lado de cá? Antes do *PCWrite* ou depois do *PCWrite*? Lembrem-se o seguinte: o que que acontece no primeiro ciclo, na primeira etapa do *multi-cycle*? Eu leio da memória e disponibilizo aqui, e já deixo *PC+4* pronto. De modo que no final do ciclo, *PC+4* é escrito. Então, eu vou deixar o *PC+4* pronto e o endereço de *PCWrite* é escrito para a gente salvar o PC. Logo, onde que eu tenho *PC+4*? Quer dizer, onde eu tenho o valor de PC? Não *PC+4* no final do primeiro ciclo? Aqui eu tenho *PC+4* no final do primeiro ciclo. Eu só li a instrução da memória. Eu só vou saber se é inválida depois, no segundo ciclo. Então, o que eu tenho que pegar é o sinal de *PCWrite* aqui. Então, esse sinal de *PCWrite* é que eu tenho que colocar para cá, tanto para instrução inválida quanto para o *load/store*. Entenderam isso? Porque passou o primeiro ciclo, aqui eu já tenho *PC+4*. E no primeiro ciclo eu só li a instrução, eu nem gravei nos registradores ainda, quer dizer, nem gravei no registrador *IR* desculpa. Certo? Beleza. Então, agora sim, ligamos o que a gente tinha que ligar no circuito. O que que a gente tem que mudar agora? Além do *datapath*, eu preciso mudar o controle. Certo? Marca aqui o nosso controle que a gente vai modificar agora. Modificar de que forma? Ora, vamos relembrar como é que esse controle funcionava. Aqui eu li a instrução e aqui eu decodificava a instrução. Aqui é que eu sei qual é o *opcode* da instrução. Então, aqui é que eu vou poder dizer que o *opcode* é igual a inválido. Quer dizer, se não for isso, não for isso, o *opcode* é inválido. Eu tenho que vir para cá. Ok? Entendido, pessoal? Na segunda etapa, quando eu vou descobrir qual é, a partir do *opcode*, o que eu tenho que fazer? Qual vai ser o próximo, o próximo *cycle* é que eu vou verificar o *opcode*. Não é esse, nem esse, nem esse. Então, eu tenho que vir para cá. Ok? Entendido isso? Beleza. E se ele vier para cá, então, notem, esse aqui é o terceiro *cycle*. No terceiro *cycle*, que sinais eu vou ter que modificar aqui para ele fazer o que a gente quer que ele faça? O que a gente quer que ele faça, caso seja uma instrução inválida, eu preciso selecionar o *ET*, selecionar o *PCWrite* porque se for instrução inválida eu quero escrever no PC o valor do *UTVEC*. Certo? Então, vamos começar por aí. Então, eu vou colocar aqui *ET* igual a 1. Certo? Então, *ET* igual a 1 e acionar o *PCWrite*. Então, a primeira coisa, coloquei, selecionei esse, esse multiplexador para ser 1 e acionei o *PCWrite*. No próximo *cycle* de *clock* eu já vou direto buscar a instrução lá da rotina de tratamento de exceção. Beleza. Ok. O que mais que eu preciso fazer, então, no terceiro *cycle*? Eu preciso gravar esses valores aqui. Certo? Então, qual é, qual é? Selecione a causa. Preciso colocar selecione causa 0 e 0 e acionar o *CauseWrite*. Preciso colocar acionar o *PCWrite*, *ETWrite* e preciso selecionar o valor aqui. Eu quero que a instrução seja gravada no *IR*. Selecione *SV* igual a 0. Então, *SV* igual a 0 e selecione o *ValueWrite*. Então, aqui eu tô dizendo que a próxima instrução vai do endereço lá da rotina de tratamento de sinal, rotina de tratamento de exceção, e força escrita no PC. E depois faça *SC* igual a 0 e *CauseWrite*, *PCWrite*, aciona *CauseWrite*, aciona *PCWrite*, faço a seleção do valor igual a 0. É só 1, né? Só 0, meu Deus, só 0 e aciona o *ValueWrite*. Entendem, pessoal? Então, para instrução inválida, ele detectou que a instrução é inválida, ele vem pra, faz tudo isso que ao final do ciclo esse registrador vai ser escrito, esse registrador vai ser escrito, o *EPC* vai ser escrito, o *EPC* vai ser escrito e o *VAL* também vai ser escrito. Causa vai ser escrito, *EPC* vai ser escrito e o *VAL* vai ser escrito. E volta a formular pro primeiro, né, para colocar novamente a instrução um *load* e um depois que está no PC. Certo? Beleza. Então, o próximo, próximo. Eu li a instrução, decodifiquei a instrução e descobri que a instrução é um *load* ou é um *store*. Então, ele veio para cá. Então, agora aqui eu vou ter que, eita, tô faltando duas coisinhas aqui agora. Esse aqui é o caminho original, né? Então, agora aqui é que eu calculo o endereço, nessa etapa que eu calculo o endereço. Então, nessa etapa, ao final dessa etapa, eu já sei se eu tive o endereço desalinhado ou não. Certo? E esse endereço desalinhado, que é o nosso *DA*, né, desalinhado, ele tá entrando no controle. É esse aqui, ó, nosso *DA*. Ele tá entrando no controle. Então, aqui eu posso fazer então uma escolha: se o *load* for um *store* e talvez venha em cima, tá, porque senão fica meio ruim aqui, o *DA* estiver desalinhado. Esse aqui é um E, tá? Comercial. Pelo amor de Deus, que coisa feia. Esse aqui é um AND. Então, esse endereço, se o *load* for de um *store* e o *DA* estiver desalinhado, ele segue normalmente o *store*. Se for um *load* e o afinal e o *DA* tiver desalinhado, então, *DA* barra. Então, ele segue o *load* normal. Certo? Porque nessa está exatamente isso aí, só que barra em cima de tudo, tá? Então, ele segue o *store* normal e o *load* normal. Se for um *load* e o *DA* tiver acionado, eu vou para esse próximo estado. Se for um *store*, se o *store* for um *store*, se for um *store* e o *DA* tiver acionado, eu venho para cá. Ok? Então, notem que aqui, ao calcular o endereço, eu já sei para onde que eu vou ter que ir. Ok? Calculei o endereço e já vou ter o valor de, aí eu já sei se eu tenho que vir para cá, para cá, ou para cá. Então, beleza. Vamos supor que seja um *load* e o endereço esteja desalinhado. O que que eu vou ter que fazer, então? Notem que a gente vai fazer isso aqui, ó. A gente vai ter que fazer outra coisa também, tá? Ah, não precisa. Lembrem-se que todos os sinais que não estão aqui são setados como zero. Ah, quanto é que vale o *CauseWrite*, *ValueWrite*, *ETWrite*? Aqui, todos eles são zero porque não estão descritos na bolinha. Certo? Então, isso facilita muito esse nosso projeto aqui. Sempre que eu não escrever essas carinhas aqui, eles não são acionados. Certo? Assim como o *ET*, o *ET* também só é acionado aqui. Todos os outros o *ET* vale zero. Quer dizer, eu não coloco o endereço do *UTVEC* para ser escrito no próximo PC. Ok? Então, o que que vai ter aqui dentro? Vai ter isso aqui. O que que vai mudar? A causa não vai ser zero zero, vai ser zero um. E o que salva aqui não é zero, é um. Tá? Então, vai ter todos esses sinais aqui, aqui dentro. A única coisa que vai ter de diferente, deixa eu ver, a única coisa diferente é que seleciona causa vai ser zero um e seleciona valor vai ser um. Todos esses outros sinais têm que ser igual. Então, aciona o *ET*, aciona *CauseWrite*, *PCWrite*, *ETWrite*. Certo? Tudo isso aqui. Só muda os sinais de escolha. Seleciona a causa tem que ser um e o que vai ser escrito aqui tem que ser um. Ok. Putz, não, aqui é, aqui é o *load*, aqui é o *store*. Então, tá. Então, aqui no *store* o que que vai ter? A mesma coisa, tá? Só que a causa vai ser dois. O resto é tudo igual. Vamos lá. Cadê, cadê, cadê, cadê, cadê, cadê, cadê? Vou ter, vou ter, vou ter seleciona causa igual um e zero. Vou ter seleciona valor igual a um. Vou ter *CauseWrite*, *PCWrite* e *ETWrite*. Certo? Entendido? Modificamos o nosso controle. Tivemos que colocar três estados a mais por causa das três novas condições que o processador tem que funcionar. Ok? Dúvidas? Não? Não. Podemos continuar, né? Tranquilo, pessoal. Que bolhas aqui no *single-cycle* não tem bolhas, né? Já queres bolha? Então, a gente vai pro agora sim vão aparecer as bolhas, tchan, tchan, tchan, tchan. Oh no. Para quando eu precisar da mesma instrução. *Worxem*, tá? Então, agora o que eu preciso acrescentar de *hardware*? Notem que aqui na figurinha do Patterson, ele já colocou o *UTVEC*, ó. O *UTVEC* já tá ali no nosso registradorzinho. Então, nem preciso ganhar isso. Só vou ter que alterar aqui esse controle aqui, agora ao invés de ser 1 bit, vão ser 2 bits, ok? Entendido isso, pessoal? Então, isso aqui poderia ser, por exemplo, a entrada 0 e 1, a entrada, essa aqui de baixo, 1 e 0, que quando deveria ser 0 e quando deveria ser 1, e essa aqui do meio, 0 e 0, 0 e 1, e essa do meio aqui, 1 e 0, tá? De modo que o primeiro bit funciona como a seleção original desse multiplexador, né? 0 é o *PC+4*, que vira 0. 0 é o *PC+4*, que vira 0. 0 é o *PC+4*, que vira 0 que vem pra cá. 1 é o endereço do *BEC* e do *JAL*. E agora eu tenho, né, esse 1, 0, né, que seleciona o *UTVEC*. Beleza. Então, sabe pra que que eu escrever aqui? Se eu preciso escrever aqui, tá? Então, o *UTVEC* já tá aqui, tá aqui nos 3 registradores, né, que eu não dei aqui. Esse aqui é o *CAUSE*, que tem o *CauseWrite*. Esse aqui é o *EPC*, aqui tem o *EPCWrite*. Aqui tem o *ValueWrite*. Aqui está ligado aqui, aqui está ligado aqui. Então, vamos lá. Seguinte, primeiro, se for uma instrução inválida, quer dizer, causa igual a 2, 4 ou 6. Da onde que vem esses dois valores? Esse aqui é a instrução inválida e esse aqui é o endereço inválido. Então, quando eu tenho uma instrução inválida, onde, em que estágio do *pipeline*, eu detecto que a instrução é inválida? E aqui tem que vir a instrução. Não, é um estágio e não um registrador, Marcelo. Tu colocou aí o nome desse registrador aqui. Eu quero saber em qual estágio, no estágio IF, no estágio ID, no estágio EX, no estágio MEM ou no estágio *WRITEBACK*? Nesse, porque aqui é que está sendo feita a decodificação, o controle está aqui. Então, se o controle está aqui, nesse estágio é que ele pode detectar se aconteceu a instrução inválida. Por exemplo, acionar aquele sinalzinho, já é com a instrução inválida. Então, é nesse estágio aqui. Eu vou clicar aqui no *output* e detectar, opa, aconteceu uma instrução inválida. Então, se aconteceu uma instrução inválida, onde que está a instrução em si? Onde está a instrução? Aqui, olha. Eu li a instrução da memória e gravei ele aqui nesse registrador. Então, aqui eu tenho a instrução nesse ponto. Então, eu vou pegar desse ponto e levar para lá. Beleza? Notem, o que o controle tem que fazer? Eu não fiz nada, meu tio. Eu, hein? O que o controle tem que fazer? Uma vez que ele detectou que a instrução é inválida? O que o controle precisa fazer no instante que ele detectou que a instrução é inválida? Botar o endereço no *UTVEC*. Quer dizer, para eu botar o endereço no *UTVEC*, isso só vai acontecer no próximo ciclo de *clock*. Logo, a instrução que já está aqui, eu preciso matar essa instrução aqui. É como se fosse um *JAL*, certo? Um *JAL*, eu preciso acionar esse *flush*. Aqui, olha. Meu Deus do céu. Meu Deus do céu. Eu preciso acionar esse sinal de *flush* aqui, que é o controle que gera. Certo? Certo? Então, acionando esse... Esse sinal de *flush*, ele vai escrever, então, no *IF/ID*, uma bolha. A de X0, X0, 0. Certo? É isso que o *flush* faz. Beleza? E vai ter que acionar esse multiplexador para ser. Esse aqui é 0, 0, 0, 1. E esse aqui é 1, 0. Então, ele tem que acionar esse sinalzinho aqui. Para ser 1, 0. Agora, como é que era o controle do *pipeline* mesmo? O controle do *pipeline* era o mesmo controle do *single-cycle*. Certo? Então, a gente só tem que pegar aquela tabela do *single-cycle*, a mesma tabela do *single-cycle*, e colocar os sinais em seus respectivos status. É isso que a gente tem que fazer. Aí, no *single-cycle* lá, quando a gente fez, a gente acrescentou um outro multiplexador aqui. A gente tinha que acrescentar... É, esse aqui, sim. Tinha acrescentado esse multiplexador. Certo? Então, ao invés de a gente estar usando agora esse multiplexador, a gente está selecionando... Esse multiplexador aqui tem que vir do *EPC*. Então, a gente tem que acionar o *flush*. Tem que colocar nessa seção desse multiplexador aqui, 1, 0. Certo? De modo que... No próximo ciclo de *clock*, a instrução que ele vai ler vai ser lá do *TREC*, e a bolha que eu tinha colocado aqui vai para a frente. Ok? Então, detecto a instrução inválida aqui no estágio ID. Então, aqui no estágio ID, é que eu tenho que mandar e selecionar o *SV* igual a 0. O *SC* igual a 0 também, 0, 0, 0, 0. Acionar o *CauseWrite*. Ah, a gente esqueceu de ligar aqui o *EPC*. De onde que vem esse *EPC*? De onde que vem esse *EPC*? Eu preciso pegar o endereço onde estava essa instrução. Onde é que está o endereço onde estava essa instrução? É o PC. Aqui, olha. Aqui eu pego o PC e passo para o estágio seguinte. Então, aqui eu vou ter esse endereço do PC, certo? Depois do *IF/ID*. É nesse ponto aqui, nesse fio aqui. Aqui eu tenho o endereço PC da instrução que causou a instrução inválida. Até aí tudo bem? Ok. E esse aqui tem que ser qual? Tem que ser o endereço. Tem que ser o endereço. Tem que ser o endereço. Tem que ser o endereço. Tem que ser o endereço. Tem que ser o endereço inválido de um *load* ou *store*, um endereço desalinhado, certo? Onde que está o endereço desalinhado? Quando que eu tenho o endereço disponível para endereçar a memória? Aqui, certo? Então, aqui é o *EX/MEM*. Aqui eu tenho o endereço que vai ser endereçado à memória. Então, eu posso pegar esse endereço daqui. Ou eu posso pegar... Eu posso pegar esse endereço daqui. Que a princípio, se eu pegar o endereço daqui, eu vou ter que matar uma, duas, três instruções. Se eu pegar o endereço daqui, eu tenho que matar só duas instruções. Por quê? Quando eu der o endereço inválido, eu tenho que mandar ler a instrução desse endereço. Então, essas duas instruções que foram lidas, eu vou ter que matar. Se eu pegar o endereço daqui, eu vou ter que matar essa aqui também. Certo? Então, vamos tentar. Vamos tentar pegar o endereço daqui. Certo? Isso aqui é o endereço para *loads* e *stores*. Então, desalinhado. Como é que eu sei que o endereço é desalinhado? Como é que eu sei que o endereço aqui está desalinhado? Dizendo a mesma coisa. Um OR desses primeiros dois bits aqui. Também vou escrever. Beleza? Um OR desses primeiros dois bits desse endereço, eu descubro que está desalinhado. Nosso *DA*. Por isso que eu não escrevi aqui. Que é endereço desalinhado. Então, aqui é esse aqui. E aqui está o *DA*. Muito bem. Eu descobri nesse estágio que o endereço está desalinhado. O que eu preciso fazer? Melhor. Eu descobri que aqui o endereço está desalinhado. Eu vou precisar salvar esse endereço no *EPC*. Onde que eu tenho o endereço dessa instrução aqui? Que está nesse estágio. Onde que eu tenho, nesse estágio, o endereço *load* ou do *store* que causou esse desalinhamento? Eu tenho o endereço PC nesse estágio. E o *DST* é o registrador. Eu tenho o PC nesse estágio? Não. O PC eu tenho nesse estágio. Passo para frente. Eu tenho o PC nesse estágio. Por isso que eu não completei aqui. Porque se eu ligar isso aqui direto aqui. Quando for o endereço desalinhado. Desalinhado. Ele vai estar pegando o endereço errado. Ele está pegando o endereço anterior. Da instrução que veio seguinte. Ao *load* ou *store* desalinhado. Então como que eu faço para ter o endereço PC aqui? Difícil, pessoal. Não é só eu pegar o valor de PC. Esse aqui. Esse aqui é o valor de PC. E jogar ele para o registrador aqui. De modo que nesse estágio. Aqui eu tenho o valor do PC. Da instrução que está aqui. Que deve ser um *load* ou um *store*. E que vai detectar se o endereço está desalinhado. Não tem. Tem que colocar esse filtro. Então o PC está passando para frente aqui. Só calcular o endereço do *branch* do *JAL*. Mas agora eu quero pegar esse PC também. Jogar para frente. Para quando o *load* ou *store* estiver nesse estágio. Quer dizer, nessa etapa. Eu posso usar esse endereço aqui em cima. Então notem. Da onde que vem o PC aqui? Esse PC que vai vir aqui. Vem daqui. Quando eu tenho uma instrução inválida. Ou vem daqui. Eu tenho um *load* ou um *store* inválido. Exato. Vem ou. Aí no caso Marcelo. Eu tenho um *load* ou um *store* inválido. Exato. Vem ou. Aí no caso Marcelo. É registrador. Ou vem do registrador *IF/ID*. Aqui. Ou vem daqui. Do registrador *ID/EX*. Logo. Isso aqui pode vir de duas. Duas. Duas partes diferentes do circuito. O que eu vou fazer aqui então. Já que ele pode vir daqui. Ou pode vir dali. Se alguém disser. Coloca um ou aí. Ele iria matar. Isso mesmo. Com um *Mux* aqui. Então selecionando 0. Ou selecionando 1. Se eu selecionar 0. Eu vou pegar. Esse endereço aqui. Se eu selecionar 1. Vou pegar esse endereço aqui. Ok. E vamos fazer uma coisa aqui. Que não é muito boa. Tá. Em termos de projeto. Qual é o sinal que controla. Esse multiplexador. Que saco. Pena que eu não posso apagar. Qual é o sinal que controla. Esse multiplexador aqui. Tem algum sinal desses. Que a gente já. Tenha gerado. Que controla esse multiplexador. É assim. Exato. Então no *SV*. Se for 0. Eu vou gravar a instrução. E vou selecionar o PC. Daqui. Se o *SV* for 1. Eu vou gravar. O endereço desalinhado. E vou pegar o PC. Daqui. Então esse aqui. É o mesmo sinal *SC*. Isso não é muito. Não é uma boa prática. O bom é. Tu criar um novo sinal. Para esse ali. Tá. Por exemplo. Seleciona. *EPC*. Aqui no final. Vai dar. Seleciona. *EPC*. Igual. *SV*. Tá. Entendido. Por que. Que eu preciso fazer isso. Ali. Não é controle. Menor. Menor. Menor que isso. Pode ser. Tá. Mas fica mais. Difícil. De dar manutenção. A um circuito. Desse tipo. Que se mexer. Num sinal. Aqui. Que tá mexendo. Também. Nesse sinal. Isso aqui. É o que eu chamo. De efeito colateral. Tá. Mexo. Nesse sinal. Então. Quero selecionar. O valor. Aí. Ao mesmo tempo. Eu tô. Selecionando. O valor. De. Do. PC. Aqui. Se. For. Outra. Pessoa. Ele. Vai. Pensar. Pra. Que. Que. Tem. Esse. V. Aqui. Né. Bom. Ok. Vamos lá. Então. Revisando. Se. For. Instrução. Inválida. O que. Que. Vai. Acontecer. Então. Tem. Que. Acionar. Escrever. O. PC. Tá. Pra. Ir. Aqui. No. Próximo. Ciclo. De. Clock. A. A. Memória. Vai. Ler. Esse. Endereço. Que. É. Lá. Da. Rotina. De. Tratamento. Tem. Que. Dar. Um. *Flush*. Então. Eu. Detectei. Instrução. Inválida. Aqui. Eu. Tive. Que. Acionar. Essa. Bolha. Transformar. Isso. Aqui. Numa. Bolha. E. O. Que. Eu. Vou. Fazer. Com. Então. Eu. Tenho. Que. Dar. Um. *ID.Flush*. Esse. Sinalzinho. Aqui. Então. *Flush*. No. *ID*. Quer. Dizer. Colocar. Todos. Os. Controles. Desse. Que. Eu. Ia. Fazer. Como. Zero. Se. Eu. Então. Quando. Eu. Detecto. Isso. Eu. Já. Tenho. Que. Acionar. O. *ID.Flush*. Acionar. O. *IF.Flush*. Para. Que. Essa. Instrução. Se. Transforme. Numa. Bolha. E. Eu. Mate. A. Ok. Ok. Isso. Para. Instrução. Inválida. Então. Acrescento. Duas. Bolhas. Tem. Que. Fazer. Isso. Não. Tem. Bom. E. Se. Por. Acaso. O. Endereço. For. Desalinhado. Então. Eu. Li. O. Certo. Certo. Então. Quando. Tiver. Nessa. Etapa. Aqui. Está. Calculando. O. Endereço. E. Descobrir. Que. O. Endereço. Está. Desalinhado. O. Que. Que. O. Controle. Vai. Ter. Que. Fazer. No. Ciclo. Então. Preciso. Dar. O. *Flush*. No. *IF/ID*. Preciso. Dar. Um. *Flush*. No. *ID/EX*. Matar. A. Instrução. Que. Está. Aqui. Também. E. Essa. Instrução. *Load*. Desalinhada. Também. Tem. Que. Quer. Dizer. Escrevendo. O. Registrador. Um. Note. Eu. Dou. Um. *Flush*. No. *ID*. Colocando. Os. Controles. Do. *ID*. Aqui. Como. Zero. Como. É. Que. Eu. Dou. Um. *Flush*. No. Para. Memória. E. Zero. Para. Todos. Os. Controles. *Write Back*. Então. Aqui. Eu. Não. Vou. Permitir. Escrever. Na. Memória. Nem. Ler. Na. Memória. E. Eu. Não. Vou. Permitir. Escrever. Neste. Estágio. Aqui. Entendido. Isso. Pessoal. Está. Aí. As. Nossas. Implementações. Não. Tem. Nenhum. Só. Não. Escrevi. A. Tabelinha. Verdade. Aqui. Porque. Eu. Nunca. Tive. Oportunidade. De. Entrar. A fundo. Na. 15. Como. 19. É. Complicado. Certo. Então. Essa. Que. É. Efetivamente. A. Aplicação. Que. Eu. Tenho. Que. Fazer. Agora. A. Tabelinha. Na. Tabelinha. De. Controle. Com. Todos. Esses. Sinais. Olha. Tá. Eu. Eu. Eu. Não. Estou. E. Mais. Eu. Escrevi. E. Se. Ele. Tem. Se. Forçado. A. Ser. Que. Vai. Escrever. Esse. É. Só. Selecionar. Aqui. Eu. Não. Três sinais ali e mais o *EPC*. Esse aqui. É uma boa pra vocês fazerem a tabela. Tá? Tabela. Que é a mesma tabela do, a mesma tabela do *single-cycle* com essas três outras situações aqui. Certo? Além desses sinais aqui de controle, tu tem que colocar o *IF.Flush*, o *ID.Flush* e o *EX.Flush*. Aí três sinais a mais aqui. Tá? Sinais que o controle tem que gerar. Além de todos esses aqui. Certo? Quanto que tem que dar o *ID.Flush*, o *IF.Flush*? Nesse caso tu dá o *ID.Flush* e tu não dá quando a instrução é inválida. Quanto que vai dar o *ID.Flush*, o *IF.Flush* e o *EX.Flush*? Né? Assim que tá, pode fazer isso aqui. Então, vamos chamar isso aqui de *FLUSH*, o estágio *ID.FLUSH*, o *EX.FLUSH*, tá? Jesus, olha só o cara que me escreve reto. Tá? Esse aqui vai estar sempre tudo zero. Porque se a instrução está rodando normalmente, não tem que dar *FLUSH* em nada aqui. Certo? Esse aqui tem que ser o *IF.FLUSH*. Esse aqui tem que ser o *IF.FLUSH* se acionado e *ID.FLUSH* se acionado. E esse aqui o *IF.FLUSH* e *ID.FLUSH*. E o *EX.FLUSH*. Opa, eu tô escrevendo e a gente não deve. E o *EX.FLUSH* é aqui. Um e esse aqui é o *ID.FLUSH*. Beleza. Então, aqui também é um. Tá? Então, por instrução inválida, eu tenho que dar um *FLUSH* no *IF* e um *FLUSH* no *ID*. E não preciso dar *FLUSH* no *EX*. Mas, quando eu tenho *LOAD* e *STORES* desalinhados, já que eu dei a entrada do controle agora, eu tenho que dar *FLUSH* nos três aqui. Certo? Pronto, tá aí a tabela. Tranquilo, né? A tabela do. Então, pode ser, parecer complicado, mas é tranquilíssimo. Gostei, Eduardo. Tranquilissíssimo. Ok? Dúvidas? Agora tem que fazer uma prova sobre isso. Sim. Pessoal, sei que vocês estão muito atarefados, né? Mas, quem tiver um tempinho e quiser assistir a apresentação do *PAETIN*, por acaso, respondo a presença de vocês do *PAETIN* hoje também. E hoje é dia, mas não é testinho. Então, respondam a presença lá no Aprender também. Ok? Tem que ser, né? Porque é aquele tipo de matéria. Se o professor quiser tornar ela impossível de passar, basta duas vezes, daí um pouco todos já se quebram. Certo? Agora que acabou a aula, quero saber se o meu grupo só desistiu da matéria aí, o que que eu faço? Faz o projeto final sozinho. Ah, meu Deus. Posso me juntar num grupo, não? Ah, meu Deus. O Luiz Carlos já deu a dica pra vocês que o jogo é dificilmente zerável, né? Mas eu não consigo fazer o jogo não. Isso é verdade. Pega lá, sei lá, pega dois diazinhos aí seu. Eu sei que é difícil, mas pega dois dias, bota música, história, faz o relatório, cê já ganha. Já é quatro pontos, já é quatro ponto aí quase. Só o relatório já é dois pontos. Três pontos, dois pontos, dois de relatório, meio de música, meio de história. Então, já tem três pontos aí pra você fazendo só isso. Bem-vindo. Não, eu queria dizer que só o relatório já é dois, então só de fazer o relatório e mais. Então, se eu fizer dois, você tem que fazer dois. Aí, aí os três pontos. Então, eu fiz um botão aqui, hein? Sim, sim, sim. E agora é meio ponto de música e meio ponto de história. Você fica com três pontos. Brava. É, tirar dez na P3, entendi. Tá bom. Fede que se o grupo desistir, não é sério. Tá, pessoal, vou parar a gravação aqui então, porque eu já",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 12,
        "timestamp_start": 6273.6,
        "timestamp_end": 6280.64,
        "slide_description": "Como um Engenheiro de Computação Sênior, procedi à análise do slide de Arquitetura de Computadores. Abaixo, detalho o conteúdo visual para um sistema de busca semântica, priorizando a informação técnica e densidade.\n\n---\n\n**Título do Slide:** RISC-V Pipeline\n\n**Informações da Aula/Curso (canto superior direito):**\nUnB – CIC0099 – Organização e Arquitetura de Computadores\nDepartamento de Ciência da Computação\nProf. Marcus Vinicius Lamar\nUniversidade de Brasília\n\n**Diagrama Principal: Datapath de Pipeline RISC-V de Cinco Estágios com Detecção e Encaminhamento de Hazards e Suporte a Exceções/Interrupções**\n\nO diagrama representa um pipeline clássico de cinco estágios para a arquitetura RISC-V, complementado com unidades para lidar com hazards de dados e controle, além de componentes para tratamento de exceções e interrupções.\n\n**Estrutura e Fluxo de Dados por Estágio:**\n\n1.  **Estágio IF (Instruction Fetch - Busca de Instrução):**\n    *   **PC (Program Counter):** Registrador que armazena o endereço da instrução atual. É alimentado por um multiplexador (Mux) que seleciona entre:\n        *   PC + 4 (próxima instrução sequencial).\n        *   Endereço de desvio (branch target) ou salto (jump target), calculado a partir do estágio EX.\n        *   Endereço de tratamento de exceção/interrupção, como o **UTVEC** (User Trap Vector, anotado em vermelho), que direciona para a rotina de interrupção/exceção.\n    *   **Instruction Memory:** Recebe o endereço do PC e fornece a instrução correspondente.\n    *   **Registrador de Pipeline IF/ID:** Armazena a instrução buscada e o PC + 4 para o próximo estágio.\n    *   **Sinal IF.Flush (anotado em vermelho):** Ativado pela Hazard Detection Unit para invalidar a instrução sendo buscada, tipicamente após um branch mal previsto ou uma exceção.\n\n2.  **Estágio ID (Instruction Decode - Decodificação de Instrução):**\n    *   **Registrador de Pipeline IF/ID:** Fornece a instrução e PC + 4.\n    *   **Registers (Register File):** Lê os valores dos registradores-fonte (rs1, rs2) conforme especificado na instrução.\n    *   **Imm Gen (Immediate Generator):** Gera o valor imediato para a instrução, dependendo do tipo da instrução (I-type, S-type, B-type, U-type, J-type).\n    *   **Control Unit:** Decodifica o opcode da instrução e gera todos os sinais de controle para os multiplexadores e unidades funcionais nos estágios seguintes. Interage com a Hazard Detection Unit.\n    *   **Hazard Detection Unit:** Monitora os registradores-fonte e destino para detectar hazards de dados e controle. Gera sinais de stall e flush.\n    *   **Sinal ID.Flush (anotado em vermelho):** Ativado pela Hazard Detection Unit para invalidar a instrução no estágio ID, geralmente para lidar com branches, jumps ou exceções.\n    *   **Registrador de Pipeline ID/EX:** Armazena os valores dos registradores lidos, o valor imediato, os sinais de controle e outras informações para o estágio de execução.\n\n3.  **Estágio EX (Execute - Execução):**\n    *   **Registrador de Pipeline ID/EX:** Fornece as entradas para este estágio.\n    *   **ALU (Arithmetic Logic Unit):** Realiza operações aritméticas e lógicas, baseadas no **ALU Ctrl** (ALU Control) gerado pelo Control Unit. Suas entradas são selecionadas por Muxes, que podem receber dados do ID/EX ou valores encaminhados.\n    *   **Forwarding Unit:** Detecta hazards de dados e, quando possível, encaminha os resultados dos estágios MEM ou WB diretamente para as entradas da ALU, evitando stalls. Os Muxes de entrada da ALU são controlados por esta unidade.\n    *   **Sinal EX.Flush (anotado em vermelho):** Usado para invalidar instruções no estágio de execução, frequentemente em resposta a exceções ou branches.\n    *   **Registrador de Pipeline EX/MEM:** Armazena o resultado da ALU, o segundo operando para escrita em memória (se for store), o endereço de destino para escrita no banco de registradores (se for write back), e sinais de controle relevantes.\n\n4.  **Estágio MEM (Memory Access - Acesso à Memória):**\n    *   **Registrador de Pipeline EX/MEM:** Fornece as entradas.\n    *   **Data Memory:** Usada para operações de carga (load) e armazenamento (store). O endereço é fornecido pelo resultado da ALU. A operação (leitura ou escrita) é controlada por sinais do Control Unit.\n    *   **Registrador de Pipeline MEM/WB:** Armazena os dados lidos da memória (para loads), o resultado da ALU (para operações aritméticas/lógicas), e o endereço de destino do registrador para o estágio de escrita.\n\n5.  **Estágio WB (Write Back - Escrita de Volta):**\n    *   **Registrador de Pipeline MEM/WB:** Fornece os dados.\n    *   **Mux de Write Back:** Seleciona qual valor será escrito de volta no Register File:\n        *   Dados lidos da Data Memory (para loads).\n        *   Resultado da ALU (para operações aritméticas/lógicas).\n        *   PC + 4 (para jumps e branches com link, para armazenar o endereço de retorno).\n    *   **Registers (Register File):** O valor selecionado é escrito no registrador de destino, conforme instruído pelos sinais de controle.\n\n**Componentes Adicionais e Anotações Manuscritas:**\n\n*   **Interação com o PC:** Múltiplas linhas vermelhas indicam que o valor do PC pode ser atualizado a partir de diferentes fontes, incluindo resultados da ALU, endereços de branch/jump e, notavelmente, **UTVEC** (User Trap Vector) para tratamento de interrupções/exceções.\n*   **Seção de Tratamento de Exceções/Interrupções (canto superior direito):** Uma parte do diagrama, fortemente anotada em vermelho, detalha um multiplexador que parece selecionar o próximo PC ou um valor a ser salvo/lido de registradores de estado/controle (CSRs) em cenários de exceção ou interrupção. As entradas visíveis e anotadas para este Mux são:\n    *   **SV:** Provavelmente um valor de System Vector ou Supervisor Vector.\n    *   **EPC (Exception Program Counter):** Registrador que armazena o endereço da instrução que causou a exceção.\n    *   **JVAL:** Pode ser um valor de Jump Value ou similar.\n    *   Outras entradas são rotuladas com números \"2\", \"4\", \"6\", \"0\", \"1\".\n    *   As saídas desse bloco parecem ser **IC**, **EP**, **EV** (possivelmente Interrupt Cause, Exception PC, Exception Value), e **BND / RSAL** (Bounds / Return Address Save Link), indicando funcionalidades de tratamento de armadilhas, gerenciamento de contexto ou extensões específicas da arquitetura.\n*   **Conexões de controle:** Linhas finas azuis representam os sinais de controle que permeiam o pipeline, originando-se principalmente da Control Unit e interagindo com a Hazard Detection Unit e Forwarding Unit.\n*   **Anotações no PC Mux:** A anotação \"10\" e \"arx, xB, xC\" (parcialmente cortada) são notas adicionais, possivelmente referências a registradores específicos ou endereços utilizados em exemplos de aula.\n\nO diagrama ilustra um projeto de pipeline robusto para RISC-V, abordando os desafios de desempenho e correção através do uso de unidades de controle, detecção de hazards, encaminhamento e mecanismos de tratamento de exceções.",
        "transcription": "Passei lá para a apresentação do Fátima, que é agora, às quatro horas, então está todo mundo convidado.",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 13,
        "timestamp_start": 6280.64,
        "timestamp_end": 6282.6,
        "slide_description": "Como um Engenheiro de Computação Sênior, analisei o slide e o contexto fornecidos.\n\nO conteúdo visual principal consiste na tela compartilhada do apresentador, que atualmente exibe a área de trabalho do sistema operacional Windows, e o feed de vídeo do próprio professor.\n\n**1. Transcrição de Texto e Títulos:**\n\n*   **Título da Sala de Aula Virtual:** \"Sala de Aula de OAC\" (provável abreviação de Organização e Arquitetura de Computadores).\n*   **Informações no canto superior direito da tela compartilhada:**\n    *   \"Universidade de Brasília\"\n    *   \"Departamento de Ciência da Computação\"\n    *   \"CIC0009 - Organização e Arquitetura de Computadores\"\n    *   \"Prof. Marcus Vinicius Lamar\"\n*   **Texto na barra superior da janela do navegador (parcialmente visível):** \"ConferênciaWeb - Sala de Au...\"\n*   **Elementos de UI do player de vídeo e chat foram ignorados conforme solicitado, pois não fazem parte do conteúdo da aula em si.**\n\n**2. Descrição de Diagramas e Fluxo de Dados:**\n\n*   **Não há diagramas de datapath, pipeline, hierarquia de memória, ou qualquer representação gráfica complexa relacionada à arquitetura de computadores visível no momento.** A tela compartilhada exibe o wallpaper padrão do Windows (o logotipo do Windows 10/11 em um fundo azul gradiente), indicando que o professor está na tela inicial de seu desktop, possivelmente antes de iniciar a apresentação dos slides da aula. Um cursor do mouse vermelho está visível na parte inferior central da tela.\n\n**3. Conteúdo Visual Adicional:**\n\n*   O feed de vídeo do professor, Marcus Vinicius Lamar, é visível no canto inferior direito da tela compartilhada. Ele é um homem com barba e óculos, e parece estar engajado na transmissão, provavelmente falando.\n\nEm resumo, a imagem apresenta o início de uma aula de \"Organização e Arquitetura de Computadores\" da Universidade de Brasília, com o Prof. Marcus Vinicius Lamar. No momento da captura, a tela compartilhada exibe o desktop do professor (wallpaper do Windows) e não há conteúdo técnico específico do curso, como diagramas de arquitetura ou código, visível. O foco atual é a identificação do curso e do professor.",
        "transcription": "Não tinha que marcar o *fetch*.",
        "video_source": "OAC_2022-04-18.mp4"
    },
    {
        "id": 14,
        "timestamp_start": 6282.6,
        "timestamp_end": 6291.24,
        "slide_description": "Atuando como um Engenheiro de Computação Sênior, analisei o slide de uma aula de Arquitetura de Computadores, focado na arquitetura de pipeline RISC-V. Abaixo, descrevo o conteúdo visual para um sistema de busca semântica (RAG), transcrevendo textos e detalhando diagramas.\n\n---\n\n**Título do Slide:**\nRISC-V Pipeline\n\n**Informações da Aula/Curso (canto superior direito):**\nUnB – CIC0099 – Organização e Arquitetura de Computadores\nUniversidade de Brasília\nDepartamento de Ciência da Computação\nProf. Marcus Vinicius Lamar\n\n**Diagrama Principal: Pipeline RISC-V de 5 Estágios**\n\nO slide apresenta um diagrama detalhado do *datapath* de um processador RISC-V segmentado (pipelined) de 5 estágios (Instruction Fetch - IF, Instruction Decode - ID, Execute - EX, Memory Access - MEM, Write Back - WB), com implementações de detecção de *hazard* (conflito), *forwarding* (encaminhamento) e mecanismos para tratamento de *flush* (esvaziamento do pipeline) e exceções.\n\n**Estrutura e Fluxo de Dados:**\n\n1.  **Estágio IF (Instruction Fetch - Busca de Instrução):**\n    *   Um registrador `PC` (Program Counter) armazena o endereço da instrução atual.\n    *   Um somador `+4` calcula o endereço da próxima instrução sequencial (`PC+4`).\n    *   Um multiplexador (`Mux`) seleciona a próxima instrução, com entradas para `PC+4`, um endereço de desvio/salto (calculado via `Shift left 1` e `ALU` do estágio EX) e uma entrada manuscrita \"10\" que aponta para `UTVEC` (User Trap Vector), sugerindo um endereço de vetor de interrupção/exceção. Há um Mux com entradas `0`, `U` (User?), `M` (Machine?), `PC` (valor do PC) controlando a escrita no registrador PC.\n    *   `Instruction memory` (Memória de Instruções) busca a instrução no endereço fornecido pelo PC.\n    *   O sinal `IF Flush` (manuscrito \"r\" ao lado) é visível, indicando a capacidade de esvaziar este estágio.\n    *   Dados do IF são passados para o registrador de pipeline `IF/ID`.\n\n2.  **Estágio ID (Instruction Decode - Decodificação de Instrução):**\n    *   Registrador de pipeline `IF/ID` propaga a instrução e o `PC+4` para este estágio.\n    *   `Registers` (Arquivo de Registradores): Leitura de dois operandos de registradores com base nos campos `rs1` e `rs2` da instrução.\n    *   `Imm Gen` (Immediate Generator): Gera o valor imediato dependendo do tipo da instrução.\n    *   `Control` unit (Unidade de Controle): Decodifica a instrução e gera sinais de controle para todos os estágios do pipeline.\n    *   `Hazard detection unit` (Unidade de Detecção de Conflitos): Recebe informações dos campos de registradores lidos e dos registradores destino de estágios posteriores (`EX/MEM`, `MEM/WB`). Gera sinais de `ID Flush` e `IF Flush` para pausar ou esvaziar o pipeline em caso de conflitos de dados.\n    *   `Shift left 1`: Usado para calcular deslocamentos para desvios (branches).\n    *   Sinal `ID Flush` presente.\n    *   Dados do ID são passados para o registrador de pipeline `ID/EX`. Um Mux no caminho do registrador de destino para o registrador `ID/EX` é anotado com \"7C\".\n\n3.  **Estágio EX (Execute - Execução):**\n    *   Registrador de pipeline `ID/EX` propaga instrução, operandos lidos, valor imediato e sinais de controle.\n    *   `Mux`s para seleção dos operandos da `ALU` (Arithmetic Logic Unit): Permitem a escolha entre valores de registradores, valores imediatos ou dados encaminhados (`forwarded`) de estágios posteriores para resolver conflitos de dados.\n    *   `ALU` (Arithmetic Logic Unit): Realiza operações aritméticas e lógicas.\n    *   `ALU Ctrl` (ALU Control): Unidade de controle específica para a ALU.\n    *   `Forwarding unit` (Unidade de Encaminhamento): Observa os registradores de destino dos estágios `EX/MEM` e `MEM/WB` e os registradores de leitura do estágio EX. Se houver um conflito de dados (o operando necessário no EX está disponível em um estágio posterior), ela direciona o resultado apropriado via Muxes para a entrada da ALU.\n    *   Um sinal manuscrito \"PC\" (em vermelho) sai do registrador `ID/EX` e se conecta a um Mux antes do registrador `EX/MEM`, indicando que o `PC+4` é propagado.\n    *   Um sinal manuscrito \"DT\" (Data Target) aponta da saída da `ALU` para o campo de endereço da `Data memory` no estágio MEM.\n    *   Dados do EX são passados para o registrador de pipeline `EX/MEM`.\n\n4.  **Estágio MEM (Memory Access - Acesso à Memória):**\n    *   Registrador de pipeline `EX/MEM` propaga resultado da ALU, dados para escrita na memória (se for uma operação de loja), e o endereço de destino do registrador.\n    *   `Data memory` (Memória de Dados): Realiza operações de leitura (`LW`) ou escrita (`SW`) no endereço calculado pela ALU.\n    *   Sinal `EX Flush` presente, indicando a capacidade de esvaziar este estágio.\n    *   Dados do MEM são passados para o registrador de pipeline `MEM/WB`.\n\n5.  **Estágio WB (Write Back - Escrita de Volta):**\n    *   Registrador de pipeline `MEM/WB` propaga o dado a ser escrito de volta no arquivo de registradores (seja o resultado da ALU ou o dado lido da memória).\n    *   Um `Mux` final seleciona entre o dado lido da memória e o resultado da ALU para ser escrito no `Registers` file.\n    *   O dado é escrito no `Registers` file no endereço de destino especificado pela instrução.\n\n**Mecanismos de Controle e Interconexão Adicionais:**\n\n*   **Sinais de Flush:** `IF Flush`, `ID Flush`, `EX Flush` são acionados pela `Hazard detection unit` ou por lógica de controle de desvios/exceções para esvaziar estágios específicos do pipeline, por exemplo, após um desvio condicional tomado ou uma interrupção.\n*   **Encaminhamento (Forwarding):** Várias linhas tracejadas e sólidas (`7C` anotado em algumas) conectam as saídas dos registradores de pipeline `EX/MEM` e `MEM/WB` de volta aos Muxes de entrada da `ALU` no estágio EX, permitindo que os resultados intermediários sejam usados como operandos sem esperar a fase de Write Back, mitigando conflitos de dados.\n*   **Tratamento de Exceções/Interrupções (Manuscrito em vermelho, canto superior direito):**\n    *   Um bloco de Muxes recebe diversas entradas, incluindo valores do `PC` (`SV`, `0`, `2`, `4`, `6`) de diferentes estágios ou fontes.\n    *   Saída do primeiro Mux (entradas 0, 2, 4, 6): Rotulado `CAUX` (provavelmente Cause Auxiliary, indicando a causa da exceção).\n    *   Saída do segundo Mux (entradas 1, SV): Rotulado `EPC` (Exception Program Counter, que armazena o endereço da instrução que causou a exceção).\n    *   Saída do terceiro Mux (entradas 0, 1): Rotulado `JVAL` (Jump Value, talvez um endereço de retorno ou um valor de salto específico para exceções).\n    *   Uma linha `EV` (Exception Vector) é mostrada saindo deste bloco, indicando o endereço para onde o PC deve saltar para iniciar a rotina de tratamento de exceção.\n    *   Duas anotações adicionais: `BND` (provavelmente Bound, relacionado a verificação de limites de memória) e `RRSAL` (significado incerto sem contexto adicional, poderia ser um registrador de status ou controle de exceções).\n\n**Anotações Adicionais (manuscritas):**\n\n*   \"7C\": Aparece em diversos pontos, como na saída do `Hazard detection unit` para o `Control`, na entrada de um Mux no estágio ID, e próximo à saída da ALU. Sugere um valor de controle específico ou um identificador de sinal.\n*   \"artix?, xb,0\": Anotação no canto inferior esquerdo, possivelmente relacionada a discussões sobre implementação em hardware (por exemplo, FPGAs Artix da Xilinx) ou campos de registradores/instruções (`xb` como um registrador ou porção de uma instrução).\n\nEste slide descreve um pipeline RISC-V fundamental, incorporando técnicas avançadas de otimização e tratamento de exceções, essenciais para o desempenho e a robustez de processadores modernos.",
        "transcription": "Não tinha que marcar uma coisa lá para quem vai apresentar?",
        "video_source": "OAC_2022-04-18.mp4"
    }
]