[
    {
        "id": 1,
        "timestamp_start": 2.51,
        "timestamp_end": 440.16,
        "slide_description": "O slide de Arquitetura de Computadores apresenta uma análise comparativa e demonstrativa de sistemas de numeração em diferentes bases, focando nos conjuntos de dígitos permitidos e em exemplos de operações aritméticas de adição. O conteúdo é organizado em três seções distintas, cada uma dedicada a uma base numérica específica:\n\n1.  **Base 10 (Decimal):**\n    *   **Título:** \"BASE 10\"\n    *   **Definição do Conjunto de Dígitos (S):** \"S = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9}\". Este conjunto representa os dez símbolos numéricos utilizados no sistema decimal.\n    *   **Exemplo de Adição:** É apresentada uma operação de adição vertical já resolvida, ilustrando o processo de \"carry\" (vai um) comum na aritmética decimal.\n        ```\n          ¹37\n        + 24\n        -----\n          61\n        ```\n        Aqui, 7 + 4 resulta em 11; o dígito '1' é registrado na coluna das unidades e um '1' é transportado (carry) para a coluna das dezenas. Na coluna das dezenas, 1 (carry) + 3 + 2 resulta em 6, formando o total de 61.\n\n2.  **Base 16 (Hexadecimal):**\n    *   **Título:** \"BASE 16\"\n    *   **Definição do Conjunto de Dígitos (S):** \"S = {0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, F}\". Este conjunto define os dezesseis símbolos hexadecimais, onde as letras A a F representam os valores decimais de 10 a 15, respectivamente.\n    *   **Exemplo de Adição:** Uma operação de adição hexadecimal é proposta, mas o resultado final não está visível.\n        ```\n          A6C\n        +  B6\n        -----\n        ```\n        Este exemplo serve para que os alunos apliquem as regras de adição em base 16, que envolvem considerar os valores decimais dos dígitos hexadecimais e o conceito de carry quando a soma excede F (15 decimal). O instrutor está ativamente apontando para esta seção, indicando que ela é um foco da discussão ou será resolvida em breve.\n\n3.  **Base 2 (Binária):**\n    *   **Título:** \"BASE 2\" (O dígito '2' está parcialmente visível, mas inferível pelo contexto).\n    *   **Definição do Conjunto de Dígitos (S):** \"S = {0, 1}\". Este conjunto indica que o sistema binário utiliza apenas dois símbolos.\n    *   **Exemplo de Adição:** Uma operação de adição binária é apresentada, mas o resultado não está escrito.\n        ```\n          101101\n        +   1011\n        --------\n        ```\n        Este problema demonstra a adição de números binários, um conceito fundamental em arquitetura de computadores, onde as regras de 0+0=0, 0+1=1, 1+0=1 e 1+1=0 com carry 1 são aplicadas.\n\nEm suma, o slide é uma ferramenta didática para introduzir ou revisar os sistemas de numeração posicional e suas operações fundamentais de adição, cruciais para a compreensão do funcionamento interno de processadores e sistemas digitais. A progressão de base 10 para base 16 e base 2 reflete a relevância crescente dessas representações no contexto da computação.",
        "transcription": "Na última vídeo-aula, nós trabalhamos a representação numérica de números nas diferentes bases: base 10, base 2, base 16, base 8. Hoje, nós vamos continuar com esse assunto, fazendo as operações aritméticas nas diferentes bases. Uma vez que a gente já sabe representar um número, nós temos que operar com esses números. Então, vamos ver, inicialmente, assuntos que vocês já conhecem, uma vez que a base 10 é conhecida de todo mundo. Então, a base 10 é composta por essa sequência ordenada de símbolos 0, 1, 2, 3, 4, 5, 6, 7, 8 e 9. A partir dessa nossa definição da base 10, todas as operações aritméticas vão ser realizadas da maneira que nós já aprendemos. Então, por exemplo, o número 2537 mais 524, como que a gente realiza essa operação? Nós aprendemos que a gente tem que colocar os dois números um embaixo do outro, com as casas das unidades, das dezenas e das centenas. E fazer a operação de soma, dígito a dígito. Então, nesse caso, desse exemplo, nós temos 7 mais 4. Quanto vale 7 mais 4? Uma das formas que a gente tem de calcular isso seria utilizando os dedos. Mas, vamos utilizar a própria sequência ordenada para fazer esse cálculo. Então, se eu passo do número 7, eu quero somar 4. Então, eu vou contar 4 algarismos para frente. 1, 2, 3, que seria o 1, 0, que é 10. 4, que é o 11. Então, 7 mais 4 é? 1, 2, 3, 4, 11. Desse modo, na nossa operação, nós vamos colocar o 1 na casa das unidades aqui. E o 1 das dezenas é o famoso vai 1. Aqui a casa decimal das dezenas passa para a próxima parcela da soma. Na segunda parcela, nós vamos somar 1 mais 3, que a gente sabe que é 4, mais 2, dando 6. Coloca aqui o resultado. Continuando, 5 mais 5. Ok, se nós não soubéssemos que 5 mais 5 vale 10, a gente começaria do 5 e contaríamos 5 unidades. 1, 2, 3, 4, 5. Resultando, então, no número 10. 0 vai 1. E 2 mais 1, 3. Então, desse modo, 2537 mais 524, a gente chega ao resultado de 3061. Isso na base 10. Esses mesmos algoritmos que nós aplicamos aqui, vamos aplicar para qualquer que seja a base. Na base 16, nós temos a sequência ordenada, que define a base como sendo 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, A, B, C, D, E, F. Então, desse modo, se eu quero fazer a soma desses dois números que estão na base hexadecimal. A6C mais B6. Então, usando a mesma forma que nós utilizamos para decimal, vamos somar primeiro as unidades. C mais 6. Quanto que é C mais 6? Bom, se a gente não sabe, a gente poderia contar nos dedos, mas vamos utilizar a sequência ordenada para fazer essa conta. Então, partindo do dígito C, vamos contar 6 dígitos para frente. 1, 2, 3, 4, 5, 6. Logo, C mais 6 é 12 (hexadecimal). C mais 6 vale 12 (hexadecimal). Então, deixamos 2 aqui. E o 1 vai como \"vai 1\" para a próxima parcela. 6 mais 1, 7. 7 mais B. Então, quanto vale 7 mais B? Vamos partir do B e contar 7 unidades para frente. Então, B. 1, 2, 3, 4, 5, 6, 7. Que dá, então, um 2 também. Então, 2 vai 1. E a última parcela, A mais 1. A mais 1 é B. Desse modo, chegamos à conclusão que o número A6C mais B6 vale B22 (hexadecimal). Da mesma maneira que nós fizemos as operações na base 10 e base 16, podemos fazer as operações na base 2. Onde, então, a sequência ordenada é simplesmente dada pelos símbolos 0 e 1. Então, desse modo. Se eu tenho o número 101101 mais 1011. O algoritmo para fazer a soma é o mesmo. Então, 1 mais 1. Se eu tenho 1 e ando uma unidade para frente, ele vem para cá. Então, 1 mais 1 é 10 (binário). Então, 0 e vai 1. 0 mais 1 é 1. 1 mais 1, a gente acabou de ver que era 10 (binário). Então, 0 vai 1. Foi 1. Agora, 1 mais 1 é 10 (binário). Mais 0 dá 10 (binário). Então, 0 vai 1. Na próxima parcela, 1 mais 1 é 10 (binário). 10 (binário) mais 1, 11 (binário). Na próxima parcela, 1 mais 0, 1. E a próxima, 1. Então, desse modo, chegamos à conclusão que esse número mais esse número vale esse. Vamos verificar se essa operação está correta, fazendo a conversão, então, desses números para decimal e verificar se a conta bate. Esse número aqui, primeiro, para decimal, conforme nós vimos na última aula. Nós vamos fazer a soma ponderada dos dígitos: 1 vezes 2 na 0, mais 0 vezes 2 na 1, mais 1 vezes 2 na 2, mais 1 vezes 2 na 3, mais 0 vezes 2 na 4, mais 1 vezes 2 na 5. Podemos transformar esses números que estão em binário para base decimal para verificar se o cálculo está correto. Então, esse número em decimal é 45, esse número em decimal é 11, e 45 mais 11 te dá esse número em decimal, que é 56. Mostrando que a conta está correta. Da mesma forma, podemos fazer para base 16. Deste modo, apenas para conferir se o resultado está correto, vamos transformar as parcelas para decimal. Então, A6C (hexadecimal) é 2668 (decimal), B6 (hexadecimal) é 182 (decimal), e o resultado B22 (hexadecimal), então, fecha com essa soma que é 2850 (decimal).",
        "video_source": "Introdução aos Sistemas Computacionais - Soma Em Diferentes Bases.mp4"
    }
]