[
    {
        "id": 1,
        "timestamp_start": 0.94,
        "timestamp_end": 39.38,
        "slide_description": "A análise do slide apresenta um plano de ensino detalhado para uma disciplina de Arquitetura de Computadores (OAC), provavelmente de nível universitário, como indicado pelo título do documento \"OAC_A_Plano_2021-2_v0\". O conteúdo é apresentado em formato de tabela, listando tópicos, datas e avaliações. Não há diagramas visuais (como datapath, pipeline ou hierarquia de memória) presentes no slide, apenas a menção textual desses conceitos nos tópicos.\n\nA transcrição fiel do conteúdo da tabela é a seguinte:\n\n| Semana/Data Inicial | Data Final | Tópicos Principais (Esquerda) | Tópicos Complementares ou Avaliações (Direita) |\n| :------------------ | :--------- | :------------------------------ | :--------------------------------------------- |\n| 24/1                | 26/1       | 2) Desempenho: Fatores (C.1)    | 3) Desempenho: Medidas (C.1)(T1)               |\n| 31/1                | 2/2        | 4) Ling. de Máquina: ISA (C.2)  | 5) Ling. de Máquina: Assembly (C.2)(T2)        |\n| 7/2                 | 9/2        | 6) Ling. de Máquina: Procedimentos (C.2) | 7) Ling. de Máquina: Recursividade e I/O (C.2)(T3) |\n| 14/2                | 16/2       | 8) Arit. Computacional: Inteiros (C.3) | 9) Arit. Computacional: ULA (C.3)(T4)         |\n| 21/2                | 23/2       | 10) Arit. Computacional: Fracionários, IEEE 754 (C.3) | 11) Outras Arquiteturas (T5)                   |\n| 28/2                | 2/3        | FERIADO                         | Lab 1A: Software - pars (T6)                   |\n| 7/3                 | 9/3        | Lab 1B: Software - Compilador C | Lab 2: Hardware - Verilog - ULA (T7)           |\n| 14/3                | 16/3       | 1ª Prova (P1)                   | 12) Processador Uniciclo: Unidade de Controle (C.4) (T8) |\n| 21/3                | 23/3       | 13) Processador Uniciclo: Unidade de Controle (C.4) (L1) | Lab 3: Processador Uniciclo (T9)               |\n| 28/3                | 30/3       | 14) Processador Multiciclo: Unidade Operativa (C.4) | 15) Processador Multiciclo: Unidade de Controle (C.4) (T10) |\n| 4/4                 |            | Lab 4: Processador Multiciclo   | 16) Processador Pipeline: Conceitos (C.4)(L3)  |\n| 11/4                | 13/4       | 17) Pipeline: Unidade Operativa e Controle (C.4) | Lab 5: Processador Pipeline (T12)              |\n| 18/4                | 20/4       | 18) Exceção e Interrupção (C.4) (L4) | 19) Memória: Hierarquia (C.5) (T13)           |\n| 25/4                | 27/4       | 19.1) Memória: Cache (C.5)      | 2ª Prova (P2) (L5)                             |\n| 2/5                 | 4/5        | Prova Substitutiva              | Apresentação dos Projetos (P4) (T15)           |\n\n**Descrição do Conteúdo para um Sistema RAG:**\n\nEste documento é um plano de curso para a disciplina de Arquitetura de Computadores (OAC), referente ao período 2021-2. Ele detalha uma progressão lógica de tópicos, começando com **desempenho** (fatores e medidas), seguido por **linguagem de máquina** (ISA, Assembly, procedimentos, recursividade, I/O). A seguir, aborda a **aritmética computacional** (números inteiros, Unidade Lógica e Aritmética - ULA, números fracionários conforme IEEE 754) e introduz o conceito de **outras arquiteturas**.\n\nA ementa inclui sessões práticas de laboratório (Labs) focadas tanto em **software** (parsing, compilador C) quanto em **hardware** (Verilog para ULA). Os tópicos avançam para o estudo de **processadores**, começando com o modelo **uniciclo** (unidade de controle e operativa), e progredindo para o **multiciclo** (unidade operativa e de controle). Em seguida, foca em **pipeline** (conceitos, unidade operativa e controle), **exceção e interrupção**, e finalmente na **hierarquia de memória**, com ênfase em **cache**.\n\nO plano de avaliação inclui duas provas regulares (1ª Prova P1, 2ª Prova P2), uma prova substitutiva e a apresentação de projetos (P4). Os tópicos são categorizados com códigos como C.1, C.2, etc., que podem indicar capítulos ou unidades conceituais, e T1, T2, etc., que possivelmente se referem a tarefas ou tutoriais, enquanto L1, L3, L4, L5 indicam laboratórios específicos ou atividades práticas. \"FERIADO\" indica uma interrupção no calendário das aulas.\n\nNão há código Assembly, C ou Verilog diretamente visível, mas a menção de \"Ling. de Máquina: Assembly\", \"Software - Compilador C\" e \"Hardware - Verilog - ULA\" indica que esses idiomas e ferramentas serão utilizados ou estudados no contexto da disciplina.",
        "transcription": "Bom, então, boa tarde. Vamos dar início a mais uma aula de OAC. Hoje é dia 23 de fevereiro. 23 de fevereiro é para nós vermos, então, outras arquiteturas, uma vez que a gente acabou de ver a arquitetura RISC-V. Só que a gente não acabou ainda, faltou uma partezinha dessa de Aritmética Computacional de Números Fracionários. Então, vamos primeiro terminar a aula passada e depois a gente entra na aula de hoje.",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 2,
        "timestamp_start": 39.38,
        "timestamp_end": 388.3,
        "slide_description": "Este slide de uma aula de Arquitetura de Computadores, da disciplina \"CIC0099 - Organização e Arquitetura de Computadores\" da Universidade de Brasília, ministrada pelo Prof. Marcus Vinicius Lamar, aborda o tema de **Ponto Flutuante na ISA RISC-V, especificamente a extensão RV32IMFD**.\n\nO conteúdo textual principal do slide detalha as características da unidade de ponto flutuante:\n1.  **Tipos de Precisão Suportados:**\n    *   `[ ] F: Single precision` (Precisão Simples)\n    *   `[ ] D: Double precision` (Precisão Dupla)\n    *   `[ ] Q: Quad precision` (Precisão Quádrupla)\n    Esses marcadores indicam as extensões de ponto flutuante que a ISA RISC-V pode incorporar, sendo 'F' e 'D' as mais comuns e presentes na especificação `RV32IMFD` (onde F e D representam Floating-point Single e Double precision, respectivamente).\n\n2.  **Registradores de Ponto Flutuante:**\n    *   `32 Registradores de 64 bits:`\n    *   `f0, f1,..., f30, f31 com convenção`\n    Esta seção especifica que a arquitetura RISC-V possui 32 registradores de ponto flutuante, cada um com 64 bits de largura. Isso permite o armazenamento direto de valores de dupla precisão (64 bits) e a representação de valores de precisão simples (32 bits) dentro desses registradores, ou pares de registradores para precisão quádrupla. A menção \"com convenção\" sugere que há um padrão de uso para esses registradores (e.g., para argumentos, valores de retorno, temporários, salvos, etc.), similar à convenção de chamada para registradores inteiros.\n\n3.  **Float-point Control and Status Register (fcsr):**\n    O slide apresenta um diagrama esquemático do registrador de controle e status de ponto flutuante (fcsr), um componente crucial para o gerenciamento de operações de ponto flutuante. O diagrama detalha a estrutura de bits do fcsr:\n    *   Bits 31 a 8: Marcados como `Reserved` (Reservado), ocupando 24 bits.\n    *   Bits 7 a 5: Designados para `Rounding Mode (frm)` (Modo de Arredondamento), ocupando 3 bits.\n    *   Bits 4 a 0: Designados para `Accrued Exceptions (fflags)` (Flags de Exceção Acumuladas), ocupando 5 bits. Dentro de `fflags`, há 5 bits individuais, cada um representado por um `1` abaixo: `NV`, `DZ`, `OF`, `UF`, `NX`.\n\n    Abaixo do diagrama do fcsr, são detalhados os significados dos campos:\n    *   **Modos de Arredondamento (`frm`):**\n        *   `000: ao número par (round)` - Round to Nearest, ties to Even.\n        *   `001: para o zero (round)` - Round Toward Zero.\n        *   `010: para baixo (floor)` - Round Down (Toward Negative Infinity).\n        *   `011: para cima (ceil)` - Round Up (Toward Positive Infinity).\n        *   `100: para a maior magnitude (round)` - Round to Nearest, ties to Away from Zero (similar ao round half up/down).\n        Estes são modos de arredondamento padrão definidos pela norma IEEE 754.\n\n    *   **Flags de exceção (`fflags`):**\n        *   `NV = Operação Inválida` (Invalid Operation)\n        *   `DZ = Divisão por zero` (Divide by Zero)\n        *   `OF = Overflow`\n        *   `UF = Underflow`\n        *   `NX = Inexato` (Inexact)\n        Estas são as exceções padrão de ponto flutuante definidas pela IEEE 754.\n\n**Tabelas de Registradores:**\nNo lado direito do slide, há duas tabelas que exibem o estado de diversos registradores, presumivelmente em um ambiente de simulação ou depuração, com a maioria dos valores inicializados para zero.\n\n1.  **Tabela de Registradores de Ponto Flutuante:**\n    Esta tabela lista os 32 registradores de ponto flutuante (`f0` a `f31`) com seus respectivos nomes convencionais (`ft0`-`ft11`, `fs0`-`fs11`, `fa0`-`fa7`), números de registradores (0 a 31) e valores hexadecimais atuais. Todos os valores mostrados são `0x0000000000000000`, indicando um estado inicial ou resetado. Os nomes `ftx` (temporary), `fsx` (saved), e `fax` (argument) refletem as convenções de chamada em RISC-V.\n\n2.  **Tabela de Registradores de Controle e Status (CSRs):**\n    Esta tabela, parcialmente visível, lista vários registradores de controle e status (CSRs) com seus nomes, números e valores. Inclui:\n    *   `ustatus` (0): `0x00000000`\n    *   `fflags` (1): `0x00000000` (reflete o campo fflags do fcsr)\n    *   `frm` (2): `0x00000000` (reflete o campo frm do fcsr)\n    *   `fcsr` (3): `0x00000000` (o próprio registrador fcsr)\n    *   `uie` (4): `0x00000000`\n    *   `utvec` (5): `0x00000000`\n    *   `uscratch` (64): `0x00000000`\n    *   `uepc` (65): `0x00000000`\n    *   `ucause` (66): `0x00000000`\n    *   `utval` (67): `0x00000000`\n    *   `uip` (68): `0x00000000`\n    *   `misa` (769): `0x4001128` (Registrador Machine ISA, indicando extensões suportadas)\n    *   `cycle` (3072): `0x00000000`\n    *   `time` (3073): `0x00000000`\n    *   `instret` (3074): `0x00000000`\n    *   `cycleh` (3200): `0x00000000`\n    *   `timeh` (3201): `0x00000000`\n    *   `instreth` (3202): `0x00000000`\n    A maioria dos valores é zero, exceto para `misa`, cujo valor `0x4001128` indica as extensões de ISA presentes no processador simulado ou hardware. Os registradores `cycle`, `time`, `instret` e seus equivalentes `_h` são contadores de performance e tempo, comuns em arquiteturas RISC-V.\n\nEm resumo, o slide fornece uma visão detalhada da unidade de ponto flutuante em uma arquitetura RISC-V RV32IMFD, cobrindo os tipos de precisão, a estrutura dos registradores de ponto flutuante e, de forma abrangente, o papel e a configuração do registrador de controle e status de ponto flutuante (fcsr), incluindo modos de arredondamento e flags de exceção conforme a especificação IEEE 754. As tabelas complementam essas informações mostrando o estado dos registradores.",
        "transcription": "Acho que foi aqui que a gente parou, né? A gente acabou de ver os modos de arredondamento: sempre para baixo, sempre para cima. E, nesse caso aqui, eu posso arredondar sempre para cima, posso arredondar sempre para baixo, ou então usar uma dessas três formas de realizar esse arredondamento, tá? Arredondamento para o zero, maior magnitude ou para o número par. Por que que isso aqui é importante? Porque, dependendo da aplicação, as últimas casas decimais podem fazer diferença. Por exemplo, uma instituição financeira como o IBAN, os 0,05 centavos, né, pode ser importante. Vamos dar uma olhada para isso e depois iremos para o próximo estágio. Dizer se ele vai para a conta do cliente ou se ele vai ficar com o resto no banco, né? Então, esse modo de arredondamento serve justamente para a gente ter controle sobre isso.\n\nOk, como é que isso funciona no RISC-V, né? Então, no RISC-V, a gente tem, a gente viu, a gente tá vendo a RV32I, né? Vimos o módulo M de multiplicação e divisão, e agora o RISC-V tem outros, na realidade, tem outros três módulos, tá: I, M, F, D e Q, tá? Mas o Q não é tão comum assim de implementar. Então, o módulo F, que é de precisão simples, e o módulo D, que é de precisão dupla, tá, que são os dois módulos que o RISC-V tem implementado. Então, para trabalhar com ponto flutuante, né, os arquitetos do RISC-V resolveram colocar um outro banco de registradores, também de 32 registradores. Só que, se o módulo D está implementado, então esses registradores têm 64 bits, tá? Notem que isso aqui está em hexadecimal, tá? Então, tem 64 bits aqui. Se o módulo D tiver implementado. Se o módulo D não tiver implementado, esses registradores são de 32 bits, já que isso vai ser a precisão simples do ponto flutuante. E esses, bom, esse módulo de ponto flutuante, de floating-point, né, também tem a sua convenção, tá? Então, tem os registradores FTs, né, de temporários; FSs, né, de salvos; os FAs, de argumentos. Só não tem ponteiros, por quê? Porque não faz sentido a gente escrever o ponteiro com o número de ponto flutuante, né? Então, a gente tem os registradores temporários, registradores salvos e os registradores de argumentos somente, ok? Então, a gente tem essa convenção.\n\nAlém desse banco de registradores aqui, além do banco de registradores normal de ponto flutuante, o RISC-V, obrigatoriamente, tem um banco de registradores chamado de Controle e Status, tá, Control Status Registers (CSRs). Esse Control Status, se vocês observarem, qual é o número desse último registrador aqui? Começa no registrador 0, 1, 2, 3, 4, 5, daí passa para 64, 65, 66, 67, 3202. Então, na realidade, esse banco de registradores de Controle e Status, eles têm 4.096 registradores. Mas são iguais a esses aqui? Não, tá, porque o acesso a esses bancos de registradores é no registro esporádico. Então, esse aqui é implementado com uma pequena quantidade de memória RAM estática, certo? Então, 4.096 endereços de memória RAM. Então, a memória RAM estática, como se fosse a memória cache, tá, que é a de acesso mais rápido, tá? Então, não chega a ser implementado como um banco de registradores normal, só que se considera isso aqui como um banco de registradores, porque cada um desses registradores, né, cada uma dessas posições dessa memória, vai significar alguma coisa. Então, primeiro é o ustatus, depois o uie, a gente vai tudo ver isso aqui, o utvec, o uscratch, o uepc, o ucause, o utval, o uip. Esse aqui a gente não vai ver. Então, vamos ver. E tem um registradorzinho aqui, tá, o fcsr, tá, que é o Floating-Point Control and Status Register. É um registrador só, e os bits desse registrador, né, te dão algumas informações sobre as operações de ponto flutuante que estão sendo executadas, tá? Então, é um registrador de 32 bits também, esse aqui, que é o registrador número 3, né? Através dele eu consigo saber qual é o modo de arredondamento que está sendo utilizado, né, para fazer as operações de ponto flutuante, né? Então, aqui tem 3 bits, né, que definem o modo de arredondamento, que são esses aqui, tá? Então, 000 define que é o arredondamento para o número par; 001 é o para o zero, desculpe; 010 é o para baixo; 011 é o para cima e 100 para a maior magnitude. Não, não, tenho que arredondar isso aqui. Isso aqui é 0, que são justamente esses modos aqui, tá? Esses modos, 1, 2, 3, 4, 5 modos. 1, 2, 3, 4, 5 modos. Só vou corrigir uma coisinha aqui antes que eu",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 3,
        "timestamp_start": 388.3,
        "timestamp_end": 412.59,
        "slide_description": "A análise do conteúdo visual da imagem revela um ambiente de sala de aula virtual, focado em uma aula de Arquitetura de Computadores (OAC), mas sem conteúdo técnico diretamente no slide principal.\n\n**1. Transcrição de Texto e Títulos:**\n\n*   **Título da Sala:** \"Sala de Aula de OAC\" (provavelmente \"Organização e Arquitetura de Computadores\").\n*   **Informações de Sessão:** Um contador de tempo \"06:41\" é exibido no canto superior direito da área de conteúdo.\n*   **Identificação do Participante Principal:** \"Marcus Vinicius Lam...\" é visível na parte superior central, indicando um palestrante ou moderador ativo.\n*   **Elementos da Barra Lateral (UI da Conferência):**\n    *   **Menu Superior:** \"MENSAGENS\", \"Perguntas\", \"Bate-papo público\" (selecionado).\n    *   **Menu Central:** \"NOTAS\", \"Notas comparti...\".\n    *   **Menu Inferior:** \"USUÁRIOS (19)\".\n*   **Conteúdo do Bate-papo Público:**\n    *   Michel Luis Duwe 13:46: Boa Tarde\n    *   Eduarda Costa de M... 13:47: Tudo bem? Preparado pro feriado?\n    *   Michel Luis Duwe 13:50: Quero estar preparado! Tirando todas as atividades do atraso.\n    *   Eduarda Costa de M... 13:51: Amém 🙏\n    *   Michel Luis Duwe 13:52: Tomara. Passar o feriado estudando é punk hehehe\n    *   Eduarda Costa de M... 13:52: Demais kkkkk espero que vc atinja seus objetivos antes de quarta\n    *   Eduarda Costa de M... 13:52: Pior que quarta tem aula kkkkkry\n    *   Eduarda Costa de M... 13:53: Nesse caso, torço para consiga fazer tudo até segunda\n    *   Michel Luis Duwe 13:53: sim kkk\n    *   João Alberto Travas... 14:00: boa tarde Prof Lamar\n*   **Campo de Entrada do Chat:** \"Enviar mensagem para B\".\n\n**2. Descrição de Diagramas e Fluxo de Dados:**\n\nA área principal do slide, destinada à apresentação do conteúdo da aula, está completamente em branco. Não há diagramas visíveis de qualquer tipo, sejam eles Datapath, Pipeline, Hierarquia de Memória, ou qualquer outra ilustração técnica relacionada à Arquitetura de Computadores. De igual modo, não há código (Assembly, C, Verilog) exibido, tabelas, gráficos ou textos explicativos sobre tópicos específicos da disciplina.\n\n**Resumo para RAG:**\n\nO recurso visual representa o ambiente de uma aula online de \"Organização e Arquitetura de Computadores\" (OAC), conforme indicado pelo título da sala. O conteúdo principal do slide está ausente, exibindo apenas um fundo escuro. A interação é mediada por um bate-papo público visível na lateral, contendo mensagens de alunos (Michel Luis Duwe, Eduarda Costa de M..., João Alberto Travas...) sobre saudações, planejamento de estudos para o feriado, atividades atrasadas e o cumprimento de prazos acadêmicos, culminando com uma saudação ao \"Prof Lamar\". Um timer indica \"06:41\" e \"Marcus Vinicius Lam...\" é destacado, provavelmente o nome do professor. Não há, contudo, qualquer conteúdo técnico instrutivo (diagramas de arquitetura, código, texto explicativo) visível na área do slide.",
        "transcription": "Me esqueça, que aqui estava **round**, na realidade é para o 0, né, então para o 0, tá, esse aqui, não, não, não, não, não, não, não, não, não, não, não, não, não, não, não, não, esse aqui é **round** mesmo, desculpa, agora que eu entendi o que eu estava querendo dizer.",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 4,
        "timestamp_start": 420.04,
        "timestamp_end": 436.02,
        "slide_description": "Como um Engenheiro de Computação Sênior analisando este artefato de uma aula de Arquitetura de Computadores, a área principal do \"slide\" apresenta-se atualmente como um canvas escuro e vazio, sem qualquer conteúdo visual direto, como diagramas de arquitetura (datapath, pipeline, hierarquia de memória), blocos de código (Assembly, C, Verilog), ou texto instrucional sendo exibido.\n\nNo entanto, o contexto da aula é substancialmente fornecido pelos elementos circundantes da interface da plataforma de conferência web:\n\n1.  **Título da Sala de Aula:** No topo da interface, é visível o título \"Sala de Aula de OAC\", o que consistentemente indica uma disciplina relacionada a Organização e Arquitetura de Computadores.\n2.  **Duração da Gravação:** Próximo ao título da sala, um marcador de tempo \"07:00\" acompanhado de um ícone de gravação vermelho sinaliza que a sessão está ativa e sendo registrada, com sete minutos decorridos.\n3.  **Tópico Relacionado (Aba do Navegador):** Uma das abas abertas no navegador exibe o título \"ADD: ADD (x86 Instruction Set Re...\", que é uma referência direta e técnica a \"Conjuntos de Instruções x86\". Este elemento é crucial, pois sugere fortemente que o tema da aula ou material de apoio está relacionado à arquitetura de processadores x86 e seus conjuntos de instruções, um tópico central em arquitetura de computadores.\n4.  **Bate-papo Público (Transcrição):** O painel lateral esquerdo mostra um 'Bate-papo público' ativo, com as seguintes interações dos participantes e horários:\n    *   Michel Luis Duwe (13:46): \"Boa Tarde\"\n    *   Eduarda Costa de M... (13:47): \"Tudo bem? Preparado pro feriado?\"\n    *   Michel Luis Duwe (13:50): \"Quero estar preparado! Tirando todas as atividades do atraso.\"\n    *   Eduarda Costa de M... (13:51): \"Amém 🙏\"\n    *   Michel Luis Duwe (13:52): \"Tomara. Passar o feriado estudando é punk hehehe\"\n    *   Eduarda Costa de M... (13:52): \"Demais kkkkk espero que vc atinja seus objetivos antes de quarta\"\n    *   Eduarda Costa de M... (13:52): \"Pior que quarta tem aula kkkkkry\"\n    *   Eduarda Costa de M... (13:53): \"Nesse caso, torço para consiga fazer tudo até segunda\"\n    *   Michel Luis Duwe (13:53): \"sim kkk\"\n    *   João Alberto ... (offline) (14:00): \"boa tarde Prof Lamar\"\n    Este histórico de chat fornece um vislumbre da interação dos alunos e a identificação do instrutor como \"Prof Lamar\", reforçando o ambiente de aula e a dinâmica entre participantes e professor. As mensagens indicam discussões sobre preparação para feriados e atividades acadêmicas.\n\nEm síntese, embora não haja conteúdo explícito no slide em si, o ambiente da conferência indica claramente uma aula online de Arquitetura de Computadores (OAC), com potencial foco no conjunto de instruções x86, mediada por um professor (Prof Lamar) e com engajamento ativo dos alunos via chat.",
        "transcription": "Esse aqui é o **controle de ponto flutuante**, e esses três para arredondamento, né: arredondamento para o número par, arredondamento para zero, arredondamento para a maior magnitude. Então esses três bits aqui do FSR e do **FCSR** definem esse modo de arredondamento.",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 5,
        "timestamp_start": 437.64,
        "timestamp_end": 1790.39,
        "slide_description": "O slide analisado é de uma aula de Arquitetura de Computadores, focado em \"Ponto Flutuante - ISA RV32IMF – Float-point Single\" (precisão simples de ponto flutuante na arquitetura RISC-V de 32 bits com extensões de inteiros, multiplicação/divisão e ponto flutuante). O conteúdo é apresentado pela Universidade de Brasília, disciplina \"Organização e Arquitetura de Computadores\" (CIC0099), ministrada pelo Prof. Marcus Vinicius Lamar.\n\nO slide detalha instruções Assembly RISC-V para manipulação de dados de ponto flutuante, divididas em três categorias:\n\n1.  **Transferências de dados:**\n    *   `Load: flw f1, -100(t0)`: Esta instrução (\"load float word\") carrega um valor de ponto flutuante de precisão simples da memória para o registrador de ponto flutuante `f1`. O endereço de memória é calculado como o valor do registrador de propósito geral `t0` subtraído de 100 bytes (deslocamento). A anotação `# f1 = Mem[t0 - 100]` descreve semanticamente a operação.\n    *   `Store: fsw f1, -100(t0)`: Esta instrução (\"store float word\") armazena o valor do registrador de ponto flutuante `f1` na memória. O endereço de memória é calculado da mesma forma que no `load`. A anotação `# Mem[t0 - 100] = f1` descreve semanticamente a operação.\n\n2.  **Movimentação sem conversão:**\n    *   `fmv.x.s t0, f1`: Esta instrução (\"float move, bits from float to general purpose\") transfere os bits exatos do registrador de ponto flutuante `f1` para o registrador de propósito geral `t0` sem qualquer interpretação ou conversão de formato. A anotação `# transfere os bits t0 = f1` reforça que é uma cópia bit a bit.\n    *   `fmv.s.x f1, t0`: Similarmente, esta instrução (\"float move, bits from general purpose to float\") transfere os bits exatos do registrador de propósito geral `t0` para o registrador de ponto flutuante `f1`, também sem conversão de formato. A anotação `# transfere os bits f1 = t0` descreve a operação.\n\n3.  **Movimentação com conversão:**\n    *   `fcvt.s.w f1, t0`: Esta instrução (\"float convert to single precision from word\") converte um valor inteiro com sinal (assumindo que `t0` contém um) para um valor de ponto flutuante de precisão simples e armazena o resultado em `f1`. A anotação `# converte inteiro → float` esclarece a funcionalidade.\n    *   `fcvt.s.wu f1, t0`: Similar à anterior, mas esta instrução (\"float convert to single precision from unsigned word\") converte um valor inteiro sem sinal (em `t0`) para um valor de ponto flutuante de precisão simples em `f1`. A anotação `# converte inteiro sem sinal → float` detalha.\n    *   `fcvt.w.s t0, f1`: Esta instrução (\"float convert to word from single precision\") converte um valor de ponto flutuante de precisão simples (em `f1`) para um valor inteiro com sinal e armazena o resultado em `t0`. A anotação `# converte float → inteiro` explica a operação.\n    *   `fcvt.wu.s t0, f1`: Por fim, esta instrução (\"float convert to unsigned word from single precision\") converte um valor de ponto flutuante de precisão simples (em `f1`) para um valor inteiro sem sinal e armazena o resultado em `t0`. A anotação `# converte float → inteiro sem sinal` descreve a conversão.\n\nNão há diagramas visuais (como datapath, pipeline ou hierarquia de memória) presentes no slide; o conteúdo é puramente textual, descrevendo as instruções e suas operações.",
        "transcription": "E também a gente tem esses cinco bits aqui que são exceções, que são flags, que é chamado F-flag, então, flag de ponto flutuante. E elas, então, te dão informações sobre o que aconteceu na instrução que acabou de ser executada. Então, por exemplo, foi executada uma instrução inválida, uma operação inválida. Então, por exemplo, raiz quadrada de menos um, então, uma operação inválida, certo? Porque o resultado dá complexo, seria tipo um Not a Number. Então, eu tenho esse Not Valid, certo? E esse bit aqui, então, seria como se fosse um Not a Number. Divisão por zero é o DZ, então, se der divisão por zero, ele vai sinalizar aqui que aconteceu uma divisão por zero. Depois, Overflow, então, se aconteceu Overflow, ele sinaliza aqui. Se aconteceu Underflow... ele sinaliza aqui. E esse último, esse primeiro bit aqui, indica que se o número pode ser perfeitamente representável na precisão, ou seja, simples, seja dupla, ou não. Seria um número inexato que precisaria de mais dígitos para ser perfeitamente representado. Então, ele chama aqui de número inexato. Quer dizer, ele indica que se aquele número que obteve é o exato ou não, isso precisaria de mais dígitos. Entendeu isso? O que eu quis dizer aqui com esse inexato? Por exemplo, raiz quadrada de 2. OK, a raiz quadrada de 2 vai dar um número que vai ser inexato, porque precisa de infinitas casas decimais. Então, ele vai te representar aqui. Ah, mas tirar a raiz quadrada de... Ele vai ser exato. Então, ele vai te indicar aqui que foi zero, quer dizer, não é inexato. Certo? Mas, justamente, nos dá uma ideia se o resultado é exato ou é uma aproximação. OK. As instruções que o modo F possibilita. Eu queria até fazer aqui uma coisa para você ver, mas não fiz. Então, para a operação... Ah, está escrito aqui. As operações I, E, M... OK. Adição. Então, adição, subtração, multiplicação e divisão. Então, todas elas começam com F. `FADD`, `FSUB`, `FMUL` e `FDIV`. Ponto. Qual é a precisão? Certo? Então, S é precisão simples, que significa float. Se eu botar D aqui, significa que eu estou usando precisão dupla. Então, `FADD.D`, ele vai pegar esse número em precisão dupla, somar com esse número e colocar o resultado aqui. Mas, como aqui eu estou tratando só a precisão simples, os exemplos aqui estão todos em precisão simples. Mas, tudo que tem aqui em precisão simples, vai ter igual que em precisão dupla, só trocando o S por D. Certo? Então, subtração, `FSUB.S F0, F1, F2`. `FMUL.S F0, F1, F2`. OK. Daí, a gente pergunta: a multiplicação de um número de ponto flutuante de 32 bits por um número de ponto flutuante de 32 bits, vai dar um número de quantos bits? Vamos lá. Vamos acordar, pessoal. Então, olha a pergunta que eu fiz. A multiplicação de um número de ponto flutuante de 32 bits vezes um número de ponto flutuante de 32 bits, vai te dar o resultado com quantos bits? Me falaram 64, que para mim é certo, se fosse divisão inteira, divisão de números inteiros. E o resultado fica em 64 bits. Tanto é que tem o `MUL` e o `MULH`, para a gente pegar a parte baixa e a parte alta da multiplicação. Mas, aqui, a multiplicação de um número de 32 com um número de precisão simples, com um número de precisão simples, vai dar um número de precisão simples também. Certo? Assim como a divisão. A divisão de um número de precisão simples com um número de precisão simples também, vai dar um número de precisão simples. E faz parte desse módulo aqui a raiz quadrada. Então, `FSQRT.S F0, F1`. A raiz quadrada desse coloca no `F0`. OK? Então, essas aqui são as operações aritméticas básicas que tem implementadas nesse F. Pode ter outras operações, tipo cosseno, tangente, exponencial, logaritmo? Pode. Só que o hardware implementa isso. O hardware implementa esses aqui. Entendeu? Beleza. Comparação. Clico, comparo dois números em ponto flutuante. Então, eu tenho essas três instruções aqui: `FEQ`, `FLE` e `FLT`. Todos eles, ponto S ou ponto D. Então, `FEQ` aqui, ele vai verificar: F1 é igual a F2? Se for, notem, esse registrador T1, ou o T ou o registrador que vocês quiserem botar aqui, mas do banco de registradores principal, é que vai assumir o valor 0 ou 1. Certo? Então, os operandos são do banco de registradores de ponto flutuante. Mas, o resultado dessa comparação vai ser um registrador lá do banco de registradores principal. Certo? Porque o resultado te dá um inteiro. Mais especificamente, 0 ou 1. Então, verifica se os dois são iguais. Verifica se esse é menor ou igual a esse: F1 é menor ou igual a F2. E se F1 é menor que F2. E só tem essas três instruções. Vocês estão sentindo falta de alguma coisa aqui? De alguma condição? Como é que eu faria uma instrução que verificasse que fosse maior que? Então, `FGT`. Eu preciso implementar o `FGT`? E isso é só trocar. Eu tenho a ordem desses dois aqui. Então, se eu usar o `FLE` e ir trocando esses dois de posição, eu tenho o `FGT`. Se eu trocar esses dois de posições, eu tenho um `FGE` (Greater or Equal). Certo? Então, eu não preciso dessas comparações. Bastam essas aqui. OK? E outras duas funçõezinhas que também eles disponibilizam para o F é o valor maior. Quer dizer, dados dois números F1 e F2, o valor de F0 vai ser o maior desses dois números. Então, o máximo desses dois números. E a mesma coisa no mínimo. Dados esses dois números, o F0 vai assumir o valor menor deles. Certo? Então, para saber qual é o maior de dois números e o menor de dois números, a gente tem essa funçãozinha aqui. Duas instruçõezinhas. Outra coisa que é importante. Transferência de dados. Então, primeiro, transferência de dados para memória e da memória. Tinham instrutores de inteiros. A gente usava `LOAD` e `STORE`. Então, `LOAD WORD`, `LOAD HALF WORD`, `LOAD BYTE`, `STORE WORD`, `STORE HALF WORD`, `STORE BYTE`. Aqui, a gente também vai trabalhar a mesma coisa. `LOAD WORD`. Porque a gente está trabalhando aqui no F. Então, `FLOAD WORD`, ou o famoso `FLW`. O que ele vai fazer? Ele vai pegar esse endereço aqui, que é T0 menos 100, que é T0 mais esse número imediato, da memória. E o que tiver na memória, ele vai colocar no registrador F1. Então, os bits que tiverem lá na memória, nesse endereço, ele coloca dentro de F1. E se eu quero escrever o valor de um registrador na memória, então tem o `FSW`. Então, ele vai escrever na memória, nesse endereço T0 menos 100. Então, a gente só tem o `LOAD` e o `STORE`. Se fosse o D, teria o `FLD` e o `FSD`. Que seria de double, ao invés de word. Beleza. Então, isso aqui é para transferência de dados da memória para o banco de registradores de ponto flutuante e vice-versa. Eu posso querer fazer a movimentação de dados entre o banco de registradores de ponto flutuante e o banco de registradores de inteiros. Eu poderia transferir uma coisa para o banco. Então, ele tem as seguintes funções, instruções: `FMV.X.S T0, F1`. Não me pergunte por que eles resolveram colocar X aqui, que até hoje eu não entendo. X ponto S, o que ele vai fazer? `T0, F1`. Quer dizer, eu recebo como um registrador de destino T0, o registrador de origem o F1. Então, o que essa instrução `FMV.X.S` faz? Ele transfere os bits que estão em F1 para o T0. É uma transferência de bits mesmo. Pega a palavra que está em F1 e coloca em T0. Vamos continuar, pessoal. Não custa nada a gente se esforçar. E, além disso, o Marcelo Vasconcelos muito provavelmente vai ser professor de vocês. Ao contrário, eu também tenho. Então, aqui nesse caso, é `FMV.S.X F1, T0`. Então, o X aqui significa o registrador de banco de inteiros. Então, o registrador de destino é um F, o registrador de origem é o registrador de banco de inteiros, nesse caso, T0. Ele vai transferir os bits de T0 para o F1. Então, o que eu tenho aqui? Cópia de bits. Eu não tenho conversão de números. Eu tenho cópia de bits aqui, simplesmente. Agora, se eu quero converter, quer dizer, então aqui eu tenho as condições `FCVT`. Certo? `FCVT.S.W F1, T0`. Aqui está um pouco mais certo. Por que eles não colocaram W aqui? Não entendo. Aqui ele vai converter de inteiro, o inteiro que está em T0 para o mesmo número escrito em ponto flutuante em F1. OK? Então, considerando T0 um número com sinal, ele converte, por exemplo, aqui em T0 está -5. Em F1 vai ter aquela sequência de bits que a gente viu aqui, quer dizer, essa aqui. Esse aqui é o valor em T0, por exemplo, inteiro -5. O que vai gerar em F1 vai ser esse número aqui, que é o -5, só que em 32 bits de ponto flutuante. Então, esses aqui, efetivamente, fazem a conversão. Certo? Converte de inteiro para flutuante. Eu preciso pedir que meu inteiro seja sem sinal. Que eu esteja trabalhando com números sem sinal, que são números naturais. Então, eu tenho `FCVT.S.WU F1, T0`. Então, converte meu inteiro sem sinal para float. E eu preciso ter os inversos. Eu tenho um número float aqui que eu vou converter para inteiro. Certo? Então, se esse número no float for um número já inteiro, ele vai ficar um número inteiro em T0. Se ele for quebrado, ele vai aproximar para fazer um arredondamento para colocar o número mais próximo dentro de T0. O número inteiro mais próximo. OK? Por exemplo, se aqui tiver 1.7, aqui vai ter 2. Certo? Mas não deixem isso aqui para o processador fazer. Tá? E aqui a mesma coisa, converte de ponto flutuante para um inteiro sem sinal. OK? Então, desse modo aqui, a gente faz as conversões entre ponto flutuante e inteiros. Inteiros com sinal e inteiros sem sinal. E a forma que ele vai aproximar isso aqui é o Rounding Mode, esse aqui, que vai te dizer. Então, aqui um exemplinho... Oi, fala, Michel. No slide anterior, na última instrução, se o float for negativo, o que que acontece? Aqui? Se o float... Você pergunta, pode pegar o Card e fazer esse teste. Beleza. E depois me diz aqui o que que aconteceu. OK, aqui um exemplinho de utilização dessas instruções então, um programa, uma funçãozinha que faz a conversão de graus Fahrenheit para Celsius. Então, ele recebe como argumento a temperatura em Fahrenheit e te devolve a temperatura em graus Celsius. E o que ele faz aqui é essa continha. Então, para graus Fahrenheit diminui de 32, multiplica por 5 e divide por 9. OK? Para a gente compilar isso aqui. Então, primeira coisa. Ah, esse aqui é para eu. Então, está aqui. Fahrenheit para Celsius. E agora, eu preciso fazer essa conta. Eu sei que esse registrador aqui... Qual é o registrador que vai estar esse número aqui? Em que registrador ele vai estar? Não no `A0`. Isso aqui é float. Então, ele vai estar no `FA0`. Não, não é no `F0` também. É no `FA0`. Isso aí. No banco de registradores, a gente tem os registradores de argumentos, que são esses aqui. Certo? Então, nem tem registrador `F0`. Tem `FT0` e `FS0`. Fica melhor aqui. Aqui. Certo? Então, é o `FA0` que vai receber esse valor. E onde que ele tem que devolver o resultado? Também no registrador `FA0`. Para eu fazer essa conta aqui, eu tenho umas constantes. Eu tenho essa constante 5, tenho essa constante 32, tenho essa constante 9. Onde que eu posso armazenar essas constantes? Que eu vou precisar no meu programa. Então, aqui esse programinha ele te mostra duas formas de fazer esses armazenamentos. Um é na memória. Então, por exemplo, no ponto data eu estou dizendo a constante 5 é um `.FLOAT 5.0`. Que é essa constante aqui. E constante 9 é um `.FLOAT 9.0`. Então, eu estou colocando as constantes 5 e 9 na memória. No formato. Então, o que que eu vou fazer? Então, eu vou ler essas constantes para os registradores `FT0` e `FT1`. Então, eu vou pegar o endereço da constante 5 da memória e vou ler do registrador. O `T0` aqui é o endereço. `LA T0, constante5`. Então, o que que essa pseudo-instrução faz? Carrega T0 e conteúdo, quer dizer, esse endereço desse label aqui. Então, o T0 vai conter o endereço de 5 na memória. Então, eu vou ler de `T0 mais 0` e colocar em `FT0`. Então, `FT0` recebe 5. E eu vou ler de `T0 mais 4`. Já que o float aqui são 4 bytes também. Então, eu vou ler de `T0 mais 4`. Precisão simples. E colocar o resultado em `FT1`. `FT1` fica com 9. Então, essa aqui é uma forma da gente armazenar constantes. Mas tem em outro lugar que a gente pode armazenar constantes também. Então, esse tipo aqui é interessante quando a constante não é inteira. Nesse caso aqui, a constante é inteira. Então, poderia fazer de outra forma. Por exemplo, em 32 a constante é inteira. Então, eu vou mostrar como seria uma outra forma. Então, a gente faz um `LI T0, 32`. Então, a pseudo-instrução Load Imediato. Então, eu coloco o número 32 em T0. E depois eu converto de inteiro para ponto flutuante. Então, de T0 que tem 32, eu vou colocar isso em ponto flutuante no FT2. Então, dessa maneira, eu estou colocando a minha própria constante no programa. Não estou precisando colocar na memória. Por que é ruim colocar na memória? Por que é ruim colocar essas constantes na memória? Essa aqui é uma forma mais interessante de se fazer para constantes inteiras. Se você quiser colocar π, você tem que escrever aqui. Por que colocar essas constantes na memória não é muito legal? Exatamente. Acesso à memória é o gargalo dos nossos sistemas computacionais modernos. Certo? Não, não é. É tempo de processamento. O acesso ao dado que está lá vai demandar mais ciclos de clock. Não é processando. Então, não é tempo de processamento. Entendeu? Então, é tempo de acesso. Aqui não. Aqui é o imediato para na própria instrução, para ele já ler direto. E aqui só converte. Então, esse aqui é mais rápido. OK. O que eu preciso fazer? Pegar o meu argumento de entrada, que é o FA0, subtrair de 32 com `FSUB.S FA0, FA0, FT2`, que é o 32. Coloco o resultado ali. Pode ser no próprio FA0. Depois pego o resultado de FA0, que é esse aqui. FA0 menos 32 e vou multiplicar por `FMUL.S FA0, FA0, FT0`, que é 5. E depois vou pegar esse resultado e dividir por `FDIV.S FA0, FA0, FT1`, que é 9. OK? E retorno. Teria uma maneira mais eficiente de fazer isso? Vocês conseguem notar algo que dá para ele fazer para tornar isso mais eficiente ainda? Se eu pedisse otimização desse programa aí, o que vocês iam fazer para diminuir a quantidade de instruções e quantidade de acesso à memória? Tinha uma ideia, professor. Tinha uma ideia. Tá bem. Vou dar uma solução. 5 não é uma constante? 9 não é uma constante? Para que eu tenho que calcular essa conta aqui? Eu não posso simplesmente dividir 5 por 9? 5 dividido por 9? É 0.555... Então, ao invés de eu colocar 2 números na memória, eu vou colocar um float de valor 0.555 aqui. E aqui eu tiro essa multiplicação e faço a divisão só por esse 0.555. Faz sentido para vocês? A quantidade de acesso à memória e diminuir a quantidade de instruções também. Certo? Então, tudo aquilo que der para vocês simplificarem, simplifiquem. Para não fazer o processador gastar tempo calculando essa multiplicação e depois calculando essa divisão. E vocês vão ver no laboratório, na segunda parte do laboratório 1, que o GCC, o compilador C, faz isso aqui para vocês. Ele é esperto. Complexidades do banco de ponto flutuante. Tem Overflow, tem Underflow. O IEEE 754 mantém 2 bits de guarda para arredondamento, para ter certeza se ele vai arredondar para cima ou para baixo ou para o mais próximo. Tem 5 modos de arredondamento. Positivo, dividido por 0, dá infinito, mas ele sinaliza que foi divisão de 0. 0 dividido por 0 produz um Not a Number. Já que é uma operação 0 dividido por 0 é uma... Esqueci o nome. Indeterminação. Certo? O pessoal de vocês está começando a ficar com Alzheimer. Indeterminação. Então, ele te dá um Not a Number. Tem outras complexidades. O x86 teve o famoso bug com a atitude de PENTIUM que a Intel aprendeu com isso aqui. É sempre esconder muito bem os bugs que ela apresenta ou se ela achar um bug corrigir mesmo. Não deixar passar assim. Tem coisas que se procurem sobre isso aqui. É bem divertido. Eu vivi isso aqui. OK.",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 6,
        "timestamp_start": 1790.39,
        "timestamp_end": 1792.39,
        "slide_description": "Atuando como um Engenheiro de Computação Sênior, procedo à análise do slide e conteúdo anotado desta aula de Arquitetura de Computadores, extraindo informações cruciais para um sistema de busca semântica (RAG).\n\n**Conteúdo Transcrito e Descrito:**\n\nA imagem representa uma interface de uma sala de aula virtual em uma plataforma de conferência web, intitulada \"Sala de Aula de OAC\", sugerindo uma disciplina de Organização e Arquitetura de Computadores. No canto superior esquerdo do navegador, uma aba parcial exibe \"ADD: ADD (x86 Instruction Set Re\", indicando que um tópico relacionado ao conjunto de instruções x86, especificamente a instrução `ADD`, foi ou está sendo abordado na aula.\n\nO painel lateral esquerdo exibe as seções \"MENSAGENS\", \"NOTAS\" e \"USUÁRIOS (23)\". Na seção de mensagens, designada como \"Bate-papo público\", são observadas interações entre alunos e o professor. As mensagens incluem:\n\n*   **Eduarda Cos...:** \"Nesse caso, torço para consiga fazer tudo até segunda\" (13:53) - Indicação de um prazo ou tarefa.\n*   **Michel Luis Duwe:** \"sim kkk\" (13:53) - Interação informal.\n*   **João Alberto Travas...:** \"boa tarde Prof Lamar\" (14:00) - Saudação ao professor.\n*   **Maycon Vinnycius S...:** \"64\" (14:11) - Um valor numérico, possivelmente uma quantidade, um endereço de memória, ou um dado em discussão.\n*   **Maycon Vinnycius S...:** \"só trocar a ordem\" (14:14) - Sugestão de reordenação, que pode se referir a instruções, dados ou uma sequência lógica.\n*   **Eduardo Ferreira M...:** \"esqueci de perguntar sobre a eleição do representante do CIC/IE\" (14:17) - Uma questão administrativa relacionada aos Centros de Informática e Engenharia.\n*   **Maycon Vinnycius S...:** \"a0 acho\" (14:21) - Um valor hexadecimal (\"a0\"), possivelmente um endereço, um registrador ou um código de operação.\n*   **Eduardo Ferreira M...:** \"f0\" (14:22) - Outro valor hexadecimal (\"f0\").\n*   **Eduardo Ferreira M...:** \"fa0\" (14:22) - Mais um valor hexadecimal (\"fa0\"), possivelmente em sequência ou relacionado aos anteriores. Esses valores hexadecimais são comuns em discussões sobre assembly, endereçamento de memória ou representação de dados em Arquitetura de Computadores.\n*   **Victor Hugo Rodrig...:** \"Acesso mais devagar?\" (14:25) - Questão sobre desempenho ou latência de acesso, crucial em arquitetura de memória ou I/O.\n*   **João Alberto Travas...:** \"gasta t de processamento\" (14:25) - Complemento à questão anterior, sugerindo que o acesso lento consome tempo de processamento, indicando uma preocupação com eficiência e ciclos de clock.\n*   **João Alberto Travas...:** \"ob prof\" (14:25) - Agradecimento ao professor.\n*   **João Alberto Travas...:** \"jóia\" (14:28) - Confirmação ou aprovação.\nA caixa de entrada do chat exibe \"Enviar mensagem para B\", indicando a funcionalidade de envio de mensagens.\n\nNa área principal da tela, um temporizador de gravação indica \"29:58\". Uma janela flutuante exibe \"Marcus Vinicius Lam...\" com a descrição \"Projetor em janela (prévia)\". O conteúdo central da tela está predominantemente preto, com a mensagem \"Fim da apresentação de slides. Clique para sair.\", indicando que a parte expositiva da aula por meio de slides foi concluída e a sessão pode estar na fase de perguntas e respostas ou discussão.\n\nNo canto inferior direito da tela principal, sobreposto ao fundo preto, é visível o rodapé de um slide anterior ou um template padrão da universidade:\n*   \"Universidade de Brasília\"\n*   \"Departamento de Ciência da Computação\"\n*   \"OAC0000 - Organização e Arquitetura de Computadores\"\n*   \"Prof. Marcus Vinícius Lamar\"\nEsta informação confirma o contexto acadêmico, a instituição (Universidade de Brasília), o departamento (Ciência da Computação), a disciplina (OAC0000 - Organização e Arquitetura de Computadores) e o docente responsável (Prof. Marcus Vinícius Lamar), que é visível em vídeo no canto inferior direito da tela.\n\n**Análise de Diagramas e Código:**\nNão há diagramas (Datapath, Pipeline, Hierarquia de Memória) visíveis neste slide. Também não há blocos de código (Assembly, C, Verilog) formalmente apresentados. No entanto, os valores hexadecimais \"64\", \"a0\", \"f0\", \"fa0\" e a discussão sobre \"trocar a ordem\" no chat, juntamente com a aba do navegador mencionando \"x86 Instruction Set\", sugerem uma discussão que envolve diretamente aspectos de baixo nível da arquitetura, como endereçamento de memória, manipulação de registradores ou o comportamento de instruções de máquina. A menção de \"acesso mais devagar\" e \"gasta t de processamento\" aponta para discussões sobre desempenho do sistema, hierarquia de memória (caches, RAM), latência e otimizações, tópicos fundamentais em Arquitetura de Computadores.\n\n**Conclusão para RAG:**\nEste artefato de aula de Arquitetura de Computadores da Universidade de Brasília, ministrada pelo Prof. Marcus Vinícius Lamar, foca na interação pós-apresentação de slides. O conteúdo visível e transcrito inclui referências a tópicos técnicos como o conjunto de instruções x86, representação hexadecimal de dados ou endereços, e discussões sobre desempenho e otimização de acesso (e.g., \"acesso mais devagar\", \"gasta t de processamento\"). O chat serve como um repositório de perguntas e comentários que complementam o material da aula, oferecendo insights sobre as dificuldades e os pontos de interesse dos alunos em relação à disciplina. A ausência de diagramas explícitos no slide atual não invalida a riqueza de contexto técnico inferível das interações e títulos.",
        "transcription": "A imagem representa uma interface de uma sala de aula virtual em uma plataforma de conferência web, intitulada \"Sala de Aula de OAC\", sugerindo uma disciplina de Organização e Arquitetura de Computadores. No canto superior esquerdo do navegador, uma aba parcial exibe \"ADD: ADD (x86 Instruction Set Re\", indicando que um tópico relacionado ao conjunto de instruções x86, especificamente a instrução `ADD`, foi ou está sendo abordado na aula.\n\nO painel lateral esquerdo exibe as seções \"MENSAGENS\", \"NOTAS\" e \"USUÁRIOS (23)\". Na seção de mensagens, designada como \"Bate-papo público\", são observadas interações entre alunos e o professor. As mensagens incluem:\n\n*   **Eduarda Cos...:** \"Nesse caso, torço para consiga fazer tudo até segunda\" (13:53)\n*   **Michel Luis Duwe:** \"sim kkk\" (13:53)\n*   **João Alberto Travas...:** \"boa tarde Prof Lamar\" (14:00)\n*   **Maycon Vinnycius S...:** \"64\" (14:11)\n*   **Maycon Vinnycius S...:** \"só trocar a ordem\" (14:14)\n*   **Eduardo Ferreira M...:** \"esqueci de perguntar sobre a eleição do representante do CIC/IE\" (14:17)\n*   **Maycon Vinnycius S...:** \"a0 acho\" (14:21)\n*   **Eduardo Ferreira M...:** \"f0\" (14:22)\n*   **Eduardo Ferreira M...:** \"fa0\" (14:22)\n*   **Victor Hugo Rodrig...:** \"Acesso mais devagar?\" (14:25)\n*   **João Alberto Travas...:** \"gasta t de processamento\" (14:25)\n*   **João Alberto Travas...:** \"ob prof\" (14:25)\n*   **João Alberto Travas...:** \"jóia\" (14:28)\nA caixa de entrada do chat exibe \"Enviar mensagem para B\", indicando a funcionalidade de envio de mensagens.\n\nNa área principal da tela, um temporizador de gravação indica \"29:58\". Uma janela flutuante exibe \"Marcus Vinicius Lam...\" com a descrição \"Projetor em janela (prévia)\". O conteúdo central da tela está predominantemente preto, com a mensagem \"Fim da apresentação de slides. Clique para sair.\", indicando que a parte expositiva da aula por meio de slides foi concluída e a sessão pode estar na fase de perguntas e respostas ou discussão.\n\nNo canto inferior direito da tela principal, sobreposto ao fundo preto, é visível o rodapé de um slide anterior ou um template padrão da universidade:\n*   \"Universidade de Brasília\"\n*   \"Departamento de Ciência da Computação\"\n*   \"OAC0000 - Organização e Arquitetura de Computadores\"\n*   \"Prof. Marcus Vinícius Lamar\"\nEsta informação confirma o contexto acadêmico, a instituição (Universidade de Brasília), o departamento (Ciência da Computação), a disciplina (OAC0000 - Organização e Arquitetura de Computadores) e o docente responsável (Prof. Marcus Vinícius Lamar), que é visível em vídeo no canto inferior direito da tela.\n\n**Análise de Diagramas e Código:**\nNão há diagramas (Datapath, Pipeline, Hierarquia de Memória) visíveis neste slide. Também não há blocos de código (Assembly, C, Verilog) formalmente apresentados. No entanto, os valores hexadecimais \"64\", \"a0\", \"f0\", \"fa0\" e a discussão sobre \"trocar a ordem\" no chat, juntamente com a aba do navegador mencionando \"x86 Instruction Set\", sugerem uma discussão que envolve diretamente aspectos de baixo nível da arquitetura, como endereçamento de memória, manipulação de registradores ou o comportamento de instruções de máquina. A menção de \"acesso mais devagar\" e \"gasta t de processamento\" aponta para discussões sobre desempenho do sistema, hierarquia de memória (caches, RAM), latência e otimizações, tópicos fundamentais em Arquitetura de Computadores.\n\n**Conclusão para RAG:**\nEste artefato de aula de Arquitetura de Computadores da Universidade de Brasília, ministrada pelo Prof. Marcus Vinícius Lamar, foca na interação pós-apresentação de slides. O conteúdo visível e transcrito inclui referências a tópicos técnicos como o conjunto de instruções x86, representação hexadecimal de dados ou endereços, e discussões sobre desempenho e otimização de acesso (e.g., \"acesso mais devagar\", \"gasta t de processamento\"). O chat serve como um repositório de perguntas e comentários que complementam o material da aula, oferecendo insights sobre as dificuldades e os pontos de interesse dos alunos em relação à disciplina. A ausência de diagramas explícitos no slide atual não invalida a riqueza de contexto técnico inferível das interações e títulos.\n\nBeleza.",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 7,
        "timestamp_start": 1792.39,
        "timestamp_end": 1802.39,
        "slide_description": "Como Engenheiro de Computação Sênior, procedo com a análise do slide e do conteúdo anotado apresentado em uma aula de Arquitetura de Computadores.\n\nO conteúdo principal exibido é um documento do Microsoft Word intitulado \"OAC_A_Plano_2021-2_v0\", que representa o plano de curso ou cronograma da disciplina de Organização e Arquitetura de Computadores (OAC). O documento é estruturado como uma tabela, detalhando a progressão do curso em semanas, com datas específicas e os tópicos abordados.\n\n**Transcrição e Descrição do Conteúdo Visual:**\n\nO documento apresenta um plano de ensino dividido por semanas e tópicos, com referências a capítulos (C), aulas teóricas (T) e laboratórios (L). A estrutura é a seguinte:\n\n*   **Linha 1 (Semana de 24/1 a 26/1):**\n    *   Tópico 2: Desempenho: Fatores (C.1)\n    *   Tópico 3: Desempenho: Medidas (C.1)(T_1)\n*   **Linha 2 (Semana de 31/1 a 2/2):**\n    *   Tópico 4: Linguagem de Máquina: ISA (C.2) (ISA - Instruction Set Architecture)\n    *   Tópico 5: Linguagem de Máquina: Assembly (C.2)(T_2)\n*   **Linha 3 (Semana de 7/2 a 9/2):**\n    *   Tópico 6: Linguagem de Máquina: Procedimentos (C.2)\n    *   Tópico 7: Linguagem de Máquina: Recursividade e I/O (C.2)(T_3)\n*   **Linha 4 (Semana de 14/2 a 16/2):**\n    *   Tópico 8: Aritmética Computacional: Inteiros (C.3)\n    *   Tópico 9: Aritmética Computacional: ULA (C.3)(T_4) (ULA - Unidade Lógica e Aritmética)\n*   **Linha 5 (Semana de 21/2 a 23/2):**\n    *   Tópico 10: Aritmética Computacional: Fracionários, IEEE 754 (C.3)\n    *   Tópico 11: Outras Arquiteturas (T_5)\n*   **Linha 6 (Semana de 28/2 a 2/3):**\n    *   Indica um FERIADO\n    *   Lab 1A: Software – Rars (T_6) (Rars é um simulador de MIPS Assembly)\n*   **Linha 7 (Semana de 7/3 a 9/3):**\n    *   Lab 1B: Software – Compilador C\n    *   Lab 2: Hardware – Verilog – ULA (T_7) (Verilog é uma Hardware Description Language - HDL)\n*   **Linha 8 (Semana de 14/3 a 16/3):**\n    *   Avaliação: 1ª Prova (P1)\n    *   Tópico 12: Processador Uniciclo: Unidade Operativa (C.4) (T_8)\n*   **Linha 9 (Semana de 21/3 a 23/3):**\n    *   Tópico 13: Processador Uniciclo: Unidade de Controle (C.4) (L_1)\n    *   Lab 3: Processador Uniciclo (T_9) (L_2)\n*   **Linha 10 (Semana de 28/3 a 30/3):**\n    *   Tópico 14: Processador Multiciclo: Unidade Operativa (C.4)\n    *   Tópico 15: Processador Multiciclo: Unidade de Controle (C.4) (T_10)\n*   **Linha 11 (Semana de 4/4 a 6/4):**\n    *   Lab 4: Processador Multiciclo\n    *   Tópico 16: Processador Pipeline: Conceitos (C.4)(L_3)\n*   **Linha 12 (Semana de 11/4 a 13/4):**\n    *   Tópico 17: Pipeline: Unidade Operativa e Controle (C.4)\n    *   Lab 5: Processador Pipeline (T_12)\n*   **Linha 13 (Semana de 18/4 a 20/4):**\n    *   Tópico 18: Exceção e Interrupção (C.4) (L_4)\n    *   Tópico 19: Memória: Hierarquia (C.5) (T_13)\n*   **Linha 14 (Semana de 25/4 a 27/4):**\n    *   Tópico 19.1: Memória: Cache (C.5)\n    *   Avaliação: 2ª Prova (P2) (L_5)\n*   **Linha 15 (Semana de 2/5 a 4/5):**\n    *   Avaliação: Prova Substitutiva\n    *   Avaliação: Apresentação dos Projetos (P_N) (T_15)\n\n**Diagramas:**\nO slide não exibe diagramas visuais diretamente. Contudo, os tópicos listados (\"Processador Uniciclo: Unidade Operativa\", \"Processador Uniciclo: Unidade de Controle\", \"Processador Multiciclo\", \"Processador Pipeline\", \"Memória: Hierarquia\", \"Memória: Cache\") indicam que esses conceitos, frequentemente representados por diagramas de datapath e controle, bem como hierarquias de memória, serão abordados ao longo do curso. A menção a \"Unidade Operativa\" e \"Unidade de Controle\" para processadores uniciclo e multiciclo, e \"Pipeline\", sugere a análise detalhada da arquitetura de CPU, incluindo a descrição de estágios de pipeline (IF, ID, EX, MEM, WB) e o fluxo de dados e controle. A hierarquia de memória, incluindo cache, implica a discussão sobre níveis de cache (L1, L2, L3), políticas de substituição e mapeamento, e seu impacto no desempenho.\n\n**Conteúdo Adicional:**\nÀ esquerda, há uma janela de chat intitulada \"Bate-papo público\", com mensagens de alunos interagindo com o professor ou entre si, algumas delas contendo questionamentos sobre o andamento da aula ou temas administrativos. O professor, Marcus Vinicius Lamar, é visível na parte inferior direita da tela, aparentemente apresentando o material.\n\nEm resumo, o slide fornece uma visão detalhada do plano de estudos de uma disciplina de Arquitetura de Computadores, cobrindo tópicos fundamentais desde o desempenho do sistema, conjunto de instruções (ISA), linguagem Assembly, aritmética computacional (inteiros, ponto flutuante, ULA), arquiteturas de processadores (uniciclo, multiciclo, pipeline), até gerenciamento de memória (hierarquia, cache) e tratamento de exceções. A inclusão de laboratórios com Rars (Assembly MIPS) e Verilog (descrição de hardware) denota uma abordagem prática para a compreensão dos conceitos teóricos.",
        "transcription": "Depois vocês leem as conclusões. Então vamos para a aulinha de hoje. Para a aulinha de hoje então já que a gente acabou de ver a arquitetura RISC-V",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 8,
        "timestamp_start": 1802.39,
        "timestamp_end": 1804.39,
        "slide_description": "Como Engenheiro de Computação Sênior, procedo com a análise do slide e do contexto da aula de Arquitetura de Computadores, conforme solicitado.\n\nA imagem apresenta uma tela de conferência web em tempo real, indicando uma aula online. No topo, há o título \"ConferênciaWeb - Sala de Aula de OAC\" (onde OAC provavelmente significa Organização e Arquitetura de Computadores) e um temporizador exibindo \"30:09\". O professor, identificado como Marcus Vinicius Lamar, está visível em um feed de webcam no canto inferior direito da tela.\n\nO conteúdo central da apresentação, que seria o slide em tela cheia, não está diretamente visível. Em vez disso, o professor está compartilhando a área de trabalho do Windows, que exibe um papel de parede com o logo da \"Universidade de Brasília\", \"Departamento de Ciência da Computação\", e a menção ao \"Prof. Marcus Vinicius Lamar\".\n\nNa barra de tarefas inferior, há pré-visualizações de duas apresentações em PowerPoint abertas:\n1.  **\"OAC_10_Aritmética_Fracionária_.pptx\"**: Este arquivo sugere que o conteúdo programático anterior ou adjacente à aula atual aborda tópicos de representação numérica fracionária em sistemas computacionais. Isso tipicamente inclui Aritmética de Ponto Fixo e Ponto Flutuante (normas IEEE 754), conversões, precisão, e o impacto dessas representações em operações aritméticas. Embora o conteúdo específico do slide em miniatura não seja legível, a temática é fundamental para a compreensão de cálculos em arquiteturas.\n2.  **\"OAC_11_Outras_Arquiteturas_a.pptx\"**: Este é o arquivo que está atualmente selecionado (indicado por um cursor de mouse em forma de seta vermelha sobre ele). O título indica um foco em \"Outras Arquiteturas\", o que, no contexto de Arquitetura de Computadores, pode abranger uma vasta gama de tópicos para além das arquiteturas clássicas Von Neumann ou Harvard. Potenciais subtópicos incluem:\n    *   **Arquiteturas Paralelas**: SIMD (Single Instruction, Multiple Data) como GPUs, MIMD (Multiple Instruction, Multiple Data) como sistemas multiprocessados ou multicore.\n    *   **Arquiteturas Específicas**: VLIW (Very Long Instruction Word), EPIC (Explicitly Parallel Instruction Computing), processadores vetoriais, FPGAs (Field-Programmable Gate Arrays).\n    *   **Sistemas Distribuídos**: Conceitos de cluster computing ou grid computing, embora menos provável para uma aula introdutinal de arquitetura.\n    *   **Hierarquias de Memória Avançadas**: Organização de cache multi-nível, memória não-uniforme (NUMA), ou memórias especializadas (e.g., HBM).\n    A miniatura deste slide exibe o que parece ser um diagrama de blocos com interconexões, possivelmente ilustrando componentes de uma arquitetura específica ou o fluxo de dados entre diferentes unidades de processamento ou memória. Não é possível discernir detalhes textuais ou simbólicos do diagrama devido à sua baixa resolução na pré-visualização.\n\nNo lado esquerdo da interface de conferência, há um painel de chat público (\"Bate-papo público\") com várias mensagens trocadas entre alunos e, possivelmente, o professor. Partes legíveis das mensagens incluem:\n*   \"Nesse caso, torço para consiga fazer tudo até segunda\" (Eduardo)\n*   \"sim kkk\" (Michel Luis Duwe)\n*   \"boa tarde Prof Lamar\" (João Alberto Travas)\n*   \"64\" (Maycon Vinnycys S...) – Este número pode ser uma resposta a uma pergunta, talvez sobre largura de barramento, quantidade de registradores, ou um valor de dado.\n*   \"só trocar a ordem\" (Maycon Vinnycys S...) – Sugere uma discussão sobre sequenciamento de instruções ou organização de dados.\n*   \"esqueci de perguntar sobre a eleição do representante do CIC/IE\" (Eduardo Ferreira M...) – Uma questão administrativa.\n*   \"a0 acho\", \"f0\", \"fa0\" (Maycon Vinnycys S..., Eduardo Ferreira M...) – Estes podem ser valores em hexadecimal, referências a endereços de memória, registradores, ou identificadores de algum tipo.\n*   \"Acesso mais devagar?\" (Victor Hugo Rodrig...) – Possível discussão sobre latência de memória, velocidade de E/S, ou gargalos de performance.\n*   \"gasta t de processamento\" (João Alberto Travas...) – Corrobora a discussão sobre performance ou custo computacional.\n*   \"ob prof\", \"jóia\" (João Alberto Travas) – Fechamento de uma interação.\n\nEm resumo, a aula de Arquitetura de Computadores, ministrada pelo Prof. Marcus Vinicius Lamar da Universidade de Brasília, está em um ponto de transição entre os tópicos de Aritmética Fracionária e \"Outras Arquiteturas\". A discussão no chat sugere engajamento dos alunos com conceitos que podem envolver representação numérica, sequenciamento de operações e aspectos de performance, elementos cruciais para a compreensão de arquiteturas de computadores modernas e especializadas. O próximo tópico de \"Outras Arquiteturas\" é de alta relevância para sistemas de busca semântica, indicando que o conteúdo pode descrever modelos de computação além do paradigma uniprocessador, como paralelismo e aceleradores.",
        "transcription": "Vamos ver, então.",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 9,
        "timestamp_start": 1804.39,
        "timestamp_end": 1814.39,
        "slide_description": "Como Engenheiro de Computação Sênior, analiso o slide e o contexto anotado da aula de Arquitetura de Computadores.\n\nO ambiente visual representa uma plataforma de conferência web ou aula online, com foco em uma sessão de \"Sala de Aula de OAC\" (Arquitetura de Computadores).\n\n1.  **Transcrições de Texto:**\n\n    *   **Abas do Navegador:** \"ConferênciaWeb - Sala de Au\", \"ADD ADD (x86 Instruction Set Re\" (parcialmente visíveis).\n    *   **Painel Esquerdo (Navegação/Ferramentas):**\n        *   **MENSAGENS**\n            *   Perguntas\n            *   Bate-papo pú... (selecionado)\n        *   **NOTAS**\n            *   Notas comparti...\n        *   **USUÁRIOS (23)**\n            *   Marcus... (Você)\n            *   Andre Carval...\n            *   Arthur Brasa ...\n            *   Bruno Vargas...\n            *   Eduardo Ferr...\n            *   Felipe Dantas...\n            *   Filipe de Sou...\n            *   Gabriel Kenji...\n            *   Gustavo Lope...\n            *   Gustavo Pierr...\n            *   Gustavo Rodr...\n    *   **Painel de Bate-papo (Bate-papo público):**\n        *   **Título:** `< Bate-papo público`\n        *   **Mensagens (com remetente e timestamp):**\n            *   Ed: \"Nesse caso, torço para consiga fazer tudo até segunda\"\n            *   Michel Luis Duwe: \"sim kkk\" (13:53)\n            *   João Alberto Travas...: \"boa tarde Prof Lamar\" (14:00)\n            *   Maycon Vinnycius S...: \"64\" (14:11)\n            *   Maycon Vinnycius S...: \"só trocar a ordem\" (14:14)\n            *   Eduardo Ferreira M...: \"esqueci de perguntar sobre a eleição do representante do CIC/IE\" (14:17)\n            *   Maycon Vinnycius S...: \"a0 acho\" (14:21)\n            *   Eduardo Ferreira M...: \"f0\" (14:22)\n            *   Eduardo Ferreira M...: \"fa0\" (14:22)\n            *   Victor Hugo Rodrig...: \"Acesso mais devagar?\" (14:25)\n            *   João Alberto Travas...: \"gasta t de processamento\" (14:25)\n            *   João Alberto Travas...: \"ob prof\" (14:25)\n            *   João Alberto Travas...: \"jóia\" (14:28)\n        *   **Campo de entrada:** \"Enviar mensagem para B\" (parcialmente visível).\n    *   **Barra Superior (Controles da Sala):**\n        *   \"Sala de Aula de OAC\"\n        *   **Indicador de Gravação:** Círculo vermelho com \"30:10\" (tempo decorrido da gravação).\n        *   **Palestrante Ativo:** \"Marcus Vinicius Lam...\" (parcialmente visível).\n    *   **Barra Inferior (Controles de Mídia):** Ícones para microfone (ativo), fone de ouvido (ativo), câmera (inativo/riscado), e chat (ativo).\n\n2.  **Diagramas, Estrutura e Fluxo de Dados:**\n\n    *   A área principal de exibição do conteúdo da aula encontra-se completamente vazia e escura. Não há diagramas de Datapath, Pipeline, Hierarquia de Memória, código (Assembly, C, Verilog) ou qualquer outro conteúdo visual técnico relevante à Arquitetura de Computadores sendo apresentado neste momento no slide.\n    *   O foco visual está unicamente na interface da plataforma de conferência, que inclui o painel de usuários e, predominantemente, o painel de chat com as interações textuais dos participantes.\n\n3.  **Análise do Conteúdo para RAG:**\n\n    O slide captura um momento de interação assíncrona ou secundária à apresentação principal da aula. Embora não haja conteúdo técnico visual direto na tela principal, o chat fornece metadados e possíveis tópicos de discussão:\n\n    *   **Identificação do Curso:** Arquitetura de Computadores (OAC).\n    *   **Professor Mencionado:** Prof Lamar.\n    *   **Tópicos Implícitos/Questões:**\n        *   \"64\" (pode referir-se a arquitetura de 64 bits, valores numéricos, endereçamento).\n        *   \"só trocar a ordem\" (pode indicar reordenação de instruções, pipeline, bytes em memória – endianness).\n        *   \"f0\", \"fa0\" (possíveis referências a registradores em arquiteturas RISC como MIPS ou RISC-V, ou valores hexadecimais).\n        *   \"Acesso mais devagar?\", \"gasta t de processamento\" (discussões sobre desempenho, latência de memória, custo computacional).\n        *   \"eleição do representante do CIC/IE\" (contexto administrativo ou institucional da aula).\n    *   **Estado da Aula:** Gravação em andamento (30:10), indicando uma parte de uma aula maior. O conteúdo visual da apresentação está ausente no momento da captura.\n\nPara um sistema RAG, este slide contribui com o contexto de comunicação e interação dos alunos em uma aula de Arquitetura de Computadores, mencionando tópicos técnicos de forma breve no chat, mas sem apresentar o material instrucional visual primário.",
        "transcription": "outras arquiteturas. Que outras arquiteturas? Mais especificamente ARM e x86.",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 10,
        "timestamp_start": 1816.39,
        "timestamp_end": 1906.39,
        "slide_description": "Como Engenheiro de Computação Sênior, a análise do slide da aula de Arquitetura de Computadores revela o seguinte conteúdo para um sistema de busca semântica:\n\nO slide é intitulado \"Aula 11: Arquiteturas ARMv7 e x86\", com a especificação \"32 Bits\", indicando um foco inicial nas versões de 32 bits dessas arquiteturas de conjunto de instruções. A afiliação institucional é claramente visível, sendo a \"Universidade de Brasília\", do \"Departamento de Ciência da Computação\", com a menção de que a aula faz parte da disciplina \"CIC0003 - Introdução aos Sistemas Computacionais\", ministrada pelo \"Prof. Marcus Vinicius Lamar\".\n\nA seção principal do slide apresenta uma comparação direta sob o título \"ARM VS x86\".\n1.  **ARM (lado esquerdo):** É categorizado como uma arquitetura \"RISC\" (Reduced Instruction Set Computer). Acompanhando o texto, há uma colagem de imagens de diversos dispositivos tipicamente alimentados por processadores ARM, como smartphones, tablets, um mini-PC (possivelmente um single-board computer como Raspberry Pi) e outros dispositivos embarcados ou móveis, ilustrando sua prevalência em segmentos de baixo consumo de energia e alto volume.\n2.  **x86 (lado direito):** É categorizado como uma arquitetura \"CISC\" (Complex Instruction Set Computer). As imagens associadas ao x86 mostram componentes de computadores de mesa e laptops, incluindo CPUs Intel (identificáveis pela marca Intel), módulos de memória, placas-mãe, e uma torre de computador de mesa, destacando sua dominância no mercado de desktops e servidores de propósito geral.\n\nO conteúdo do bate-papo público, embora informal, oferece insights sobre os tópicos de discussão paralelos ou perguntas dos alunos:\n*   **\"64\" (14:11):** Sugere uma discussão ou questionamento sobre a transição ou comparação com arquiteturas de 64 bits, o que é um tema natural ao abordar ARM e x86, mesmo quando o slide foca em 32 bits.\n*   **\"só trocar a ordem\" (14:14):** Pode referir-se a conceitos como reordenação de instruções (out-of-order execution), ordenação de bytes (endianness) ou ordem de acesso à memória, todos pertinentes à microarquitetura e organização de computadores.\n*   **\"f0\", \"fa0\" (14:22):** São valores hexadecimais que poderiam representar endereços de memória, valores de registradores, ou mesmo partes de opcodes em exemplos de Assembly, indicando uma discussão técnica detalhada.\n*   **\"Acesso mais devagar?\" (14:25):** E a resposta subsequente \"gasta t de processamento\" (gasta tempo de processamento) indicam um diálogo sobre desempenho, latência de acesso à memória, ou gargalos de processamento, aspectos cruciais na análise comparativa de arquiteturas.\n\nEm resumo, o slide aborda fundamentalmente a comparação entre as arquiteturas ARMv7 (RISC) e x86 (CISC) no contexto de 32 bits, ilustrando seus domínios de aplicação e características gerais, complementado por uma interação de alunos que toca em tópicos avançados como 64 bits, reordenação, valores de registradores/endereços e implicações de desempenho.",
        "transcription": "ARM e x86. O ARM, tirando desse ano que eles lançaram uma versão v9 da arquitetura ARM, até o ano passado o ARM existia a versão v7 e a versão v8. A versão v7 era de 32 bits e a v8 era de 64 bits. Nesse ano eles lançaram uma nova versão v9 que eu ainda não estudei. Então vamos falar só dessas outras duas versões que existiam até o ano passado. Continuam existindo, só que eles lançaram uma versão nova. A arquitetura ARM. E como a gente está trabalhando com 32 bits, a gente vai ver só a v7, a gente não vai ver a v8. Para a gente poder comparar diretamente um processador ARM com o nosso RISC-V de 32 bits. Assim como o x86. O x86 mesmo é de 32 bits. E o x64 e o... eu sempre me confundo com essa sigla. Especialmente me confundo com o x64 que é o nome da ISA 64 bits do x86. Mas não vai crer. A gente vai ver alguns aspectos do x86 original. Precisamente isso que prevalecia naquele tempo em que a Intel adotou a prática de retrocompatibilidade. Portanto, tudo que a gente vê aqui dos processadores também é obsoleto.",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 11,
        "timestamp_start": 1908.39,
        "timestamp_end": 7019.01,
        "slide_description": "O slide de uma aula de Arquitetura de Computadores, da disciplina \"UnB - CIC0099 – Organização e Arquitetura de Computadores\" ministrada pelo Prof. Marcus Vinicius Lamar, foca nas \"Diferenças: Instruções com condição\".\n\nO conteúdo textual principal na lateral esquerda explica que \"A maior parte das instruções da ISA ARMv7 são condicionais\". Complementa que \"Isto é, possuem 4 bits (cond) que determinam se a instrução deve ser executada ou não, dependendo dos bits ZNCV do registrador CPSR.\"\n\nO elemento central do slide é a \"Table A8-1 Condition codes\", que detalha as condições de execução para instruções. A tabela é composta por cinco colunas:\n1.  **cond**: Representa o código binário de 4 bits para a condição.\n2.  **Mnemonic extension**: A extensão mnemônica textual usada na instrução.\n3.  **Meaning (integer)**: O significado da condição para operações com inteiros.\n4.  **Meaning (floating-point) a**: O significado da condição para operações de ponto flutuante (com uma nota de rodapé \"a\").\n5.  **Condition flags**: As combinações específicas dos bits de flag (Z, N, C, V) no registrador CPSR que devem ser verdadeiras para que a condição seja atendida.\n\nAs linhas da tabela descrevem 15 condições distintas e uma condição incondicional:\n*   **0000 EQ**: Equal (Igual), para inteiros e ponto flutuante, quando `Z == 1`.\n*   **0001 NE**: Not equal (Não igual), para inteiros e ponto flutuante (ou não ordenado), quando `Z == 0`.\n*   **0010 CS b**: Carry set (Carry definido), para inteiros (Maior que, igual a, ou não ordenado para ponto flutuante), quando `C == 1`. (com nota de rodapé \"b\")\n*   **0011 CC c**: Carry clear (Carry limpo), para inteiros (Menor que para ponto flutuante), quando `C == 0`. (com nota de rodapé \"c\")\n*   **0100 MI**: Minus, negative (Menos, negativo), para inteiros e ponto flutuante, quando `N == 1`.\n*   **0101 PL**: Plus, positive or zero (Mais, positivo ou zero), para inteiros (Maior que, igual a, ou não ordenado para ponto flutuante), quando `N == 0`.\n*   **0110 VS**: Overflow (Estouro), para inteiros (Não ordenado para ponto flutuante), quando `V == 1`.\n*   **0111 VC**: No overflow (Sem estouro), para inteiros (Não ordenado para ponto flutuante), quando `V == 0`.\n*   **1000 HI**: Unsigned higher (Sem sinal maior), para inteiros (Maior que, ou não ordenado para ponto flutuante), quando `C == 1 and Z == 0`.\n*   **1001 LS**: Unsigned lower or same (Sem sinal menor ou igual), para inteiros (Menor ou igual para ponto flutuante), quando `C == 0 or Z == 1`.\n*   **1010 GE**: Signed greater than or equal (Com sinal maior ou igual), para inteiros e ponto flutuante, quando `N == V`.\n*   **1011 LT**: Signed less than (Com sinal menor), para inteiros (Menor que, ou não ordenado para ponto flutuante), quando `N != V`.\n*   **1100 GT**: Signed greater than (Com sinal maior), para inteiros e ponto flutuante, quando `Z == 0 and N == V`.\n*   **1101 LE**: Signed less than or equal (Com sinal menor ou igual), para inteiros (Menor que, igual a, ou não ordenado para ponto flutuante), quando `Z == 1 or N != V`.\n*   **1110 None (AL) d**: Always (unconditional) (Sempre, incondicional), para inteiros e ponto flutuante, aplica-se a `Any` (qualquer combinação de flags). (com nota de rodapé \"d\")\n\nO slide descreve um aspecto fundamental da arquitetura ARMv7, que é o controle de fluxo através de execução condicional de instruções, diferenciando-se de outras arquiteturas que podem usar principalmente branches condicionais. Não há diagramas visuais como datapath, pipeline ou hierarquia de memória. O foco é puramente textual e tabular, delineando as regras para a execução condicional baseada nos flags do processador.",
        "transcription": "Então a arquitetura ARMv7, originalmente, ela foi desenvolvida na década de 80 e visava uma arquitetura de baixo consumo. Então, foi muito popular em sistemas portáteis, celulares, tablets, sistemas GPS e um monte de outras coisas que utilizam ARM. Por que de baixo consumo? Foi produzida pela ARM Holdings, que era britânica. E eu não tenho certeza se isso aqui se concretizou ou não. Quer dizer, a ARM foi comprada pela Nvidia mesmo? Ou barraram essa compra devido a quebrar meio antitruste? Pelo que sei, tudo é da Disney, essa é boa. Tá? Eu acho que a Nvidia tentou comprar a ARM, mas eu acho que foi barrada por algum desses conselhos financeiros internacionais. Porque senão a Nvidia ia ficar com um monopólio muito grande. O preço era 40 bilhões. Daí por isso que eu botei esse nome de continuação, porque eu não sabia se até hoje tinha sido concretizado isso ou não. Mas pelo visto não. ARM significa Acorn. Acorn RISC Machine. O nome de Acorn era o nome da empresa, que mais tarde se transformou em Advanced RISC Machine. Porque Advanced é algo mais pra frente. Indicando que ele é mais avançado. Depois de 2020 eu preciso atualizar esses slides aqui, pelo amor de Deus. 6,7 bilhões de unidades vendidas em 2020. Enquanto isso, na mesma época, o x86 vendeu menos de 500 milhões de processadores. Então nota-se que aqui o volume de processadores vendidos é muito maior que esse aqui. Só que esse aqui tem um custo muito maior que esse. Certo? Que torna então os lucros aqui maiores. Então é de baixo consumo. A Intel tentou fazer uma arquitetura de baixo consumo que foi o Atom. Não deu certo. E agora a 12ª geração de processadores Core. Processadores Core. Eles estão pegando... Acho que eu já fiz isso pra vocês. A ideia do chip híbrido. A gente tem agora dentro do x86. Quatro processadores grandes e quatro processadores pequenos. Que é a mesma ideia que a ARM utiliza. Quatro processadores grandes e quatro processadores pequenos. De modo a se não estiver exigindo muito do computador, então usa os processadores pequenos, que economizam energia. Já quando você precisa de um maior poder de computação, de processamento, aí ele aciona os quatro maiores. Então a Intel com essa 12ª geração está tentando fazer coisas de baixo consumo. Ok. Então de baixo consumo. Custos acessíveis. Integrados a projetos proprietários. O que isso aqui significa? Significa que se você está desenvolvendo um chip, você pode colocar dentro dele um processador ARM. Desde que você pague royalties por aquele processador ARM. Então você pode ter um processador ARM dentro de um chip e mais um monte de outras coisas. Certo? Usados em Raspberry Pi, BeagleBone Black, PandaBoard e outros single-board computers. Então Raspberry Pi é... The Pi é por um ARM. E assim tem o BeagleBone Black também e vários outros sisteminhas. Só que em sistemas antigos. Quer dizer. Praticamente toda a circuitaria está aqui dentro, utilizando ARM. Ok. Vamos verificar então as semelhanças que existem entre o ARM e o RISC-V. E depois as diferenças. Então. Primeiro. O ARM foi lançado em 1975. Mas o desenvolvimento dele já vinha desde o início da década de 80. Enquanto o RISC-V é mais moderno. O desenvolvimento dele começou em 2010. E ele foi efetivamente lançado em 2015. Instruction Size. Quer dizer. O tamanho da instrução. Os dois têm instruções de 32 bits. Então isso aqui não é só o tamanho do registrador, é o tamanho da instrução também. Então os dois seguem a mesma filosofia. 32 bits para a instrução. O endereço de... O espaço de endereçamento, né. Já que a gente está trabalhando aqui com um de 32 bits. É 32 bits flat. Quer dizer. Eu consigo acessar a memória em qualquer um dos seus 4 giga endereços. Certo. Então isso que significa 32 bits flat. Meu processador consegue acessar qualquer elemento da memória de 4 giga. Então. Data align. Os dois requerem que os dados estejam alinhados. Quer dizer. Em outras palavras. Seria armazenados em endereços múltiplos de 4. Ou múltiplos de 2. Então. Eles necessitam que os dados estejam alinhados. Existem processadores que trabalham com dados não alinhados. Tem. Só que o hardware fica mais complicado. Bem mais complicado. Então eles preferiram simplificar. E exigir que os dados estejam alinhados. Addressing modes. Isso aqui nós vamos ver mais para frente. Mas só tem 3 básicos. O ARM tem 9. E aqui já começa a aparecer as diferenças entre o ARM e o RISC-V. Número de registradores. Então. O RISC-V tem 31 registradores. Porque o R0 não é bem registrador. Por isso que eles colocam 31. E. De 32 bits. Enquanto aqui tem 15 registradores de general purpose register. GPR. Então. Registrador de propósito geral. Então. Também. Isso aqui é metade do número de registradores que tem o RISC-V. E. I/O. Os dois são memory mapped. Quer dizer. Se eu quero acessar um dispositivo de I/O. Eu vou acessar um endereço da memória. Só que naquele endereço da memória. Tem o meu dispositivo lá. Certo. O ARMv8 é muito mais similar ao RISC-V 64 e ao MIPS64 do que o V7 com o RISC-V 32. Que é o que a gente está vendo aqui. V7. E o RISC-V 32. Já sei. Olha só. Isso aqui era um dos livros do Patterson. Comparando o ARM com o MIPS. Essa figurinha aqui. Patterson também comete erros. Principalmente em livros. Em geral. Ok. Exemplo de instruções. Então. Para o ARM e para o RISC-V. Então. Para a adição. O ARM tem o ADD. E o RISC-V. A gente tem o ADD. E o ADDI. O RISC-V. O ARM tem o ADD que detecta overflow. Que é o ADDS. Certo. Então. Esse ADDS. Ele detecta se aconteceu overflow. O RISC-V não tem isso. O RISC-V não detecta overflow. Subtração. SUB. Subtração. Com... Com... Com... Com... Com... Com... Multiplicação. Ele tem o MUL. E nós temos aqui. Né. O MUL e o MULH. Divisão. O ARM não tem. Divisão inteira. Isso aqui é interessante. Certo. Por que. Nós vamos ver no laboratório. Que a implementação desse DIV, DIVU aumenta muito a complexidade do circuito. Aumenta muito. Então, o RISC-V tem o DIV e o DIVU. E aqui, Square Root, igual, muito. Só tem o RISC-V, o ARM não tem. Os shifts lógicos e aritméticos, nós temos similares também. Comparação, o ARM tem instrução de comparação mesmo e de testes. E a gente tem aqui os SETs da vida. Acesso à memória. Então, tem os Load Byte, Load Halfword, Load Word, tal qual a gente tem aqui também. Nesse caso aqui, leitura e escrita em registradores especiais. Aqui eles têm essas instruções e a gente vai ter as instruções CSR, que nós vamos ver mais adiante, quando a gente vê interrupções e exceções. Aí a gente vai ver essas instruções CSR. E atomic exchange, que é para quando tem múltiplos núcleos acessando a memória. Então, a gente tem instruções que previnem dois processadores estarem querendo escrever, quer dizer, acessar um determinado endereço de memória ao mesmo tempo. Então, tanto o ARM quanto o RISC-V, a gente tem instruções que se tu tentar ler e o outro está escrevendo, esse aqui vai esperar esse aqui acabar de escrever para então ler. E a mesma coisa, se esse aqui está lendo e se ele quiser escrever, ele vai esperar esse aqui acabar de ler para depois escrever naquela posição. Então, é o que se chama de instruções atômicas. Modos de endereçamento. RISC-V, a gente só tem esses três modos aqui. Então, quais são eles? Operando no registrador. Segundo, o operando é imediato. Terceiro, o operando está na memória, nesse endereço aqui. Registrador, mais um offset e um registrador aqui. Registrador de base. Certo? Então, no RISC-V, a gente só tem esses três. No ARM, a gente ainda tem esses três. No ARM, a gente ainda tem esses três. Tem todos esses outros aqui. Então, vamos só entender o que é. É um registrador, mais um registrador indexado. O que isso aqui significa? Que eu posso estar somando aqui quantos registradores. Registrador 0, registrador 1, registrador 2, registrador 3. Selecionando isso através do índice do registrador. Então, o endereço vai ser dado por esse registrador, mais esse outro registrador aqui. Registrador, mais um registrador escalado. O que isso significa? Que tu pode ter o teu endereço de base no registrador. E tu tem um outro registrador, que vai ter um número, que tu vai poder escalar ele. Escalar significa o quê? Multiplicar por 2, multiplicar por 4, multiplicar por 8. E esse valor multiplicado, escalado, vai ser somado ao registrador original. Para identificar qual é o endereço que ele vai acessar. Registrador, mais um offset. Que seria igual a esse aqui, que só tem o displacement aqui. Então, registrador, mais um offset. E atualização do registrador. Quer dizer, eu vou acessar a memória nesse endereço registrador, mais um offset. E esse valor aqui vai ser atualizado nesse registrador. Eu vou, a mesma coisa aqui. Um registrador, mais outro registrador. Eu vou acessar o dado que está nesse endereço. E vou fazer update, atualizar esse registrador aqui. Quer dizer, calculo o endereço a partir dessa soma. Ao finalizar a leitura, ele vai escrever nesse registrador aqui, esse endereço para o qual ele leu. Autoincremento e autodecremento. Quer dizer, tem então, mais mais e menos menos. Que tem em Python e C. Então eles têm também. Então uma instrução que incrementa o registrador e decrementa o registrador. E outra coisa aqui. PC relative data. Quer dizer, um dado relativo ao PC. O que é PC? PC é o que mesmo? O que que tem no registrador PC? O que que tem no registrador PC? Alguém vai me dizer. Aí vai ser aquela que a resposta está correta. É, não é a próxima instrução. É a instrução que está sendo executada. Certo? Então, esse modo de endereçamento aqui que só tem no ARM. Ele vai pegar o endereço da instrução que está sendo executada. Somar com o offset. E a partir da instrução. O endereço da instrução. Somar o offset. E a partir desse novo endereço. Ele vai pegar o que tiver ali e considerar dado. Quer dizer, ele pode pegar o teu programa. E considerar como dado. Entenderam? A potencialidade disso aqui. Então, tu está lá no segmento de texto. E tu quer pegar, por exemplo, três instruções anteriores. E ler essa instrução e considerar essa instrução um dado. Esse modo de endereçamento ali. Que ele permite fazer isso. Ok. Então, notem. O ARM possui bem mais complexidades do que o RISC-V. Tudo isso aqui, pessoal. Dessa aula de hoje. Eu quero que vocês entendam. Eu não quero que vocês decorem isso aqui. Eu quero que vocês entendam a filosofia geral. Quer dizer, existem mais coisas que podem ser feitas. Do que simplesmente aquilo que está no RISC-V. Olha só. Ok. Outras diferenças. São os modos da CPU. A gente já viu. Que a CPU que o RISC-V permite o Machine Mode, Supervisor Mode e User Mode. Decora. Confira. A gente viu isso aqui. Acho que nós vimos. Machine Mode, Supervisor Mode e User Mode. Vocês se lembram de terem visto isso aqui no curso? Ouvi-lo falar. Eu não me lembro mesmo. A gente já viu isso. Em algum outro ponto. Mais ou menos. Não. User Mode, mais ou menos. Então, vamos lá. Então, não. Então, o RISC-V possui três modos de operação. O Machine Mode. Que seria o modo mais privilegiado. Que é o que ele chama de Bare Metal. Bare Metal significa. Colocar o teu programa. Para ser rodado. No processador. Sem sistema operacional. Quer dizer. O processador vai rodar o teu programa. E só o teu programa. Esse aqui é o modo. Que a gente roda. Por exemplo, o FPGA. É o modo que. No caso do RISC-V. Ele tem um micro sistema operacional por baixo. Então, não é bem Bare Metal. No caso do hardware. Ele só usa o User Mode. Ele não usa esses outros dois aqui. Tá. Mas. Antigamente. Quando a gente tinha aula de laboratório. Que a gente implementava. O RISC-V. No FPGA. Era esse modo que era otimizado. Então, só tinha o teu programa. Podendo rodar. Então, não tinha restrição nenhuma. Então, o teu programa. Tinha acesso. A tudo. De hardware. Que. Ele tinha disponível. O Supervisor Mode. É o modo privilegiado também. Só que é usado. Pelo kernel do sistema. Não é utilizado. Pelo kernel do sistema. Então. É o modo utilizado. Pelo sistema operacional. Ele possibilita. Acessar um monte. De outro tipo de coisas. Que o Machine Mode. Acessa. Mas tem algumas coisas. Que o Machine Mode. Acessa. Que o kernel. Não é permitido. Certo. Mas ele é. Bem mais. Livre. Do que o User Mode. Então. O User Mode. É um modo. Não privilegiado. Então. Tu não pode. Acessar. Nenhuma das instruções. Né. Então. Aqui. É um modo. Protegido. Para o usuário. Não fazer. Cacaca. No sistema. Certo. Então. Ele protege. O usuário. Encapsula. O usuário. Para que ele. Não faça. Besteira. Entendido. São esses três. Aqui. O ARM. Tá. O ARM. Ele tem. Um. Dois. Três. Quatro. Cinco. Seis. Sete. Então. Ele usa o User Mode daqui. Então. É um modo. Não privilegiado. Que é. Seguir. De se usar. Que. Tinha entendido. O modo. FIQ. É o. Fast. Interrupt. Request. Tá. Significa o quê. O que que é o. Interrupt. Request. É isso aqui. Interrupt. Request. Significa. Um. Dispositivo. Externo. Por exemplo. O. Teclado. Quer mandar. Uma. Teclado. Foi. Pressionado. E. Tá. Querendo. Mandar. Um. Código. Da. Tecla. Pressionada. Pro. Processador. E. O. Processador. Tá. Rodando. Né. Rodando. Programa. Daí. A. Interrupção. Que. Faz com. Que. O. Processador. Pare de. Executar. O. Que. Está. Fazendo. E. Vá. Atender. Aquela. Que. Aquela. Interrupção. Tá. Então. Por exemplo. Se. For. Uma. Tecla. Do. Teclado. Ele. Para. Uma. Interrupção. Só. Que. Com. Mais. Alta. Prioridade. Quer. Dizer. O. Processador. Está. Fazendo. O. Teclado. Que. Pede. Uma. Interrupção. Esse. Aqui. Primeiro. De. Terminar. De. Fazer. Esse. SVC. Tá. Que. É. Um. De. Chamada. Similar. Ao. Syscall. Quando. Tu. Chama. Uma. Rotinazinha. Usando. Syscall. Né. No. Isso. Que. Faz. Vai. Chamar. Uma. Rotina. Do. Sistema. Tá. Então. Ele. Vai. Executar. A. Rotina. Do. Sistema. Operacional. Só. Que. Nesse. Modo. Aqui. Abort. Mode. Quer. Dizer. Quando. Acontece. Alguma. Exceções. Que. Tem. Que. Abortar. Os. Dados. Que. Traz. Nesse. Modo. Aqui. É. Utilizado. Então. Pra. Escrever. Nos. Registradores. Que. Definem. Os. Modos. Que. É. O. CPSR. CPSR. E nós vamos ver somente nesse espaço. Ele não vai sair daquele espaço de memória que é o Não Secure. Certo. Então seria o modo do sistema operacional. Então notem que tem muito mais. Só que ele não tem o registrador zero. Aquele R0. Que possui sempre o número zero. Esse aqui não tem o registrador zero. Aqui é um registrador normal. O registrador. Então se tu escrever nesse registrador 15 um endereço. O que que vai acontecer? Se ele é o PC. Então meu programa vai lá escrever nesse registrador. Certo. Só que utilizando. Então. A escrita direto no PC. A gente não tem um que faz. Nosso PC não é acessível pelo programador. Assim. Ele é acessível nas instruções. Se descer. Abort. Define. O que. FIQ. São esses modos aqui. Para todos os modos de operação. Os registradores de 0 a 7. Esses 8 registradores aqui. São os mesmos. Se eu estiver no modo FIQ. Tá. Então. Eu estou lá. Tem um valor. Quando eu passo pro modo FIQ. Esse valor aqui é salvo. E eu tenho disponível aqui. Registradores específicos pra esse modo aqui. Então. Eu não tenho acesso mais a esses registradores. Eu tenho acesso a esses aqui. Complicado. Né. E. Em todos os modos registradores. Ah. SP e LR. Eu tenho R13 do SP e R14 do LR. Se eu tenho modo FIQ. Eu tenho R13 para FIQ. R14 para FIQ. Quer dizer. Eu tenho registradores. Né. Se eu estou no modo FIQ. No R13. Esse aqui. Se eu passar pro modo IRQ. No R13. É outro. E. Registrador 13 e 14. Geralmente. São utilizados como stack pointer e link register. Tá. O CPSR. Que ele possui tanto. Ah. Versões. Para cada um desses outros modos aqui. O que que é o CPSR? O aqui. Só registrador aqui assim. O que que é o CPSR? Então. CPSR. É o registrador de status. O que que ele controla? Ele aqui está indicando qual é o modo. Então, tem uma tabelinha para isso aqui. O bit 5 é o modo de codificação com 16 bits. Então, seria um modo compactado. Se aqui eu tenho um 1, significa que as minhas instruções não têm mais 32 bits, elas têm 16 bits de tamanho. Então, são instruções compactadas. A gente tem os dois bits de desabilitação das interrupções. Se eu não quero receber nenhuma interrupção, eu desabilito esses dois bits, de Interrupt Request e de Fast Interrupt Request. Então, permite-me controlar se eu quero receber interrupção ou não. Esse aqui eu não tenho ideia do que é. O bit E9, que é o bit 9, esse aqui, indica qual é o endianness, quer dizer, se está trabalhando em Big Endian ou Little Endian, então, vocês se lembram que tem processadores que trabalham em Big Endian, tem outros que trabalham em Little Endian. O ARM era um que só pode trabalhar nos dois modos. Então, dependendo desse bit de configuração aqui, eu certo se eu quero trabalhar com Big Endian ou Little Endian. Esse aqui é o divertido. Está o DNN. DNN. Simplesmente não modifique esses bits. Esse aqui é superinteressante, bit 24. Que é o bit que habilita o JAZZ. O que isso aqui faz? Então, o ARM, eles já programaram para celular? Faz curiosidade. Já programaram para celular, fizeram aplicativo para celular? Já? E ninguém nunca fez um appzinho lá de Hello World, pelo menos em um celular, para ver como isso funcionava? Ok, Gabriel. Ok. A linguagem básica, Flutter também, a linguagem básica de programação dos celulares é Java. Então, o que o fabricante pode fazer? O fabricante do chip, ele pode habilitar um modo que ele execute os bytecodes Java diretamente no celular. Quer dizer, diretamente no processador. Então, não sei se lembra do que estava. Vocês sabem como é que Java funciona? Não, né? Java. Já fizeram alguma coisa em Java? Ok, então como é que Java funciona? Você escreve o seu código, você compila ele, dá bytecode e depois você pega esse bytecode e roda em uma máquina virtual. Certo? A JVM. Máquina Virtual Java. E assim você roda o seu programa. Certo? A JVM. Máquina Virtual Java. Certo? A JVM. Máquina Virtual Java. Que é um programinha em Java. Então Java é livre. É meio compilado, meio interpretado. Então, o que que acontece? Nesse caso aqui para tu ir rodar programas em bytecode, Java, tu não precisa da máquina virtual. O próprio processador já executa o bytecode. O próprio processador já executa o bytecode. Então, isso aqui faz com que Java pode ir muito rapidamente nesse processador. Isso aqui faz com que Java possa rodar muito rapidamente nesse processador. Por isso que grande parte da... o RISC-V 32J está previsto, mas ninguém fez ainda isso aqui. Se ele ia fazer o RISC-V, ele ia rodar um bytecode Java. Então, reduz a compatibilidade? Não, porque isso aqui é um bit opcional. Certo? Tu habilita ele se tu quiser que ele faça isso. Por que Java? Boa pergunta! Não sei porque eles escolheram Java. Porque acho que nenhuma outra gera bytecode. Tem várias outras que geram bytecode sim, mas não entendo porque escolheram Java. Ok. Overflow, bits, adição... E nós temos esses quatro bits aqui. Esses quatro últimos bits. Esses quatro últimos bits vão indicar se aconteceu o overflow. Se aconteceu... Se aconteceu o carry out ou borrow. Quer dizer, vai 1 ou vem 1. Se o resultado é 0. E se o resultado é negativo. Tá? Então esses quatro funcionam como flags. Quer dizer, se a operação que tu estava fazendo deu overflow, esse bit vai ser ativado. Teve o vai 1 em final ou vem 1, o bit de carry é ativado. Resultado é 0, bit de zero é ativado. Resultado é negativo, o bit N é ativado. Bit N negativo. Então, devido a isso aqui, tá? Quem está nesse registrador de controle de status. O ARMv7 inovou, né? Fazendo com que todas as... Praticamente todas as instruções sejam condicionais. Como assim? Quer dizer, então a maior parte das instruções da ISA ARMv7 são condicionais. Porque eles definem uma condição, certo? Com base nesses bits aqui. Se a instrução deve ser executada ou não. Então, por exemplo, a condição 00 significa que é igual. Então, só simplesmente seta a condição, quer dizer. Vai verificar se o zero é 1. Se o zero é 1, se a última instrução for uma comparação. Então, isso aí significa que ele é igual. E assim, a gente tem várias outras condições mexendo nesses bits aqui. Tipo, de status. Que te permitem, ok, aconteceu overflow, não aconteceu overflow. Se foi menor que, se foi maior ou igual. Se foi negativo. Se teve carry. Então, a gente tem várias condições aqui. E essas condições vão ser utilizadas diretamente nas instruções. Por exemplo. Então, vamos ver aqui um exemplo aqui. Esse compare aqui, que a gente não tem. É como se fosse R0 menos R1. Ele compara esse registrador R0 com o registrador R1. Então, ele tem que fazer essa comparação. Então, esse aqui está implementando esse algoritmozinho aqui. Esqueci o nome dele. Esse aqui é um algoritmozinho famoso de cálculo MDC. Vocês lembram qual é o nome do carinha que inventou isso aqui? É um grego, não é? Não me lembro. Vocês não viram isso em nenhuma matéria, não? Cálculo do MDC por isso aqui? O que é MDC? Máximo Divisor Comum. Eita, parece que eu estou falando em grego. Então, ok. Então, o que esse algoritmozinho, essa funçãozinha aqui faz? Enquanto i for diferente de j. Se for maior que j. i recebe i menos j. Caso contrário, j recebe j menos i. E, enquanto isso aqui for diferente. Ele fica nesse loopzinho aqui, enquanto os dois forem diferentes. E, ao sair, quando os dois forem iguais. É porque em i tem o MDC desses dois números. Certo? Então, é um modo iterativo de se calcular o MDC. E eu acho que é melhor não ser assim. Eu só não tenho certeza se foi mesmo de outros níveis. Tá? Por coisa nenhuma. Então, é um algoritmo de Euclides. Deve ser isso aqui. Tá? E aqui é uma implementação no ARMv7. Aqui é a implementação no ARMv7. Aqui é a implementação no RISC-V. Tá? Desse algoritmo. Bom, a implementação do RISC-V. Vocês pegam isso aqui e comprimem para isso aqui direto. Tá? Então, a primeira coisa que eu tenho que verificar. Se i é diferente de j. Se i for diferente de j. Eu tenho que fazer isso aqui. Né? Se i for igual a j. Eu tenho que voltar. Então, esse aqui é o A0. Esse aqui é o A1. E esse aqui é o A0. Né? Então, a primeira coisa. O A0 é diferente do A1? A0 é diferente do A1? Se for diferente. Ele vem para cá. E faz esse loopzinho aqui. Fica nesse loopzinho. Se ele for diferente. Né? Então, eu vou pegar. Um. Um. Um. Um. Um. Um. Um. Um. Um. Um. Um. Um. Um. Um. Um. Um. forma falsa, se essa aqui é falsa é porque o a0 e a1 são iguais então não precisava fazer isso aqui compara aqui que essa linha aqui só vai ser executada ah não porque tem um loop aqui, desculpe tem esse loop aqui que pode dar problema também, não, então deixa assim então essa aqui é a compilação desse aqui e aqui a compilação no ARMv7 então o que é interessante chamar a atenção aqui ele compara se r0 e r1 são iguais r0 e r1 são i, j aqui se eles forem diferentes not equal ele vai pular do valor do registrador para o endereço que tiver no registrador LR, LR significa Link Register, aqui é o nosso RA, quer dizer se eles forem diferentes não, se eles forem diferentes LR me revolta então ele compara branch if not equal caso contrário, se ele for igual ele vai fazer uma subtração se o r0 for maior que r1 vai fazer essa subtração aqui, se r0 for menor ou igual a r1 então notem que a gente tem operações de subtração condicional operações de subtração condicional então operações de branch condicional, e esse aqui é um branch incondicional, que volta pra cá pra fazer isso aqui então notem que essas operações, a maioria das operações do ARM v7 podem ser condicionais o que compacta bastante o código notado? porque se um é maior que o outro tem que fazer essa subtração, caso contrário tem que fazer essa outra subtração essa subtração, caso contrário tem que fazer essa subtração perceberam a engenhosidade disso aqui? vou comparar um com o outro ele compara r0 com r1 isso aqui é que eu não estou entendendo porque que ele está se não forem iguais ele retorne eu vou dar uma conferida nisso aqui pra mim eu acho que se fossem iguais ele deveria retornar porque esse while não entra quando i for igual a j ele sai do while mas o importante que eu queria mostrar para vocês é essas operações aqui condicionais, Branch Condicionais, Subtrações Condicionais, praticamente tudo condicional o salto condicional é um salto incondicional com condição esse aqui é um salto incondicional e esse aqui é um salto incondicional isso aqui, notem que enquanto que digamos assim, foi uma inovação né pra ISA de 32 bits do ARMv7 mais que o v8 que a ISA de 64 bits e agora o v9 descartaram isso aqui completamente então essa aqui é uma boa ideia do que se poderia fazer mas notou-se que não é tão eficiente fazer todas as instruções, todas não, mas a maior parte das instruções condicionais aqui está um exemplo de codificação das instruções então primeiro é a codificação ARM segundo o RISC-V que a gente está acostumado esse aqui é o Thumb que a gente não viu certo? então todas elas tem 32 bits esse aqui é o tipo R então a gente tem os campos, o OPCODE, FUNC3 FUNC7 eu esqueci do FUNC7 aqui FUNC7 RS1, RS2, RD enquanto o ARM tem OPCODE mais esses dois OPCODES auxiliares RD, RS1 e RS2 nesses campos então esse aqui é como se fosse um OPCODE auxiliar e o RS2 então esse aqui é como se fosse um OPCODE auxiliar então esse aqui é como se fosse um OPCODE auxiliar então esse aqui é como se fosse um OPCODE auxiliar como se fosse o nosso FUNC7 para que define unicamente qual é a instrução então o Thumb também tem isso esse aqui é o OPCODE e aqui a complementação do OPCODE e para dar transferência de dados loads mais especificamente para BRANCH e para JUMPS então uma das coisas que a gente pode ver aqui é que ah só uma coisa esse primeiro aqui tá esse primeiro aqui tá esse primeiro aqui tá esse primeiro aqui tá esse primeiro aqui tá esse primeiro aqui tá esse primeiro aqui tá esse primeiro aqui tá esse primeiro aqui tá são exatamente esses bits aqui de condicionais certo então se eu quero fazer uma instrução não condicional, ele deve colocar 1110 ok entendeu ok a da filosofia de codificação de bits é com isso na posição desses bits aqui muda ISA compactada, ISA de 16 bits, né, então o ARM, ele criou essa ISA compactada, para que que você precisaria de uma ISA compactada, ao invés de gastar 32 bits pra uma instrução, gasta 16, grande vantagem é que teu programa fica menor, né, gasta menos memória, né, pra fazer a mesma coisa que outra que uma instrução de tamanho 32 faria, claro que tem várias tentações aqui, tamanhos do anti-registrador diminuíram, e coisas do tipo, mas aqui ele só está comparando o RISC-V no MIPS, que também tem ISA compactada e o ARM, tá aí mais ainda o x86, e aqui a ISA de 64 bits, aqui a ISA de 32 bits, então, como que você observa esse gráfico aqui? Bom, isso aqui é um gráfico. Em relação ao tamanho do código, certo, obtido, tá, então o que mais vai gerar o mesmo programa, só que escrito pra ISAs diferentes, então esse aqui seria o MIPS 32, seria 173% maior do que o comprimido do RISC-V, por isso que o ARM de 32C, C de compactado, então as instruções tem 16 bits digitais, de tamanho, e esse aqui é a ISA 32 não compactada, então o compactado, né, economiza praticamente 40% de tamanho, tá, se esse aqui é 100%, tá, esse aqui é 140%. O x86 vai te gerar um código desse tamanho aqui, então maior do que esse, mas menor do que esse, por quê? Porque o x86 tem uma estrutura CISC, então tem instruções especializadas. Então o que a gente precisa fazer aqui com um conjuntinho de instruções, aqui uma instrução só já é o suficiente, por isso que o código fica menor. Aqui a ARMv7, e aqui seria a ARMv7 compactada, essa aqui, então esse igual de compactação, então esse é praticamente igual a esse, né, e aqui o MIPS. E pra 64 bits, então, 64 bits compactado, do RISC-V, e 64 bits não compactado, o x86, né, que não tem compactação, do programa original, e o ARMv8, né, sem compactação, e o MIPS-64 sem compactação. Nesse caso aqui eles foram meio tendenciosos, que deveriam ter colocado aqui o ARM Thumb-2, e o MIPS-16E, que é compactado esse aqui. Aqui eles só colocaram, compararam uma versão compactada com as versões não compactadas, daí, das ISAs. Comparação meio que tendenciosa, né. Esse aqui saiu do MIPS-24, ok? Então, só pra vocês saberem que tem, então, ISAs compactadas. Ah, então, afinal, ARMv7 é RISC ou CISC devido às complexidades que ele apresenta, né. Então, embora seja uma arquitetura Load-Store, né, somente os loads e stores acessam a memória, né, ele foi projetado com essa filosofia Load-Store, devido à complexidade que o ARM tem, tem gente que considera o ARM não uma arquitetura com conjunto reduzido de instruções, mas sim um conjunto complexo, não tão complexo quanto o x86, mas mais complexo do que o RISC-V. Então, um exemplo de instrução desse tipo é essa aqui, STMFD, tá. Então, o que que essa instrução faz? Aqui eu tenho o endereço da pilha, tá. Então, o SP é o endereço da pilha. Então, essa instrução vai pegar os registradores R0 até o R12 e o LR, que é o meu registrador de retorno, e vai colocar todos esses registradores a partir dessa posição na pilha. Então, ele copia todos os registradores direto pra pilha. O processador não vai fazer tudo isso de uma vez só. Ele vai... R0 põe na pilha. R1 põe na pilha. R2 põe na pilha. LR põe na pilha. Certo? Então, isso aqui é uma instrução que faz tudo isso. E essa outra instrução aqui, LDMIA, ele vai pegar da pilha, certo, e colocar de volta nos registradores. A pilha é nessa posição aqui. Ele vai colocar de volta nesses registradores e no PC. Então, notem aqui que o registrador LR é LR. Que é o Link Register. Ele armazena o endereço de retorno. Certo? Ele vai armazenar os 13 registradores e mais um endereço de retorno na pilha. E quando ele recuperar os valores, ele vai recuperar os valores do R0 até R12 e vai colocar em PC o valor de retorno. Quer dizer, ele retorna automaticamente. A próxima instrução que vier depois dessa já vai ser no endereço de retorno. Sentiram? A jogada deles aqui. Salvou os registradores na pilha e o LR na pilha, que é o endereço de retorno. E essa instrução, então, carrega tudo. Carrega o endereço de retorno no PC. Logo, qual é a próxima instrução que vai ser executada? A instrução que tiver no endereço PC. Que era o endereço de retorno. Isso aqui é uma complexidade alta. De fazer isso aqui, tem uma instrução. Que nem tu copia um bloco de memória para outra posição. Mas, era considerado, então, ISA RISC. Mesmo com instruções poderosas que nem essas. Ok, então não houve uma ISA CISC mesmo. Um x86. Então, a grande evolução dos processadores da Intel seguiam sempre o dogma da retrocompatibilidade. Quer dizer, o processador mais atual tem que ser retrocompatível com os processadores anteriores. Certo? De modo que os programas feitos com os processadores anteriores, rodem no processador atual. Então, isso é uma das diretrizes da Intel. Então, assim, ela consegue ir avançando sem se preocupar em ter que trocar o software para rodar no novo processador. Então, as coisas continuam assim. Então, as coisas começaram em 1974 com o 8080. Foi um processador de 8 bits. Então, ele era do tipo aritmética por acumulador. Vocês se lembram quando eu falei lá, aritmética por acumulador, por pilha, registrador, registrador, registrador. O 8080 era baseado em acumulador. E tinha ainda mais 3 registradores. 3 pares de registradores. O 8086 já tinha 16 bits. Que foi pegando esse aqui. E estendendo. E a partir daqui começa um conjunto complexo de instruções. Ele pegou todas as instruções que tinham aqui. Copiou para cá e colocou mais instruções. O 8087 é o processador aritmético. Que eu já comentei para vocês. Que era o processador em ponto flutuante. Que realizava as operações em ponto flutuante. E que utilizava uma pilha. De 8 posições. 8 registros de stack. E ele acrescentou então 60 instruções de ponto flutuante. Ao 8086. O 80286, muito bem. Ele continuava sendo um processador de 16 bits. Então, os registradores eram de 16 bits. Só que, eles estavam já nessa época aqui. Sentindo que 16 bits não era suficiente. 16 bits endereça quanto de memória? 16 bits. Quanto de memória é endereçado se o registrador tem 16 bits? 2 elevado a 16. Então, dá quanto isso? Não sei lá. Vocês não sabem 2 elevado a 16? Isso, 65.536. Tá. Então. O máximo que podia ser era 64 kilobytes. Até aqui. Tá. Então, ele não podia ter memória maior que 64 kilobytes. Daí veio o 286. Viu que 64 kilobytes não era suficiente. Então, mesmo o processador sendo 16 bits. Ele aumentou o barramento de endereçamento para 24 bits. Quer dizer. Para eu endereçar. Para eu escolher um endereço aqui. Eu tinha que ter um registrador. E mais metade do outro. Certo? Então, eu tinha que ter um registrador de 16 bits. E mais a metade de outro registrador. Porque 16 mais 8 é 24. Então, o endereço era colocado dessa forma. Em 24 bits eu consegui endereçar quanto de memória? 24 bits endereça quanto de memória? Isso. 16 megabytes. 16 megabytes. Certo? Então, a partir daqui os processadores começaram a poder acessar. 16 megabytes. 16 megabytes de memória. Menos 1. Não, não. 16 megabytes de memória. O endereço é que vai de 0 até esse número aí. Menos 1. Mas a quantidade de memória é essa. Entendeu, Eduardo? 16 megabytes sim. É 16 megabytes sim. Porque 2 elevado a 24 é 2 elevado a 4. Vezes 2 elevado a 20. 2 elevado a 4 é 16. 2 elevado a 20 é mega. Certo? Ah. Que eu estou vendo aqui no Google. Está 16 megabytes para mim. Megabytes. Que é o certo de se chamar. Certo? Certo. Certo. Certo. Certo. Certo. Certo. Certo. Certo. Que é o certo de se chamar. Megabytes. Certo? Eu que estou usando aqui uma linguagem coloquial. Certo? Então 16 megabytes de memória. Viu que 16 megabytes de memória não era mais suficiente. E o que eles fizeram? Ok. Criaram o primeiro processador de 32 bits aqui. Certo? Então começa a chamar essa arquitetura de IA-32. Intel Architecture de 32 bits. Que depois com o tempo vai virar a x86. Isso aqui. Porque aqui era Intel que tinha criado essa arquitetura. 80x86. O que é 80x86? Ah, é, professor, eu já vi x86 bits. O que quer dizer, professor, x86 bits? É, acho que eu já vi um. Um outro. Desse jeito. Não, nunca vi, depois me manda um link aí. O que é isso que tu achou aí? Ok, então. Agora com 32 bits. Eu consigo endereçar os famosos 4 gigabytes. Os 4 gigabytes de memória. Que perdurou até. Surgirem os processadores. De 64 bits. Então, esse aqui. É o processador básico. Então, da Intel, a partir daqui. Todos os processadores foram compatíveis. Com esse aqui. Então, para fazer esse aqui, a Intel largou de novo. Quatro dessas coisas aqui. Então, um programa que roda no 286. Não vai rodar no 386. Então, aqui foi criado. Uma nova ISA. Mesmo para isso aqui. E a partir daqui, sim. Teve a retrocompatibilidade. Ok, botar mais modos de endereçamento. Mais operações. O uso de memória paginada. Agora, posso ter um segmento de memória. Para uma aplicação. Outro segmento de memória para outra aplicação. Outro segmento de memória para outra aplicação. Aí, evolui então. Em 1989, o 486. Tá aqui. Foi o primeiro. Esse aqui não era pipelineado. Esse aqui foi o primeiro que utilizou o pipeline. Que é a técnica de aceleração. Que nós vamos ver no final do curso. Colocou as caches para dentro do chip do processador. Nesse aqui, a cache era um circuito integrado. Fora do processador. Mas na mesma motherboard. E aqui foi para dentro. E o FPU também foi para dentro. Que antes era o 8087. Depois o 387. Que estava fora. Mas daí, a partir do 486. O FPU entrou para dentro do processador também. Aí, começaram a aparecer os competidores. AMD, Cyrix, VIA. Vários únicos aqui. Hoje em dia, vocês veem praticamente Intel, AMD. E VIA Technologies. Que fabricam os x86. E pro 486. Ele adicionou somente 4 novas instruções. Em relação ao 386. Então, quem tinha isso no 386. No 486 só teve mais 4 instruções. Em 1993. Vem o primeiro Pentium. Junto com o primeiro Pentium. A tecnologia superscalar. Que nós vamos ver aqui também. No final do curso. Que é, por exemplo, eu ter ao invés de uma ULA só. Eu ter duas ULAs. E assim eu consigo fazer 2 cálculos ao mesmo tempo. Certo? Então isso significa essa tecnologia superscalar. A grosso modo, tá pessoal? É um tanto mais complexo. Do que simplesmente botar duas ULAs lá. Duas ULAs lá. Parece. Música de campanha política. Mas vamos lá. E. O caminho de dados. Tem razão. E aqui o caminho de dados. Passou a ser de 64 bits. Eu podia então. Ler 64 bits. Da memória. Ao invés de ler 32. Certo? Então isso fazia com que a transferência. De dados fosse mais rápida. Antes eu tinha que ler 32 e 32. Agora eu posso ler de 64. A última versão. Que foi o Pentium MMX. A Multimedia eXtensions. Acrescentou 57 novas instruções MMX. Isso aqui é para. Instruções que facilitam. Por exemplo, a decodificação de vídeo. Para a gente apresentar vídeo. Na tela em Pentium. Aqui foi. O famoso bug. Do FDIV. O que é esse bug do FDIV? Eu só comentei. Mas não expliquei o que era. Sobre isso aqui. Não, eu só disse. Olha o bug disso aí. É o seguinte. Acho que foi em 94. Que aconteceu isso. A Intel lançou. Esse processador. E todo mundo. Dá para saber. Para substituir seus computadores. Por computadores novos. Só que tinha um matemático. De uma universidade dos Estados Unidos. Que ele precisava. De cálculos com. Precisão muito grande. Eu expliquei em ISC, mas aqui em OC não. Ele precisava de cálculos. De precisão muito grande. E o que ele descobriu? Que a instrução FDIV. Que é de divisão em ponto flutuante. Que utiliza tabelas. Isso aqui para implementar. Estava dando erro. Nas últimas casas decimais. Lá. E que não deveria dar. Aquele erro, uma coisa que ele tinha. Precisão suficiente para. Representar o número corretamente. Quer dizer, ele estava fazendo a divisão. Com erro. Certo, então a gente. Esse matemático. Contactou a Intel. Avisou a Intel sobre isso. Mas a Intel. Disse, olha, isso aí vai ser. Lá nas últimas casas decimais. Vai acontecer uma vez em 10 mil anos. De um usuário normal. Tu que é muito maluco que vai querer. Essa precisão. Mas daí o que aconteceu? A Intel não fez nada. Nessa época já tinha internet. Aí ele entrou na internet. Então o que ele provou. Ele pegou na internet os experimentos dele. E disse, olha. Eu encontrei um bug. Então com isso. Todo mundo que antes estava comprando. O Pentium. Começaram a parar de comprar. Por que eu vou comprar um chip que está bugado? Tá certo que o bug era ruim. Mas tinha. Daí o que que. Com isso a Intel. Teve que reconhecer. Que estava bugado. E teve que trocar os chips de todo mundo. Que tinha comprado. Fazer o famoso recall. E aí custou. Para tentar recuperar esse erro. Se ela tivesse já recuperado. Lá no início que ele tinha falado. Provavelmente. Ele teria o chip dele. Atualizado. E não iria mais perceber isso aí. A menos que tivesse outros cientistas. Que precisassem dessa precisão também. Então o bug do Pentium. Isso aqui ficou conhecido. Depois em 95, Pentium Pro. Em 1997. Esses bugs. São bem mais raros. Eu diria o seguinte. Eu tenho certeza que todos os chips. Têm bugs. Só que a Intel não fala. Elas corrigem nas próximas versões. Certo. E quem encontra. Com bug vai falar com a Intel. Então isso não é mais aberto. Ao público. Não espantar ao público. Teoria da conspiração. Acho muito difícil. Ter um chip da complexidade. Por exemplo. Desses i7 de 12ª geração. Que são 20 bilhões de transistores. Lá dentro. Que não tenha algum bug. Só que é um bug que. Não afeta o funcionamento dele. Em áudio. Ok, então o que veio. Uma nova microarquitetura. O que é uma microarquitetura para a Intel. Uma nova organização. Certo. Então deixou de ser. A organização. Certo. A gente viu aquelas organizações. Foi a P2, P3, P4, P5, Mobile. Certo. Então veio uma nova organização. Sem novas instruções. Então eles mexeram só no hardware. Não mexeram na ISA. Depois o Pentium 3. Adicionou 70 novas instruções. Que foi chamado de SSE. Streaming SIMD Extensions. Significa o que isso aqui. Significa que eu tenho uma instrução. E eu posso usar essa instrução. Para trabalhar com vários dados. Que é uma instrução SIMD. Posso porque o registrador tem 32 bits. Certo. 32 bits são 4 bytes. Se eu pegar com essas instruções aqui. Eu posso considerar que isso aqui. São 4 dados de 4 bytes. E eu mandar então. Somar isso aqui com um outro dado. De 4 bytes. Assim. Que não tenha divide 1 entre eles. Então como se eu estivesse operando. A soma de 4 inteiros ao mesmo tempo. Para ficar na ideia. Quer dizer instrução Single Instruction Multiple Data. Ou então 2 números de 16 bits. Posso operar os dois como se fossem 2 números separados. Então vou estar fazendo 2 operações. Com 16 bits ao mesmo tempo. Seria ao mesmo tempo. E com eles foram associados. Registradores de 128 bits. Mas professor. Me disseram que não tinha. Registradores com 128 bits. Não, não tem ainda. Tem arquiteturas que trabalham. Com processadores de 128 bits. Esse aqui são bits. Para essa aplicação. Então 128 bits. Dá quantas words aqui dentro? Se eu tenho um registrador de 128 bits. Quantas words cabem aí dentro? 4. Quantos bytes cabem aí dentro? 128 bits por 4. 128 bits por 8. 128 bits por 8. 16. Então eu tenho um registrador de 128. Com outro registrador de 128. É como se eu estivesse operando. A mesma operação soma. Os 16 bytes. Ao mesmo tempo. Certo? Registradores de uso geral. Que são registradores de uso específico. Para esse conjuntinho de instruções. Entenderam? O porquê disso? Porque a gente pode colocar. Compactar vários dados. Em uma mesma word de 128. E mandar uma única instrução fazer. Por exemplo operações de tração e multiplicação. Entre eles. Certo? Como se estivesse trabalhando com um vetor. Por exemplo um vetor de 4 words. Outro vetor de 4 words. Hoje em dia os conjuntos mais novos. Isso aqui já está em 256 bits. Se eu não me engano. Já tem até de 512 bits. Registradores de uso específico. Ok. 2001. Em 2001 a nova microarquitetura. Adicionou mais 144. Novas instruções. Que foi o SSE2. Em 2003. Em 2003 a AMD. Lança a arquitetura. De 64 bits dela. Chamada AMD64. AMD64. Certo? E que a Intel. Adotou depois. Por isso que transformou nesse nome aqui. Que o nome original era AMD64. Daí a Intel. Adotou. Fez alguns refinamentos. E chamou de Intel 64. E ainda. Adicionou 3 novas instruções. Que estão formando o conjuntinho SSE3. Que são operações complexas. Operações com números complexos. Depois vem Intel Core. Em 2006. 54 novas instruções. Do conjuntinho SSE4. Para facilitar. A criação de máquinas virtuais. Então se já usaram máquina virtual. Quer dizer Linux dentro do Windows. Ou Windows dentro do Linux. Né. Esse tipo de coisa. Então em servidores. Máquinas virtuais. É o que eles trabalham. Tem que ter um bom suporte a isso. Em 2007. A AMD. Lançou 170 novas instruções. Que ele chamou de SSE5. Mas a Intel. Não quis adotar. E criou a sua própria versão. Então a AMD tem esse SSE5. Mas o processador da Intel não tem. Daí vem. Os Intel Core. Então aqui eu tinha meio que Intel. Intel i7 para mais. Para esse aqui. Esse aqui era o Core. Depois o Core i1, o Core Quad. E depois o Core i2. Que foram essas famílias Core. E aqui já é o Intel Core. Que vem começando 3, 5 e 7. Colocaram então mais um conjunto de instruções. Para extensão vetorial. Para cálculo vetorial. Adicionaram. Registradores maiores. Para trabalhar com esses vetores. Então 256 bits. Então podia ter vetores grandes. Ali. Adicionaram 250. Foram redefinidas 250 instruções. E adicionaram mais 128. E também. Mais 47. Novas instruções. De 3 operandos. Como assim professor. Quer dizer que até 2008. A Intel não. Trabalhava com 3 operandos. Quer dizer. Somar dois registradores e colocar no terceiro. Não. A Intel não usava. Essas instruções só aconteceram aqui. Certo. Então vamos ver como a Intel fazia isso. Depois terceira geração. Adicionou mais coisas. Maior ainda o SSE. Que passou a ser de 512 bits. Esses registradores especiais. Para cálculo vetorial. E AVX. E aqui continuamos. Só que eu não continuei aqui. Acho que vou ter que fazer isso nas minhas férias. Arrumar isso aqui para atualizar. Bem atrasado 2003. Vamos começar para dar uma ideia para vocês. Vamos lá. Como é que era o banco de registradores dos processadores da Intel. Então como eu disse. A Intel começou com 8 bits. Certo então 8085 era um processador de 8 bits. E tinha como. Registradores o registrador A. O C, o E, A, B, C, D, E mais alguns ponteiros. Certo. O 8086 foi de 16 bits. Então. O banco de registradores da Intel era 1, 2, 3, 4 registradores. De uso geral. E outros que eram ponteiros. Esse aqui SP, BP, SI, DI. Certo. 8086. Os registradores foram aumentados para 16. Então o registrador A. Que era de 8. Passou a ser 16. E passou a ser chamado de AX. Onde eu tenho aqui a parte baixa do A, AL. E a parte alta do A, AH. Certo então um registrador de 16 bits. Feito a partir da extensão do registrador de 8 bits. E assim para todos esses aqui. Esses aqui já eram de 16 bits. Para conseguir endereçar os 64 KB de memória. Certo. Aí veio o 386. E estendeu isso para 32 bits. Certo então. Eles começaram. Pegaram o registrador AX. E acrescentaram mais 16 bits aqui. Gerando então. EAX. Extended AX. Certo então agora o Extended AX. Tem 32 bits. O AX tem 16 bits. E o AH e o AL tem 8 bits. Certo mas tudo é o mesmo registrador. Eu só posso. Apontar. Para esses quantos digamos assim do registrador. Então e também. Esses registradores aqui passaram a ser de propósito geral. Então aumentou. O número de registradores de propósito geral. Até. Aqui então foram 8 registradores. De propósito geral. E aqui. A gente tem registradores que são. Ponteiros. Esses aqui. Ok. Esse aqui é o PC. O instruction pointer. É esse aqui. Que eles chamam de IP. E aqui as flags condicionais. E. No de 8 registradores de ponto flutuante. A gente já viu. É uma pilha de 8 registradores. Com 80 bits cada um. Então com 80 bits. Tu tens uma precisão. Muito melhor. Do que precisão dupla. Que é uma precisão quádrupla. Então a Intel já tinha lançado isso aqui. Antes. Das coisas de precisão dupla. Ficarem comuns. Né. Então ela permaneceu com os 80 bits. Então notem que o banco. De registradores da Intel. Foi se modificando ao longo do tempo. Até ficar nesse aqui. 8 registradores de propósito geral. O PC. Mas originalmente ela só tinha 4. Registradores. Ok. Então como em 2008 eles lançaram. Aquelas instruções com 3 operandos. Como é que era? Então as instruções até então. Eram instruções de 2 operandos. Onde um dos operandos. Era a fonte de dados. O outro era outra fonte de dados. Mas esse aqui. Também era o destino dos dados. Então é como se a gente tivesse assim. Por exemplo ADD EAX, EBX. Certo? Então o que essa instrução manda fazer? Soma o conteúdo de 32 bits. Do EBX. Com o conteúdo de 32 bits do EAX. E coloca o resultado. No EAX. Certo? Então sempre. O primeiro argumento aqui. Era para onde iam os resultados. Também. Você não podia colocar isso aqui em outro registrador. Que não fosse ele mesmo. Certo? E a Intel viveu com isso. Durante muitos anos. Sem problema nenhum. Por isso. Operações de 2 argumentos. Agora eles têm operações de 3. Argumentos. ADD GPR0, GPR1, GPR2. Soma 1 com 2. E coloca o resultado em 0. A partir de 2008. Que começaram a ter instruções desse tipo. Ok, e uma outra característica. Que também é muito importante. É que. O primeiro operando poderia ser um registrador. Teria que ser um registrador. Como esse aqui. O segundo operando poderia ser um registrador. Como a gente fez aqui. Poderia ser um número imediato. Ah 127. Então soma EAX com 127. Coloca o resultado em EAX. Poderia ser. Um argumento vindo da memória. Eu vou colocar aqui só um. Por exemplo. O [EDX]. O que isso aqui significa. Significa que eu vou ler. Do endereço. Que tiver em EDX. Lá da memória. Vou somar com EAX. E armazenar o resultado em EAX. Então o segundo argumento. Poderia vir da memória. E também o primeiro argumento. Não precisava ser só um registrador. Poderia ser a memória também. Quer dizer. Poderia ter isso aqui. Não poderia ter duas memórias. Então ADD [EAX], EBX. Ele vai ter que ler o valor desse registrador. Lá da memória. Somar com esse registrador. E armazenar nessa posição de memória. Poderia fazer isso. Assim como poderia ter memória mais imediata. Então. Dessa posição de memória. Soma com o número imediato. E armazena nessa mesma posição de memória. Isso que não é uma arquitetura Load-Store. Quer dizer. Essas operações simples. Acessam a memória também. O que complica muito. O projeto do processador. Que outras instruções acessem a memória. A gente vai ver quando começarmos. Com o projeto total. Então a gente teria essas condições. E a partir de 2008 é que começaram a surgir. Essas instruções. De três argumentos. Os endereços na memória. O endereço pode estar no registrador. Pode. O endereço pode ser um registrador de base. Mais um deslocamento. Mais um offset. Poderia ser. Registrador de base. Mais um registrador de índice. Então um registrador indexado. Multiplicado por uma escala. E essa escala ser uma potência de 2. Então multiplicar por 1, por 2, por 4, por 8, por 16. Não. Até por 8 só. Então a escala vai de 0, 1, 2, 3. Então eu posso pegar o conteúdo do registrador. E multiplicar ele por essa escala. Pode ser um registrador de base. Mais a escala. Vezes o registrador de índice. Mais um deslocamento. Então bastante flexibilidade. Em como definir um endereço na memória. X86. Grande problema do x86. É que diferente do RISC-V. Do ARM. E do MIPS. Que todas as instruções tem 32 bits. No x86 as instruções tem tamanhos variáveis. Então por exemplo. Essa instrução CALL. Aqui tem 40 bits. De tamanho. Quer dizer. O CALL pode acessar qualquer parte. Da memória de 4GB. Diretamente. Porque essa instrução tem 40 bits. De tamanho. Essa instrução aqui. Faz um PUSH. Desse registrador. Então somente 8 bits. Então eu posso ter coisas. Tão grandes quanto 48 bits. Tipo esse aqui. E coisas tão pequenas quanto 8 bits. Então as instruções têm tamanhos variáveis. Se as instruções têm tamanhos variáveis. Também tu sabe. Qual é a próxima instrução? Eu sei que eu estou. No RISC-V. Eu sei que eu estou. Na instrução PC. Qual é o endereço da próxima instrução? Se eu estou na instrução PC. Endereço da próxima PC mais 4. E o x86. Que eu não conheço. Como eu vou saber fazer isso? Se eu estou na instrução PC. Eu vou ter que ler a instrução. Decodificar a instrução. Para então descobrir. Onde está a próxima instrução. Eu não posso simplesmente dizer. Ah vá para a PC mais 4. Que não é. Eu tenho que executar. E qual é a instrução. E decodificar para então saber. Qual é a próxima instrução. E isso complica muito. O projeto do hardware. É ralado isso aqui. Aqui está um exemplo. Vamos entrar em detalhes. Esse mesmo algoritmo de Euclides. Aqui está em RISC-V. E aqui está em Assembly x86. Então o percent e ax. É justamente os registradores. Jump if equal. Jump if less or equal. Isso aqui é simplesmente jump. Certo. E aqui é a comparação. Jump not equal. E aí ele vai para L5. E se os dois não forem iguais. Ele vai para L5. E fica aqui nesse loop. Ok. Como se implementa esse conjunto de instruções. Do x86 então? Então. A forma de fazer isso. Como temos instruções complexas. Instruções que necessitam. Vários ciclos de clock. Para serem executados. Temos instruções simples. As normalzinhas que necessitam. A gente tem instruções complexas. Depende de vários ciclos de clock. Então, instruções simples e instruções complexas. Como que isso é projetado? Então, a gente vai verificar isso, a gente vai fazer esse tipo de implementação que vai ser a nossa implementação multi-ciclo. A gente vai implementar o RISC-V em multi-ciclo. Então, o RISC-V em multi-ciclo não fica muito legal de seguir, porque ele já é um processador RISC, só tem instruções simples. E aí, a gente vai fazer isso em vários passos aí, então a gente pode parecer, mas multi-ciclo não serve para muita coisa. Não serve para muita coisa com RISC-V, já que ele já é RISC. Mas em x86, você precisa implementar usando aquela metodologia que a gente vai ver, que é dividir uma instrução em diversas etapas. E para a instrução ser completa, ele tem que passar por todas as etapas. E o Intel diz que o desempenho é comparável aos RISCs. A Intel disse isso. Então, tendencioso esse negócio? Não sei. Porque os processadores mais rápidos são os x86. E cabe aos compiladores tirar proveito dessa complexidade toda. O usuário normal não vai escrever em sã consciência um programa em Assembly x86. Porque ele vai estar usando só um pequeníssimo conjunto de instruções. Vai ter muitos outros recursos que eles nem sabem que existe, que poderia simplificar ou tornar o programa mais eficiente. Já os compiladores não. Os compiladores foram feitos para usar todos os recursos disponíveis no processador. Certo? Então, isso aqui é a função do compilador hoje em dia. Então, algumas falácias. Instruções poderosas significa melhor desempenho? Verdadeiro ou falso? Só escreva aí. Verdadeiro ou falso? Instruções poderosas? Tipo do x86. Significa melhor desempenho? Sim ou não? Tá bom, Eduardo. Então pensem sobre isso. Uso de linguagem Assembly. Melhor desempenho? Eu acabei de explicar. Realmente, eu vou na letra na altura de mistura de verdadeiro com falso. Inverso. Verdadeiro com falso. Certo? Uso da linguagem Assembly. Melhor desempenho? Olha, antigamente melhorava. Tu escrevia diretamente em Assembly e o processador. Hoje, melhor se tu pegar pequenos trechos. Pequenos trechos que tu vê que a compilação não está dando muito boa, se tu escrever em Assembly, tu pode melhorar bastante o desempenho do teu programa. Mas, via de regra, os processadores, os compiladores hoje em dia já estão muito prontos para isso. Aqui está a evolução da quantidade de instruções ao longo do tempo. Hoje em dia está com mais de 2.500 instruções, isso aqui. Então, é uma arquitetura CISC. Mais de 2.000 instruções. E isso aqui vai completar a aula. Bem, e com essa filosofada aí do MIPS, a gente finaliza essa aula de outras arquiteturas. x86 é tudo, mas não é tudo isso de complexo. A gente só faz o que a gente sente, né? Ok, pessoal? Tudo isso devido à retrocompatibilidade. Dúvidas? Ah, assinem a... Façam o testinho, esqueci. É, boa, Vitor. Façam o testinho lá, porque eu já quase tinha esquecido. Para vocês sinalizarem a presença. Dá pra fazer até as quatro e dez, tá? Tá certo, mas hoje o Vitor tava ali e ele lembrou. No momento que eu lembrei. Teve um transmissão de pensamento entre eu e ele. Ok, pessoal? Então, ficamos por aqui. Na próxima aula é o laboratório, tá? Então, vai ser mais divertido. Bora. Então, já brinquem com o Assembly, para vocês chegarem lá no laboratório, já com certa prática, se familiarizem com o Assembly, tá bom? Diga, Sam. Mas aqui vai ser tudo divertido. Espera só para ver o que vai ser o projeto, vocês. Certo? Então, eu parei as gravações.",
        "video_source": "OAC_2022-02-23.mp4"
    },
    {
        "id": 12,
        "timestamp_start": 7019.01,
        "timestamp_end": 7022.48,
        "slide_description": "Como Engenheiro de Computação Sênior, analiso o slide e o contexto apresentados.\n\nO slide principal, intitulado \"Conclusão\", é parcialmente visível, com o seguinte texto legível na parte inferior do título: \"In 1994, AMD's 80x86 architect, Mike Johnson,\". No cabeçalho do slide, acima do conteúdo principal, identifica-se o contexto da aula: \"UnB - CIC0099 - Organização e Arquitetura de Computadores\". Abaixo disso, há a identificação da instituição e departamento: \"Universidade de Brasília\", \"Departamento de Ciência da Computação\", e o nome do professor, \"Prof. Marcus Vinicius Lam...\", parcialmente cortado.\n\nSobreposto ao conteúdo do slide, há uma caixa de diálogo modal com o título \"Pausar gravação\". O texto desta caixa de diálogo questiona: \"Tem certeza de que deseja pausar a gravação? Você pode retomar a qualquer momento pressionando o botão de gravação novamente.\" Duas opções de botão são apresentadas: \"Sim\" e \"Não\". O botão \"Sim\" está visualmente selecionado e com o cursor do mouse sobre ele, indicando uma intenção de pausa.\n\nÀ esquerda da tela, um painel de interface de usuário (UI) mostra funcionalidades de comunicação e lista de participantes. Este painel inclui seções como \"MENSAGENS\", \"Perguntas\" e \"Bate-papo público\", indicando uma interação em tempo real. A lista de usuários ativos, \"USUÁRIOS (21)\", sugere a presença de 21 participantes na aula. O chat exibe diversas mensagens de alunos, algumas com referências diretas ao conteúdo ou ao andamento da aula, como \"kkk teoria da conspiração\", \"Victor Hugo Rodrig... 4\", \"Victor Hugo Rodrig... 16\", \"Victor Hugo Rodrig... PC + 4\", \"Eduardo Ferreira M... valso\", \"falso\", \"esse eu realmente errei, na letra\", \"Victor Hugo Franca... Você valsa?\", \"É um bom pé de valsa\", \"Não esqueçam do testinho\", \"Gabriel Kenji ... ja ia mandar a carta;;\", \"Victor Hugo Franca ... Sim\", \"kkkkk\", \"Victor Hugo Franca ... eba\", e \"Eduardo Ferreira M... \"diversão\" (emoji)\". A timestamp \"117:07\" no canto superior direito indica a duração da sessão ou gravação.\n\nNão há diagramas específicos de Datapath, Pipeline, Hierarquia de Memória ou trechos de código (Assembly, C, Verilog) visíveis neste slide. A ênfase é em um ponto de \"Conclusão\" na aula de Arquitetura de Computadores, com menção a figuras históricas da indústria de processadores (Mike Johnson, arquiteto da AMD para 80x86), enquanto uma interação da plataforma está em andamento (pausar a gravação) e o chat reflete a comunicação dos alunos.",
        "transcription": "aqui e aqui.",
        "video_source": "OAC_2022-02-23.mp4"
    }
]